import random
from flask import Flask, redirect, render_template, render_template_string, request, session, url_for
import sqlite3
app = Flask(__name__)
app.secret_key = 'ser_el_tafouk_secret_key' # مفتاح الجلسة لتخزين الأسئلة والإجابات

def init_db():
    conn = sqlite3.connect("database.db")
    cursor = conn.cursor()
    cursor.execute("""
        CREATE TABLE IF NOT EXISTS users (
            phone TEXT PRIMARY KEY,
            device_id TEXT
        )
    """)
    conn.commit()
    conn.close()

init_db()

def add_approved_student(phone_number):
    conn = sqlite3.connect("database.db")
    cursor = conn.cursor()
    cursor.execute(
        "INSERT OR IGNORE INTO users (phone, device_id) VALUES (?, NULL)",
        (phone_number,),
    )
    conn.commit()
    conn.close()

@app.route("/login", methods=["GET", "POST"])
def login():
    if request.method == "POST":
        student_phone = request.form.get("phone")
        device_id = request.headers.get("User-Agent")

        approved_phones = ["0545494472", "0510870096", "01122775099", "01221581154"]
        
        if student_phone not in approved_phones:
            return "عذراً، هذا الرقم غير مشترك أو لم يتم تفعيل الاشتراك بعد. تواصل مع الإدارة على الواتساب 01221581154."
            
        conn = sqlite3.connect("database.db")
        cursor = conn.cursor()
        cursor.execute("SELECT device_id FROM users WHERE phone = ?", (student_phone,))
        user = cursor.fetchone()

        if user is None:
            cursor.execute("INSERT INTO users VALUES (?, ?)", (student_phone, device_id))
            conn.commit()
        elif user != device_id:
            conn.close()
            return "عذراً، هذا الحساب مفتوح بالفعل على جهاز آخر ولا يمكن تكراره، فضلاً تواصل مع الإدارة على واتساب 01221581154"

        conn.close()
        session["phone"] = student_phone
        return redirect(url_for('index'))

    return render_template_string('''
<!DOCTYPE html>
<html lang="ar" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>تسجيل الدخول</title>
    <style>
        body { font-family: sans-serif; background-color: #114b3e; display: flex; justify-content: center; align-items: center; height: 100vh; margin: 0; }
        .box { background: white; padding: 30px; border-radius: 10px; box-shadow: 0 4px 15px rgba(0,0,0,0.1); text-align: center; width: 100%; max-width: 400px; box-sizing: border-box; }
        input { width: 100%; padding: 12px; margin: 15px 0; border: 1px solid #ccc; border-radius: 5px; text-align: center; font-size: 16px; box-sizing: border-box; }
        button { width: 100%; padding: 12px; background-color: #455a64; color: white; border: none; border-radius: 5px; font-size: 16px; cursor: pointer; font-weight: bold; width: 100%; }
    </style>
</head>
<body>
<div class="box">
    <h2>منصة سر التفوق التعليمية</h2>
    <form action="/login" method="POST">
        <label>أدخل رقم الموبيل المشترك به:</label>
        <input type="text" name="phone" placeholder="01xxxxxxxxx" required autocomplete="off">
        <button type="submit">ابدا مع سر التفوق</button>
<a href="https://wa.me/201221581154?s=t" style="display: block; width: 100%; padding: 12px; background-color: #25d366; color: white; border-radius: 5px; font-size: 16px; cursor: pointer; font-weight: bold; text-decoration: none; box-sizing: border-box; margin-top: 10px; text-align: center;" target="_blank">💬 للاشتراك اضغط هنا</a>

    </form>
</div>
</body>
</html>
''')
    
QUESTIONS_DB = {
    "مبتدئ": [
        {
          "id": 1,
        "type": "multiple choice",
        "prompt": "تعد قارة إفريقيا ثاني أكبر قارات العالم من حيث المساحة بعد قارة:",
        "options": ["أوروبا", "أمريكا الشمالية", "آسيا", "أستراليا"],
        "answer": "آسيا"
    },
    {
        "id": 2,
        "type": "true/false",
        "prompt": "تبلغ مساحة قارة إفريقيا حوالي 30.4 مليون كم٢.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 3,
        "type": "multiple choice",
        "prompt": "تمثل مساحة قارة إفريقيا من مساحة قارات العالم نسبة:",
        "options": ["10%", "20%", "25%", "30%"],
        "answer": "20%"
    },
    {
        "id": 4,
        "type": "true/false",
        "prompt": "تقع قارة إفريقيا في وسط قارات العالم القديم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 5,
        "type": "multiple choice",
        "prompt": "تتصل قارة إفريقيا بقارة آسيا عن طريق:",
        "options": ["مضيق باب المندب", "شبه جزيرة سيناء", "مضيق جبل طارق", "قناة السويس"],
        "answer": "شبه جزيرة سيناء"
    },
    {
        "id": 6,
        "type": "multiple choice",
        "prompt": "تقترب قارة إفريقيا من قارة أوروبا عند مضيق:",
        "options": ["باب المندب", "هرمز", "موزمبيق", "جبل طارق"],
        "answer": "جبل طارق"
    },
    {
        "id": 7,
        "type": "true/false",
        "prompt": "يحد قارة إفريقيا من جهة الشمال البحر الأحمر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 8,
        "type": "multiple choice",
        "prompt": "المسطح المائي الذي يفصل قارة إفريقيا عن قارتي أمريكا الشمالية والجنوبية هو:",
        "options": ["المحيط الهندي", "المحيط الأطلنطي", "البحر المتوسط", "المحيط القطبي"],
        "answer": "المحيط الأطلنطي"
    },
    {
        "id": 9,
        "type": "true/false",
        "prompt": "يمر مدار السرطان في النصف الشمالي من قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 10,
        "type": "multiple choice",
        "prompt": "يمر خط الطول الرئيسي (جرينتش) في قارة إفريقيا جهة:",
        "options": ["الشرق", "الغرب", "الشمال", "الجنوب"],
        "answer": "الغرب"
    },
    {
        "id": 11,
        "type": "true/false",
        "prompt": "يقع نحو ثلثي مساحة قارة إفريقيا في نصف الكرة الأرضية الجنوبي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 12,
        "type": "multiple choice",
        "prompt": "الموقع بالنسبة لدوائر العرض وخطوط الطول يُقصد به:",
        "options": ["الموقع الجغرافي", "الموقع الفلكي", "الموقع الاستراتيجي", "الموقع الاقتصادي"],
        "answer": "الموقع الفلكي"
    },
    {
        "id": 13,
        "type": "true/false",
        "prompt": "الأهمية الاستراتيجية هي أهمية المكان وقت الحروب والأزمات والسلم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 14,
        "type": "multiple choice",
        "prompt": "أدى الموقع الفلكي لقارة إفريقيا بشكل مباشر إلى تنوع:",
        "options": ["الممرات المائية", "الموقع الاستراتيجي", "المناخ", "الحدود السياسية"],
        "answer": "المناخ"
    },
    {
        "id": 15,
        "type": "true/false",
        "prompt": "نشأت حضارة قرطاج القديمة على أرض دولة تونس الحالية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 16,
        "type": "multiple choice",
        "prompt": "نشأت حضارة أكسوم القديمة في قارة إفريقيا على أرض:",
        "options": ["السودان", "تونس", "إريتريا وإثيوبيا", "مصر"],
        "answer": "إريتريا وإثيوبيا"
    },
    {
        "id": 17,
        "type": "true/false",
        "prompt": "نشأت حضارة كوش القديمة في دولة ليبيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 18,
        "type": "multiple choice",
        "prompt": "مجموع الإنتاج الثقافي والمادي الذي يميز مجتمعاً عن غيره يُعرف بـ:",
        "options": ["التاريخ", "الحضارة", "الجغرافيا", "العادات"],
        "answer": "الحضارة"
    },
    {
        "id": 19,
        "type": "true/false",
        "prompt": "انتقلت الثقافة والحضارة الإسلامية من آسيا إلى إفريقيا عبر شبه جزيرة سيناء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 20,
        "type": "multiple choice",
        "prompt": "من أوائل المصريين القدماء الذين قاموا بأربع رحلات نحو الجنوب واكتشفوا أجزاء من إفريقيا:",
        "options": ["الملك نخاو الثاني", "الرحالة حرخوف", "محمد علي باشا", "الخديو إسماعيل"],
        "answer": "الرحالة حرخوف"
    },
    {
        "id": 21,
        "type": "true/false",
        "prompt": "أرسل الملك نخاو الثاني بعثة من الفينيقيين للدوران حول إفريقيا استمرت لمدة 3 سنوات.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 22,
        "type": "multiple choice",
        "prompt": "بدأت رحلة بعثة الملك نخاو الثاني للدوران حول إفريقيا من:",
        "options": ["البحر المتوسط", "البحر الأحمر", "مضيق جبل طارق", "المحيط الأطلنطي"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 23,
        "type": "true/false",
        "prompt": "انتهت رحلة بعثة الملك نخاو الثاني وعادت إلى مصر عبر مضيق باب المندب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 24,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات لاكتشاف منابع النيل عام 1839م وانتهت باكتشاف:",
        "options": ["النيل الأزرق", "نهر عطبرة", "النيل الأبيض", "بحيرة تانا"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 25,
        "type": "true/false",
        "prompt": "وصل حكم الخديو إسماعيل إلى جنوب دائرة الاستواء أثناء اهتمامه باكتشاف منابع النيل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 26,
        "type": "multiple choice",
        "prompt": "رحالة عربي قام برحلات مهمة في شمال وغرب إفريقيا واخترق الصحراء الكبرى حتى وصل إلى مالي:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "الإدريسي"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 27,
        "type": "true/false",
        "prompt": "يعد الرحالة العربي المسعودي من أوائل الذين زاروا إفريقيا وكتبوا عنها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 28,
        "type": "multiple choice",
        "prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا في القرن الـ 15 الميلادي في عهد الأمير:",
        "options": ["فاسكو دي جاما", "بارتولوميو دياس", "هنري الملاح", "جون سبيك"],
        "answer": "هنري الملاح"
    },
    {
        "id": 29,
        "type": "true/false",
        "prompt": "أسس البرتغاليون الموانئ والمراكز التجارية على طول طريق رأس الرجاء الصالح لتأمين الملاحة والتجارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 30,
        "type": "multiple choice",
        "prompt": "تصارعت الدول الاستعمارية الأوروبية على إفريقيا لنهب خيراتها، مما نتج عنه تقسيمها إلى:",
        "options": ["22 دولة", "44 دولة", "54 دولة", "64 دولة"],
        "answer": "54 دولة"
    },
    {
        "id": 31,
        "type": "true/false",
        "prompt": "أكبر دول القارة الإفريقية من حيث المساحة هي دولة مصر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 32,
        "type": "multiple choice",
        "prompt": "تقع جمهورية مصر العربية في القارة الإفريقية في الركن:",
        "options": ["الشمالي الغربي", "الشمالي الشرقي", "الجنوبي الشرقي", "الجنوبي الغربي"],
        "answer": "الشمالي الشرقي"
    },
    {
        "id": 33,
        "type": "true/false",
        "prompt": "الدول الحبيسة هي الدول التي لا تطل على مسطحات مائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 34,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الحبيسة في قارة إفريقيا دولة:",
        "options": ["الصومال", "المغرب", "تشاد", "مصر"],
        "answer": "تشاد"
    },
    {
        "id": 35,
        "type": "true/false",
        "prompt": "تضم قارة إفريقيا 10 دول عربية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 36,
        "type": "multiple choice",
        "prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي مما عمق دورها الريادي وكان ذلك عام:",
        "options": ["2011م", "2015م", "2019م", "2026م"],
        "answer": "2019م"
    },
    {
        "id": 37,
        "type": "true/false",
        "prompt": "تعد دولتا النيجر ومالي من الدول الساحلية في قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 38,
        "type": "multiple choice",
        "prompt": "يتكون أغلب سطح قارة إفريقيا من تضاريس واسعة هي:",
        "options": ["السهول", "الهضاب", "الجبال", "المنخفضات"],
        "answer": "الهضاب"
    },
    {
        "id": 39,
        "type": "true/false",
        "prompt": "تنحدر هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 40,
        "type": "multiple choice",
        "prompt": "من أمثلة الواحات التي تقع في هضبة شمال إفريقيا بدولة ليبيا واحة:",
        "options": ["سيوة", "القطارة", "الجوف", "عين صالح"],
        "answer": "الجوف"
    },
    {
        "id": 41,
        "type": "true/false",
        "prompt": "تعد هضبة الحبشة (الهضبة الإثيوبية) أعلى هضاب القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 42,
        "type": "multiple choice",
        "prompt": "تميزت هضبة الحبشة بخصوبة تربتها نتيجة لتعرضها لـ:",
        "options": ["الحركات الالتوائية", "التعرية المائية", "الطفوح البركانية", "الانكسارات الطولية"],
        "answer": "الطفوح البركانية"
    },
    {
        "id": 43,
        "type": "true/false",
        "prompt": "تمر دائرة الاستواء في وسط قارة إفريقيا عبر هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 44,
        "type": "multiple choice",
"prompt": "من أمثلة البحيرات العذبة التي تكثر في هضبة البحيرات الاستوائية بحيرة:",
"options": ["تانى", "ناصر", "فيكتوريا", "قارون"],
"answer": "فيكتوريا"
},
{
"id": 45,
"type": "true/false",
"prompt": "يمتد الأخدود الإفريقي العظيم في الجزء الغربي من الهضبة الجنوبية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 46,
"type": "multiple choice",
"prompt": "مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال هي:",
"options": ["جبال أطلس", "الأخدود الإفريقي العظيم", "حوض نهر النيل", "هضبة الشطوط"],
"answer": "الأخدود الإفريقي العظيم"
},
{
"id": 47,
"type": "true/false",
"prompt": "يعتبر البحر الأحمر وخليج عدن وخليج العقبة من أجزاء الأخدود الإفريقي العظيم.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 48,
"type": "multiple choice",
"prompt": "يقع جبل العوينات على الحدود السياسية بين مصر ونيجيريا وتشاد:",
"options": ["مصر وليبيا والسودان", "مصر وتونس والجزائر", "السودان وإثيوبيا وكينيا", "مالي والنيجر وتشاد"],
"answer": "مصر وليبيا والسودان"
},
{
"id": 49,
"type": "true/false",
"prompt": "تعد الصحراء الكبرى أكبر صحاري العالم وتنتشر فوق هضبة شمال إفريقيا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 50,
"type": "multiple choice",
"prompt": "من الدول العربية الإفريقية التي تقع بالكامل في نصف الكرة الأرضية الغربي:",
"options": ["مصر والسودان", "تونس والجزائر", "المغرب وموريتانيا", "ليبيا وجيبوتي"],
"answer": "المغرب وموريتانيا"
},
{
 "id": 51,
        "type": "multiple choice",
        "prompt": "تمتد جبال دراكنزبرج في قارة إفريقيا في جهة:",
        "options": ["الشمال الغربي", "الشرق", "الوسط", "الجنوب"],
        "answer": "الجنوب"
    },
    {
        "id": 52,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 53,
        "type": "multiple choice",
        "prompt": "تعد جبال أطلس التل وأطلس الصحراء من السلاسل المتوازية في قارة إفريقيا وموقعها في:",
        "options": ["شمال شرق القارة", "شمال غرب القارة", "جنوب القارة", "شرق القارة"],
        "answer": "شمال غرب القارة"
    },
    {
        "id": 54,
        "type": "true/false",
        "prompt": "تساهم المناطق الجبلية في قارة إفريقيا في دعم النشاط السياحي بسبب مناظرها الطبيعية الخلابة التي تجذب السياح.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 55,
        "type": "multiple choice",
        "prompt": "ساعد جريان العديد من الأنهار في قارة إفريقيا على تكوين السهول:",
        "options": ["الساحلية", "الفيضية", "الصحراوية", "البركانية"],
        "answer": "الفيضية"
    },
    {
        "id": 56,
        "type": "true/false",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال البحر الأحمر من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 57,
        "type": "multiple choice",
        "prompt": "السهول الساحلية الغنية بالثروات المعدنية ومصادر الطاقة في شرق إفريقيا هي سهول:",
        "options": ["البحر المتوسط", "المحيط الأطلنطي", "البحر الأحمر", "المحيط الهندي"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 58,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية في دولة تنزانيا المطلة على المحيط الهندي بضيقها الشديد.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 59,
        "type": "multiple choice",
        "prompt": "ينحصر الشريط الساحلي الضيق في كينيا بين الساحل وهضبة:",
        "options": ["الحبشة", "البحيرات الاستوائية", "شمال إفريقيا", "الهضبة الجنوبية"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 60,
        "type": "true/false",
        "prompt": "تعد جزيرة مدغشقر أكبر جزر القارة الإفريقية وتقع في المحيط الأطلنطي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 61,
        "type": "multiple choice",
        "prompt": "المصطلح الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو:",
        "options": ["حوض نهر النيل", "الدلتا الفيضية", "المنبع الدائم", "المجرى الدولي"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 62,
        "type": "true/false",
        "prompt": "يمتد مجرى نهر النيل وروافده داخل أراضي إحدى عشرة دولة إفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 63,
        "type": "multiple choice",
        "prompt": "أي من الدول التالية تعد من دول حوض نهر النيل وتوجد في شرق القارة؟",
        "options": ["تونس", "إثيوبيا", "الجزائر", "المغرب"],
        "answer": "إثيوبيا"
    },
    {
        "id": 64,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل نحو 10% من مساحة قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 65,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي اقترحته مصر عام 1983م للتشاور والتنسيق ودعم التعاون بين دول حوض النيل:",
        "options": ["الاتحاد الإفريقي", "منظمة الوحدة الإفريقية", "تجمع الأندوجو", "مؤتمر سيا",],
        "answer": "تجمع الأندوجو"
    },
    {
        "id": 66,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) باللغة السواحلية مفهوم 'التعاون الاقتصادي'.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 67,
        "type": "multiple choice",
        "prompt": "النهر الذي يمتد مجراه وروافده داخل أكثر من دولة يُعرف في الجغرافيا بـ:",
        "options": ["النهر المحلي", "النهر الإقليمي", "النهر الدولي", "النهر الساحلي"],
        "answer": "النهر الدولي"
    },
    {
        "id": 68,
        "type": "true/false",
        "prompt": "أشار الجغرافي جمال حمدان إلى أن نهر النيل أحادي المنبع.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 69,
        "type": "multiple choice",
        "prompt": "تعد هضبة البحيرات الاستوائية بالنسبة لنهر النيل هي المنبع:",
        "options": ["الموسمي", "الدائم", "المتطرق", "الفرعي"],
        "answer": "الدائم"
    },
    {
        "id": 70,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الاستوائية بسقوط الأمطار عليها طوال العام بسبب موقعها الفلكي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 71,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة بالنسبة لنهر النيل هي المنبع:",
        "options": ["الدائم", "الموسمي", "الرئيسي طوال العام", "الإنكساري"],
        "answer": "الموسمي"
    },
    {
        "id": 72,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة بسقوط الأمطار الشتوية الغزيرة على روافد نهر النيل.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 73,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الاستوائية إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر و:",
        "options": ["الإنحدار الشديد", "المستنقعات", "الطفوح البركانية", "قلة الأمطار المحيطة"],
        "answer": "المستنقعات"
    },
    {
        "id": 74,
        "type": "true/false",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 75,
        "type": "multiple choice",
        "prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها من جهة الغرب وهو نهر:",
        "options": ["السباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
        "answer": "كاجيرا"
    },
    {
        "id": 76,
        "type": "true/false",
        "prompt": "يلتقي نهر السوباط ببحر الجبل ويمده بمياهه فيسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 77,
        "type": "multiple choice",
        "prompt": "من الروافد التي تمد النيل بمياهه وتساعده على الجريان تجاه الشمال حتى المصب نهر عطبرة ونهر:",
        "options": ["الكونغو", "النيجر", "النيل الأزرق", "السنغال"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 78,
        "type": "true/false",
        "prompt": "قامت مصر بحفر عشرات الآبار في دولة أوغندا لتنمية الموارد المائية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 79,
        "type": "multiple choice",
        "prompt": "من الجهود المائية لمصر في دولة السودان إنشاء خزان سنار على:",
        "options": ["النيل الأبيض", "نهر عطبرة", "النيل الأزرق", "نهر السباط"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 80,
        "type": "true/false",
        "prompt": "ساهمت مصر في دفع تكاليف إنشاء خزان جبل الأولياء لتوليد الطاقة الكهربائية بالسودان.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 81,
        "type": "multiple choice",
        "prompt": "السد الذي قامت مصر بالمساهمة في إنشائه بدولة أوغندا هو سد:",
        "options": ["أوين", "سنار", "جبل الأولياء", "العالي"],
        "answer": "أوين"
    },
    {
        "id": 82,
        "type": "true/false",
        "prompt": "قامت مصر بتطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات الضارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 83,
        "type": "multiple choice",
        "prompt": "من جهود مصر لدعم التنمية المستدامة المائية إنشاء مركز للبحوث المائية في دولة:",
        "options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
        "answer": "تنزانيا"
    },
    {
        "id": 84,
        "type": "true/false",
        "prompt": "تعد اتفاقية قانون تنظيم استخدام المجاري المائية في الأغراض غير الملاحية من الاتفاقيات الإقليمية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 85,
        "type": "multiple choice",
        "prompt": "الاتفاقية الإقليمية التي نصت على التزام دول حوض النيل بعدم القيام بأي مشروعات بغير اتفاق مسبق مع مصر هي اتفاقية عام:",
        "options": ["1929م", "1983م", "2015م", "2026م"],
        "answer": "1929م"
    },
    {
        "id": 86,
        "type": "true/false",
        "prompt": "اتفقت مصر وإثيوبيا والسودان عام 2015م على مبادئ التعاون والتنمية وعدم التسبب في ضرر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 87,
        "type": "multiple choice",
        "prompt": "من العوامل الطبيعية التي وهبها الله لقارة إفريقيا وساعدت على قيام الحضارات القديمة بها:",
        "options": ["سكان القارة", "استثمار الثروات", "الموقع المتميز والمياه العذبة", "تأسيس الأسرات الحاكمة"],
        "answer": "الموقع المتميز والمياه العذبة"
    },
    {
        "id": 88,
        "type": "true/false",
        "prompt": "أقام المصريون القدماء حضارتهم العريقة بعيداً عن ضفاف نهر النيل في المناطق الجبلية الحبيسة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 89,
        "type": "multiple choice",
        "prompt": "حرص المصريون القدماء على توطيد العلاقات التجارية مع الحضارات المجاورة لهم مثل حضارة كوش وبلاد:",
        "options": ["قرطاج", "أكسوم", "بونت", "أوروبا"],
        "answer": "بونت"
    },
    {
        "id": 90,
        "type": "true/false",
        "prompt": "أثرت الحضارة المصرية القديمة على بعض الحضارات الإفريقية في المجالات المختلفة وتركت تراثاً عظيماً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 91,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في قارة إفريقيا بالكامل هي قمة جبل:",
        "options": ["توبقال", "شايب البنات", "كينيا", "كلمنجارو"],
        "answer": "كلمنجارو"
    },
    {
        "id": 92,
"type": "true/false",
"prompt": "تتميز جبال البحر الأحمر بأنها جبال التوائية نشأت نتيجة حركات باطنية التوائية أصابت الصخور.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 93,
"type": "multiple choice",
"prompt": "تمتد جبال البحر الأحمر على طول ساحل البحر الأحمر في مصر وبلدين آخرين هما:",
"options": ["تونس وليبيا", "السودان وإريتريا", "إثيوبيا وكينيا", "الصومال وجيبوتي"],
"answer": "السودان وإريتريا"
},
{
"id": 94,
"type": "true/false",
"prompt": "تتكون جبال كينيا وكلمنجارو نتيجة الثورانات البركانية في وسط القارة الإفريقية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 95,
"type": "multiple choice",
"prompt": "الجبال التي توجد في أقصى جنوب القارة الإفريقية وتعد من الجبال الالتوائية هي جبال:",
"options": ["أطلس", "البحر الأحمر", "دراكنزبرج", "الكاب"],
"answer": "الكاب"
},
{
"id": 96,
"type": "true/false",
"prompt": "تعد السهول الساحلية المطلة على البحر المتوسط في شمال مصر ضيقة بسبب اقتراب المرتفعات.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 97,
"type": "multiple choice",
"prompt": "تتميز السهول الساحلية لبلاد المغرب العربي بالضيق نتيجة اقتراب جبال:",
"options": ["البحر الأحمر", "الكاب", "أطلس", "دراكنزبرج"],
"answer": "أطلس"
},
{
"id": 98,
"type": "true/false",
"prompt": "تعد سهول المحيط الأطلنطي في غرب القارة سهولاً ضيقة وغير صالحة للحقول الزراعية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 99,
"type": "multiple choice",
"prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية ممر مائي مهم هو مضيق:",
"options": ["باب المندب", "جبل طارق", "موزمبيق", "هرمز"],
"answer": "موزمبيق"
},
{
"id": 100,
"type": "true/false",
"prompt": "تتسم هضبة البحيرات الاستوائية بأنها تنحدر تدريجياً من الشمال إلى الجنوب.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 101,
        "type": "multiple choice",
        "prompt": "يمر مدار السرطان في قارة إفريقيا بجهة:",
        "options": ["الشمال", "الجنوب", "الشرق", "الوسط"],
        "answer": "الشمال"
    },
    {
        "id": 102,
        "type": "true/false",
        "prompt": " تقع قارة إفريقيا وسط قارات العالم وتطل على مسطحات مائية مهمة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 103,
        "type": "multiple choice",
        "prompt": " أن المسطح المائي الذي يفصل قارة آسيا عن قارة إفريقيا هو:",
        "options": ["البحر المتوسط", "البحر الأحمر", "المحيط الأطلنطي", "خليج غينيا"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 104,
        "type": "true/false",
        "prompt": " مدار الجدي يمر في شمال قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 105,
        "type": "multiple choice",
        "prompt": "تمر جميع دوائر العرض التالية بقارة إفريقيا ما عدا:",
        "options": ["مدار السرطان", "مدار الجدي", "دائرة الاستواء", "الدائرة القطبية الشمالية"],
        "answer": "الدائرة القطبية الشمالية"
    },
    {
        "id": 106,
        "type": "true/false",
        "prompt": " تعد دولة الجزائر أكبر دول القارة الإفريقية من حيث المساحة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 107,
        "type": "multiple choice",
        "prompt": "من الدول الساحلية الإفريقية التي تطل على مسطحات مائية ومذكورة كنموذج في خريطة المنهج السياسية:",
        "options": ["تشاد", "النيجر", "الصومال", "مالي"],
        "answer": "الصومال"
    },
    {
        "id": 108,
        "type": "true/false",
        "prompt": "تعد دولة المغرب من أمثلة الدول الحبيسة في قارة إفريقيا وفقاً للتصنيف السياسي في الدرس.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 109,
        "type": "multiple choice",
        "prompt": "خط جرينتش يمر في النصف الكروي:",
        "options": ["الشرقي من قارة إفريقيا", "الغربي من قارة إفريقيا", "الجنوبي من قارة إفريقيا", "الشمالي الشرقي من قارة إفريقيا"],
        "answer": "الغربي من قارة إفريقيا"
    },
    {
        "id": 110,
        "type": "true/false",
        "prompt": "أدت الكشوف الجغرافية والاستعمار الأوروبي لقارة إفريقيا إلى جعلها تعاني من الفقر رغم ما تملكه من ثروات طبيعية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 111,
        "type": "multiple choice",
        "prompt": "تقع مصر في الركن ........ من قارة إفريقيا.",
        "options": ["الشمالي الغربي", "الشمالي الشرقي", "الجنوبي الشرقي", "الجنوبي الغربي"],
        "answer": "الشمالي الشرقي"
    },
    {
        "id": 112,
        "type": "true/false",
        "prompt": " تعددت الممالك على السواحل الشرقية للقارة وامتدت حتى هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 113,
        "type": "multiple choice",
        "prompt": "أي من المجموعات الاستكشافية التالية كان لها الدور الأبرز في اكتشاف منابع نهر النيل في نهاية القرن 18 وخلال القرن 19م؟",
        "options": ["الفينيقيون", "الأوروبيون", "الهكسوس", "الفرس"],
        "answer": "الأوروبيون"
    },
    {
        "id": 114,
        "type": "true/false",
        "prompt": "تكونت بعض الممالك الإسلامية التاريخية أيضاً في غرب قارة إفريقيا وفقاً لما ورد في المنهج.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 115,
        "type": "multiple choice",
        "prompt": " إذا قمت برحلة بحرية من الإسكندرية بمصر إلى موريتانيا، فإنك ستعبر مضيق:",
        "options": ["موزمبيق", "باب المندب", "جبل طارق", "هرمز"],
        "answer": "مضيق جبل طارق"
    },
    {
        "id": 116,
        "type": "true/false",
        "prompt": "تعد دولة الصومال الدولة العربية الوحيدة بالقارة الإفريقية التي يمر بها دائرة الاستواء وفقاً لتدريبات الأضواء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 117,
        "type": "multiple choice",
        "prompt": " أي من الدول التالية يتقاطع بها مدار السرطان مع خط جرينتش؟",
        "options": ["ليبيا", "مصر", "الجزائر", "تونس"],
        "answer": "الجزائر"
    },
    {
        "id": 118,
        "type": "true/false",
        "prompt": " تم رسم خريطة للنيل حتى جنوب السودان في عهد محمد علي باشا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 119,
        "type": "multiple choice",
        "prompt": "تتوزع القوافل العربية التاريخية الاستكشافية في إفريقيا حيث وصلت إلى السودان وجزر القمر وبلاد:",
        "options": ["المغرب العربي", "الحبشة", "بونت القديمة", "جنوب إفريقيا"],
        "answer": "الحبشة"
    },
    {
        "id": 120,
        "type": "true/false",
        "prompt": "تضم قارة إفريقيا دولاً عربية يبلغ عددها إجمالاً 10 دول مختلفة المساحة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 121,
        "type": "multiple choice",
        "prompt": "تم اكتشاف النيل الأبيض في العصر الحديث خلال عهد:",
        "options": ["الخديو إسماعيل", "محمد علي باشا", "الملك نخاو الثاني", "الأمير هنري الملاح"],
        "answer": "محمد علي باشا"
    },
    {
        "id": 122,
        "type": "true/false",
        "prompt": "يعد جبل كينيا من الجبال الانكسارية التي نشأت في وسط القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 123,
        "type": "multiple choice",
        "prompt": "يتطابق سبب نشأة التكوين الجغرافي لجبل كلمنجارو مع سبب نشأة جبل:",
        "options": ["أطلس", "كينيا", "الكاب", "شايب البنات"],
        "answer": "كينيا"
    },
    {
        "id": 124,
        "type": "true/false",
        "prompt": "جبال دراكنزبرج وجبال الكاب تقعان معاً في الجزء الجنوبي من القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 125,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية المطلة على البحر المتوسط في شمال مصر بوجود محاصيل زراعية ونباتات تعتمد على الأمطار:",
        "options": ["الشتوية", "الصيفية طوال العام", "الموسمية الغزيرة", "المدارية المتطرفة"],
        "answer": "الشتوية"
    },
    {
        "id": 126,
        "type": "true/false",
        "prompt": " يقع جبل شايب البنات (أعلى قمة في جبال البحر الأحمر) في جمهورية مصر العربية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 127,
        "type": "multiple choice",
        "prompt": " ما هو العامل المشترك التكويني بين هضبة الحبشة والهضبة الجنوبية؟",
        "options": ["وجود بحيرات عذبة", "وجود انكسارات طولية", "تعرضهما لثورانات بركانية واسعة", "وجود صحارى رملية"],
        "answer": "وجود انكسارات طولية"
    },
    {
        "id": 128,
        "type": "true/false",
        "prompt": "يقطع مدار الجدي في قارة إفريقيا تضاريس الهضبة الجنوبية وفقاً لأسئلة مستوى القمة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 129,
        "type": "multiple choice",
        "prompt": "ما هي التضاريس الإفريقية التي يقطعها خط الاستواء مباشرة بناءً على خريطة وتدريبات المنهج؟",
        "options": ["هضبة البحيرات الاستوائية وجبل كينيا", "جبال البحر الأحمر وهضبة الحبشة", "جبال دراكنزبرج والهضبة الجنوبية", "هضبة الشطوط وجبال أطلس"],
        "answer": "هضبة البحيرات الاستوائية وجبل كينيا"
    },
    {
        "id": 130,
        "type": "true/false",
        "prompt": "العامل المشترك بين سهول البحر الأحمر وسهول المحيط الهندي في كينيا هو 'اقتراب المرتفعات من الساحل الضيق'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 131,
        "type": "multiple choice",
        "prompt": "تم إنشاء خزان سنار لمصلحة التنمية المائية على مجرى نهر:",
        "options": ["النيل الأبيض", "نهر عطبرة", "النيل الأزرق", "نهر السباط"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 132,
        "type": "true/false",
        "prompt": "تتميز المنابع الدائمة الاستوائية لنهر النيل بسقوط الأمطار الصيفية فقط.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 133,
        "type": "multiple choice",
        "prompt": " تقع بحيرة تانا التي تعد أحد المصادر المائية المهمة في نطاق هضبة:",
        "options": ["شمال إفريقيا", "البحيرات الاستوائية", "الحبشة (الإثيوبية)", "الهضبة الجنوبية"],
        "answer": "الحبشة (الإثيوبية)"
    },
    {
        "id": 134,
        "type": "true/false",
        "prompt": "تعد بحيرة فيكتوريا المصدر الأساسي العذب الذي ينبع منه نهر كاجيرا من جهة الغرب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 135,
        "type": "multiple choice",
        "prompt": "ما هو الرافد المائي لنهر النيل الذي يلتقي بـ (بحر الجبل) ويمده بالمياه فيسترد النيل قوته؟",
        "options": ["نهر عطبرة", "النيل الأزرق", "نهر السوباط", "بحر الغزال"],
        "answer": "نهر السوباط"
    },
    {
        "id": 136,
        "type": "true/false",
        "prompt": "يعد كل من بحر الغزال وبحر العرب وبحر الجبل جزءاً من الروافد المائية داخل حوض نهر النيل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 137,
        "type": "multiple choice",
        "prompt": "الاتفاقية المائية الإقليمية التي تمت بين ثلاث دول (مصر وإثيوبيا والسودان) لتنظيم المبادئ المائية هي اتفاقية عام:",
        "options": ["1929م", "1983م", "2015م", "2026م"],
        "answer": "2015م"
    },
    {
        "id": 138,
        "type": "true/false",
"prompt": "تعد دولة إريتريا من دول حوض نهر النيل الإحدى عشرة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 139,
"type": "multiple choice",
"prompt": "أي من هضاب قارة إفريقيا تتميز بأنها تعلوها القمم الجبلية البركانية وتكثر بها البحيرات العذبة؟",
"options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "هضبة البحيرات الاستوائية"
},
{
"id": 140,
"type": "true/false",
"prompt": "تعد جبال دراكنزبرج من الجبال البركانية التي نشأت في أقصى جنوب قارة إفريقيا.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 141,
"type": "multiple choice",
"prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر بأنها ضيقة وغنية بمصادر الطاقة و:",
"options": ["التربة الطمية الخصبة", "الثروات المعدنية", "المحاصيل الشتوية الكثيفة", "الغابات الاستوائية الكبرى"],
"answer": "الثروات المعدنية"
},
{
"id": 142,
"type": "true/false",
"prompt": "تعد دولة رواندا ودولة بوروندي من بين الدول الإحدى عشرة المكونة لحوض نهر النيل.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 143,
"type": "multiple choice",
"prompt": "أرسل محمد علي باشا رحلات استكشافية تاريخية عام 1839م انتهت باكتشاف منابع:",
"options": ["النيل الأبيض", "النيل الأزرق", "نهر عطبرة", "بحر الغزال"],
"answer": "النيل الأبيض"
},
{
"id": 144,
"type": "true/false",
"prompt": "بدأت بعثة الدوران حول إفريقيا في عهد الملك نخاو الثاني من البحر المتوسط وعادت عبر جبل طارق.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 145,
"type": "multiple choice",
"prompt": "الرحالة العربي الذي زار إفريقيا وكتب عنها وكان من أوائل الرحالة هو:",
"options": ["ابن بطوطة", "المسعودي", "ابن خلدون", "الإدريسي"],
"answer": "المسعودي"
},
{
"id": 146,
"type": "true/false",
"prompt": "استفاد البرتغاليون في رحلاتهم الاستكشافية بالقرن الخامس عشر الميلادي مما كتبه العرب عن إفريقيا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 147,
"type": "multiple choice",
"prompt": "تضم قارة إفريقيا دولاً عربية يقع جزء منها بأكمله جنوب مدار السرطان، ومثالها دولة:",
"options": ["مصر", "تونس", "السودان", "ليبيا"],
"answer": "السودان"
},
{
"id": 148,
"type": "true/false",
"prompt": "تعد دولة زامبيا من أمثلة الدول الساحلية في قارة إفريقيا.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 149,
"type": "multiple choice",
"prompt": "أي من الدول العربية الإفريقية التالية تقع بأكملها في النصف الغربي من الكرة الأرضية؟",
"options": ["مصر وليبيا", "تونس والجزائر", "المغرب وموريتانيا", "السودان وجيبوتي"],
"answer": "المغرب وموريتانيا"
},
{
"id": 150,
"type": "true/false",
"prompt": "تنحدر هضبة البحيرات الاستوائية في قارة إفريقيا بشكل عام من الجنوب إلى الشمال.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 151,
        "type": "multiple choice",
        "prompt": "الدولتان العربيتان الإفريقيتان اللتان تطلان على المحيط الأطلنطي هما:",
        "options": ["مصر والسودان", "تونس والجزائر", "المغرب وموريتانيا", "ليبيا والصومال"],
        "answer": "المغرب وموريتانيا"
    },
    {
        "id": 152,
        "type": "true/false",
        "prompt": "يمر خط الطول الرئيسي جرينتش في النصف الشرقي من القارة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 153,
        "type": "multiple choice",
        "prompt": " النهر الذي يصب في بحيرة فيكتوريا من جهة الغرب هو نهر:",
        "options": ["السوباط", "كاجيرا", "عطبرة", "النيل الأزرق"],
        "answer": "كاجيرا"
    },
    {
        "id": 154,
        "type": "true/false",
        "prompt": "تمتد دولة مصر في الركن الشمالي الشرقي من قارة إفريقيا وهي واحدة من أكبر وأهم دول القارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 155,
        "type": "multiple choice",
        "prompt": "أحد الجغرافيين العرب الذي اخترق الصحراء الكبرى من الشمال إلى الجنوب حتى وصل إلى مالي هو:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "الإدريسي"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 156,
        "type": "true/false",
        "prompt": "امتد التأثير الحضاري المصري القديم والحديث إلى غرب إفريقيا ومنابع النيل الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 157,
        "type": "multiple choice",
        "prompt": "من الرحالة المصريين القدامى في عصر الأسرتين الخامسة والسادسة الذي قام بأربع رحلات نحو الجنوب:",
        "options": ["الملك نخاو الثاني", "الرحالة حرخوف", "محمد علي باشا", "الخديو إسماعيل"],
        "answer": "الرحالة حرخوف"
    },
    {
        "id": 158,
        "type": "true/false",
        "prompt": "بدأت رحلة الدوران حول إفريقيا في عهد الملك نخاو الثاني من البحر الأحمر وعادت عبر مضيق جبل طارق.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 159,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات لاكتشاف منابع النيل عام 1839م وانتهت باكتشاف:",
        "options": ["النيل الأبيض", "النيل الأزرق", "نهر عطبرة", "بحيرة تانا"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 160,
        "type": "true/false",
        "prompt": "وصل حكم الخديو إسماعيل حفيد محمد علي إلى جنوب دائرة الاستواء أثناء استكمال اكتشاف منابع النيل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 161,
        "type": "multiple choice",
        "prompt": "تتميز هضبة الحبشة بخصوبة تربتها بسبب الطفوح البركانية، وهي تقع في جهة:",
        "options": ["شمال القارة", "جنوب القارة", "شرق القارة", "غرب القارة"],
        "answer": "شرق القارة"
    },
    {
        "id": 162,
        "type": "true/false",
        "prompt": "تعد هضبة البحيرات الاستوائية أعلى هضاب القارة الإفريقية على الإطلاق.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 163,
        "type": "multiple choice",
        "prompt": "أي من الهضاب التالية يوجد في جزئها الشرقي الأخدود الإفريقي العظيم؟",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 164,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 165,
        "type": "multiple choice",
        "prompt": "من أجزاء الأخدود الإفريقي العظيم البحر الأحمر وخليج عدن وخليج:",
        "options": ["غينيا", "العقبة", "عمان", "العرب"],
        "answer": "العقبة"
    },
    {
        "id": 166,
        "type": "true/false",
        "prompt": "تقع هضبة الشطوط في دولة الجزائر بين سلسلتين متوازيتين من جبال أطلس.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 167,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية داخل مصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "موسى"],
        "answer": "شايب البنات"
    },
    {
        "id": 168,
        "type": "true/false",
        "prompt": "تتميز جبال كينيا وكلمنجارو في وسط إفريقيا بأنها جبال التوائية نشأت نتيجة حركات باطنية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 169,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب:",
        "options": ["اقترابه من المحيط الهندي", "شدة ارتفاعه وعلو قمته", "كثرة الأمطار الصيفية", "تأثير الأخدود الإفريقي"],
        "answer": "شدة ارتفاعه وعلو قمته"
    },
    {
        "id": 170,
        "type": "true/false",
        "prompt": "تساهم المناطق الجبلية في قارة إفريقيا في دعم نشاط التعدين والصناعة لأنها غنية بالثروات المعدنية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 171,
        "type": "multiple choice",
        "prompt": "السهول التي كونتها الأنهار عن طريق ترسيب المواد العالقة بمياهها تُعرف بالسهول:",
        "options": ["الساحلية", "الفيضية", "الصحراوية", "البركانية"],
        "answer": "الفيضية"
    },
    {
        "id": 172,
        "type": "true/false",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال أطلس من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 173,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها في دولة تنزانيا بينما تضيق في دولة:",
        "options": ["مصر", "كينيا", "السودان", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 174,
        "type": "true/false",
        "prompt": "تعد سهول المحيط الأطلنطي في غرب القارة الإفريقية سهولاً ضيقة غير صالحة للزراعة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 175,
        "type": "multiple choice",
        "prompt": "أكبر جزر القارة الإفريقية مساحة وتقع في مياه المحيط الهندي هي جزيرة:",
        "options": ["جزر القمر", "مدغشقر", "سيشل", "موريشيوس"],
        "answer": "مدغشقر"
    },
    {
        "id": 176,
        "type": "true/false",
        "prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية مضيق موزمبيق.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 177,
        "type": "multiple choice",
        "prompt": "المساحة التي يجري بها نهر النيل وروافده تُعرف جغرافياً باسم:",
        "options": ["حوض نهر النيل", "السهل الساحلي للنيل", "المنبع الاستوائي", "المجرى الملاحي"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 178,
        "type": "true/false",
        "prompt": "يمتد مجرى نهر النيل وروافده داخل أراضي 11 دولة إفريقية ويُصنف كأحد الأنهار الدولية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 179,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي أنشئ عام 1983م بهدف التشاور والتنسيق ودعم التعاون بين دول حوض النيل:",
        "options": ["الاتحاد الإفريقي", "تجمع الأندوجو", "تجمع الكوميسا", "منظمة سيا"],
        "answer": "تجمع الأندوجو"
    },
    {
        "id": 180,
        "type": "true/false",
        "prompt": "تعني كلمة 'الأندوجو' باللغة السواحلية مفهوم 'الإخاء'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 181,
        "type": "multiple choice",
        "prompt": "تقع منابع نهر النيل الدائمة (الاستوائية) في نطاق تضاريس:",
        "options": ["هضبة الحبشة", "هضبة شمال إفريقيا", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "هضبة البحيرات الاستوائية"
    },
    {
        "id": 182,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية بسقوط الأمطار عليها طوال العام بسبب موقعها الفلكي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 183,
        "type": "multiple choice",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعد مصدراً للمنابع:",
        "options": ["الموسمية", "الدائمة", "المؤقتة", "البركانية"],
        "answer": "الدائمة"
    },
    {
        "id": 184,
        "type": "true/false",
        "prompt": "يلتقي نهر السوباط ببحر الجبل ويمده بمياه عذبة فيسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 185,
        "type": "multiple choice",
        "prompt": "من الروافد الموسمية التي تمد النيل بمياهه وتساعده على الجريان نحو الشمال نهر عطبرة ونهر:",
        "options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 186,
        "type": "true/false",
        "prompt": "قامت مصر بحفر عشرات الآبار في دولة كينيا لتنمية واستثمار مواردها المائية بشكل مستدام.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 187,
        "type": "multiple choice",
        "prompt": "من جهود مصر المائية الموثقة في المنهج إنشاء سد أوين في دولة:",
        "options": ["السودان", "كينيا", "أوغندا", "تنزانيا"],
        "answer": "أوغندا"
    },
    {
        "id": 188,
        "type": "true/false",
        "prompt": "ساهمت مصر في إنشاء خزان سنار على النيل الأبيض بدولة السودان.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 189,
        "type": "multiple choice",
        "prompt": "الاتفاقية الإقليمية الموقعة عام 1929م نصت على عدم قيام دول حوض النيل بأي مشروعات دون اتفاق مسبق مع:",
        "options": ["إثيوبيا", "السودان", "مصر", "أوغندا"],
        "answer": "مصر"
    },
    {
        "id": 190,
        "type": "true/false",
        "prompt": "اتفقت مصر وإثيوبيا والسودان في اتفاقية عام 2015م على مبادئ التعاون والتنمية وعدم التسبب في ضرر.",
        "options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 191,
"type": "multiple choice",
"prompt": "حرص المصريون القدماء على توطيد العلاقات التجارية مع الحضارات الإفريقية المجاورة لهم مثل حضارة كوش وبلاد:",
"options": ["قرطاج", "أكسوم", "بونت", "أوروبا"],
"answer": "بونت"
},
{
"id": 192,
"type": "true/false",
"prompt": "نشأت حضارة قرطاج القديمة المذكورة في المنهج على أرض دولة تونس الحالية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 193,
"type": "multiple choice",
"prompt": "نشأت حضارة أكسوم القديمة في قارة إفريقيا على أراضي دولتي:",
"options": ["مصر والسودان", "تونس والجزائر", "إريتريا وإثيوبيا", "ليبيا وتشاد"],
"answer": "إريتريا وإثيوبيا"
},
{
"id": 194,
"type": "true/false",
"prompt": "تعد دولة الجزائر أكبر دول القارة الإفريقية من حيث المساحة .",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 195,
"type": "multiple choice",
"prompt": "تضم قارة إفريقيا كم دولة عربية وفقاً لما تم حصره وتفصيله في المنهج؟",
"options": ["5 دول", "8 دول", "10 دول", "12 دولة"],
"answer": "10 دول"
},
{
"id": 196,
"type": "true/false",
"prompt": "الدول الحبيسة هي الدول التي تطل على مسطحات مائية واسعة مثل البحار والمحيطات.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 197,
"type": "multiple choice",
"prompt": "من أمثلة الدول الحبيسة (التي لا تطل على مسطحات مائية) دولة:",
"options": ["الصومال", "المغرب", "تشاد", "مصر"],
"answer": "تشاد"
},
{
"id": 198,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في القارة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 199,
"type": "multiple choice",
"prompt": "أحد الجغرافيين والرحالة العرب الذي يُعد من أوائل من زاروا إفريقيا وكتبوا عنها هو:",
"options": ["ابن خلدون", "المسعودي", "ابن سينا", "ابن الهيثم"],
"answer": "المسعودي"
},
{
"id": 200,
"type": "true/false",
"prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا في القرن الخامس عشر الميلادي في عهد الأمير هنري الملاح واستفادوا مما كتبه العرب.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 201,
        "type": "multiple choice",
        "prompt": "تقع دولة المغرب بالنسبة للقارة الإفريقية في الركن:",
        "options": ["الشمالي الشرقي", "الشمالي الغربي", "الجنوبي الشرقي", "الجنوبي الغربي"],
        "answer": "الشمالي الغربي"
    },
    {
        "id": 202,
        "type": "true/false",
        "prompt": " يحد قارة إفريقيا من جهة الغرب البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 203,
        "type": "multiple choice",
        "prompt": " اليابس الإفريقي يقترب من اليابس الآسيوي عند مضيق:",
        "options": ["جبل طارق", "هرمز", "باب المندب", "موزمبيق"],
        "answer": "باب المندب"
    },
    {
        "id": 204,
        "type": "true/false",
        "prompt": " تقع قارة إفريقيا إلى الجنوب من البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 205,
        "type": "multiple choice",
        "prompt": " حضارة أكسوم القديمة ظهرت في إريتريا و:",
        "options": ["السودان", "إثيوبيا", "تونس", "مصر"],
        "answer": "إثيوبيا"
    },
    {
        "id": 106,
        "type": "true/false",
        "prompt": " أكبر قارات العالم من حيث المساحة هي قارة أوروبا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 207,
        "type": "multiple choice",
        "prompt": " قارة إفريقيا تقع إلى الغرب من المحيط:",
        "options": ["الأطلنطي", "الهندي", "القطبي", "الهادي"],
        "answer": "الأطلنطي"
    },
    {
        "id": 208,
        "type": "true/false",
        "prompt": " من أمثلة الإنتاج الثقافي لقيام الحضارات القصور والمباني.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 209,
        "type": "multiple choice",
        "prompt": " تشرق الشمس أولاً على المواقع التي تقع في جهة إفريقيا:",
        "options": ["الشرقية", "الغربية", "الشمالية", "الجنوبية"],
        "answer": "الشرقية"
    },
    {
        "id": 210,
        "type": "true/false",
        "prompt": " الخديو إسماعيل قام برسم خريطة للنيل حتى جنوب السودان.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 211,
        "type": "multiple choice",
        "prompt": " استمرت رحلة الدوران حول إفريقيا في عهد الملك نخاو الثاني حوالي:",
        "options": ["سنة واحدة", "سنتين", "ثلاث سنوات", "أربع سنوات"],
        "answer": "ثلاث سنوات"
    },
    {
        "id": 212,
        "type": "true/false",
        "prompt": "امتد التأثير الحضاري المصري في إفريقيا في العصر الحديث حتى وصل إلى منابع النيل الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 213,
        "type": "multiple choice",
        "prompt": "امتدت الممالك الإسلامية التاريخية في السواحل الشرقية لإفريقيا حتى وصلت إلى هضبة:",
        "options": ["شمال إفريقيا", "البحيرات الاستوائية", "الشطوط", "الحبشة"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 214,
        "type": "true/false",
        "prompt": "استفاد البرتغاليون من كتابات الفينيقيين في محاولاتهم لاكتشاف قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 215,
        "type": "multiple choice",
        "prompt": " الرحالة العربي الذي استطاع اختراق الصحراء الكبرى حتى وصل إلى دولة مالي هو:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "ابن سينا"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 216,
        "type": "true/false",
        "prompt": " البعثات الاستكشافية التي انتهت باكتشاف النيل الأبيض كانت في عهد محمد علي باشا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 218,
        "type": "true/false",
        "prompt": "ربط طريق رأس الرجاء الصالح الاستكشافي الذي أسسه البرتغاليون بين ثلاث قارات.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 220,
        "type": "true/false",
        "prompt": "يقع أكبر أجزاء اليابس الإفريقي في نصف الكرة الأرضية الشرقي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 221,
        "type": "multiple choice",
        "prompt": "من الدول الساحلية العربية الإفريقية التي تقع بالكامل جنوب مدار السرطان :",
        "options": ["مصر", "ليبيا", "السودان", "تونس"],
        "answer": "السودان"
    },
    {
        "id": 222,
        "type": "true/false",
        "prompt": " تعد دولتا المغرب وموريتانيا هما الدولتان العربيتان اللتان تقعان بأكملهما في النصف الغربي من الكرة الأرضية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 223,
        "type": "multiple choice",
        "prompt": "أي من العبارات التالية تعد من إنجازات الأوروبيين في اكتشاف القارة الإفريقية ؟",
        "options": ["إنشاء ممالك على السواحل الشرقية", "رسم خريطة للنيل حتى جنوب السودان", "إقامة موانئ ومراكز تجارية على طول طريق رأس الرجاء الصالح", "اختراق الصحراء الكبرى من الشمال للجنوب"],
        "answer": "إقامة موانئ ومراكز تجارية على طول طريق رأس الرجاء الصالح"
    },
    {
        "id": 224,
        "type": "true/false",
        "prompt": " يمتد الأخدود الإفريقي العظيم في غرب قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 225,
        "type": "multiple choice",
        "prompt": " بحيرة فيكتوريا هي إحدى البحيرات العذبة الموجودة بهضبة:",
        "options": ["الحبشة", "البحيرات الاستوائية", "شمال إفريقيا", "الهضبة الجنوبية"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 226,
        "type": "true/false",
        "prompt": " يعد البحر المتوسط وخليجا عدن والعقبة جزءاً من الأخدود الإفريقي العظيم.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 227,
        "type": "multiple choice",
        "prompt": " جبال أطلس وجبال الكاب تقعان في قارة إفريقيا وتعتبران جبالاً:",
        "options": ["انكسارية", "التوائية", "بركانية", "تصدعية"],
        "answer": "التوائية"
    },
    {
        "id": 228,
        "type": "true/false",
        "prompt": "تعد جبال البحر الأحمر وجبال دراكنزبرج ناتجة عن نفس سبب النشأة التكوينية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 229,
        "type": "multiple choice",
        "prompt": " تمتد في جنوب قارة إفريقيا جبال:",
        "options": ["أطلس", "البحر الأحمر", "دراكنزبرج والكاب", "كينيا"],
        "answer": "دراكنزبرج والكاب"
    },
    {
        "id": 230,
        "type": "true/false",
        "prompt": " جبل شايب البنات يقع في قارة إفريقيا ناحية الغرب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 231,
        "type": "multiple choice",
        "prompt": "جبل كلمنجارو يعد أعلى قمة جبلية في سلاسل جبال:",
        "options": ["أطلس", "البحر الأحمر", "الكاب", "الجبال البركانية لإفريقيا"],
        "answer": "الجبال البركانية لإفريقيا"
    },
    {
        "id": 232,
        "type": "true/false",
        "prompt": " تقع سهول نهر النيجر إلى الجنوب من هضبة شمال إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 233,
        "type": "multiple choice",
        "prompt": " من الجزر التي تُعد دولة عربية إفريقية وتقع في شرق إفريقيا جزر:",
        "options": ["مدغشقر", "القمر", "سيشل", "زنجبار"],
        "answer": "القمر"
    },
    {
        "id": 234,
        "type": "true/false",
        "prompt": " الجبال البركانية هي الجبال التي تكونت نتيجة الثورانات البركانية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 235,
        "type": "multiple choice",
        "prompt": " الروافد التي تمد النيل بمياهه وتساعده على الجريان شمالاً تشمل نهر عطبرة و:",
        "options": ["نهر كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 236,
        "type": "true/false",
        "prompt": "تتميز هضبة البحيرات الاستوائية بخصوبة تربتها العالية جداً بسبب المقذوفات والطفوح البركانية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 237,
        "type": "multiple choice",
        "prompt": "الرافد الذي يصب مباشرة في مياه بحيرة فيكتوريا من جهة الغرب هو نهر:",
        "options": ["السباط", "كاجيرا", "النيل الأبيض", "بحر الجبل"],
        "answer": "كاجيرا"
    },
    {
        "id": 238,
        "type": "true/false",
"prompt": "يقع نهر السوباط ضمن مجموعة روافد المنابع الموسمية (الإثيوبية).",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 239,
"type": "multiple choice",
"prompt": " تسقط الأمطار طوال العام على مجرى نهر:",
"options": ["كاجيرا", "السوباط", "عطبرة", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 240,
"type": "true/false",
"prompt": " تأتي معظم مياه نهر النيل إلى مصر من المنابع الموسمية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 241,
"type": "multiple choice",
"prompt": " مصر ساهمت في دفع تكاليف وإنشاء خزان جبل الأولياء في دولة:",
"options": ["كينيا", "السودان", "أوغندا", "تنزانيا"],
"answer": "السودان"
},
{
"id": 242,
"type": "true/false",
"prompt": "ساعدت مصر في تطهير بحيرتي فيكتوريا وتانا من الحشائش والنباتات.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 243,
"type": "multiple choice",
"prompt": "وضعت منظمة ........ اتفاقية قانون تنظيم استخدام المجاري المائية في الأغراض غير الملاحية.",
"options": ["اليونسكو", "الأندوجو", "الأمم المتحدة", "الاتحاد الإفريقي"],
"answer": "الأمم المتحدة"
},
{
"id": 244,
"type": "true/false",
"prompt": " نصت اتفاقية عام 1929م على التزام دول حوض النيل بعدم القيام بأي مشروعات بغير اتفاق مسبق مع مصر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 245,
"type": "multiple choice",
"prompt": " حفرت مصر عشرات الآبار لتوفير المياه النقية في دولة حوض النيل:",
"options": ["السودان", "كينيا", "أوغندا", "تنزانيا"],
"answer": "كينيا"
},
{
"id": 246,
"type": "true/false",
"prompt": " اتفقت مصر وإثيوبيا والسودان في اتفاقية عام 2015م على مبدأ الاستخدام المنصف والمناسب لمياه نهر النيل.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 247,
"type": "multiple choice",
"prompt": "من العوامل البشرية المباشرة التي أدت لقيام الحضارات القديمة في إفريقيا واستثمار ثرواتها الطبيعية:",
"options": ["الموقع المتميز للقارة", "سكان القارة وكفاحهم", "وفرة المياه العذبة والمعادن", "تنوع النباتات الطبيعية"],
"answer": "سكان القارة وكفاحهم"
},
{
"id": 248,
"type": "true/false",
"prompt": "أقام المصريون القدماء حضارتهم العريقة على ضفاف النيل حيث استقروا وعرفوا حرفة الزراعة واستأنسوا الحيوانات.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 249,
"type": "multiple choice",
"prompt": "حرص المصريون القدماء عبر العصور على توطيد العلاقات التجارية مع الحضارات الإفريقية المجاورة مثل بلاد بونت وحضارة:",
"options": ["قرطاج", "أكسوم", "كوش", "أوروبا"],
"answer": "كوش"
},
{
"id": 250,
"type": "true/false",
"prompt": "أثرت الحضارة المصرية القديمة إيجابياً على بعض الحضارات الإفريقية في المجالات المختلفة وتركت تراثاً حضارياً عظيماً يدل على قيامها.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
 "id": 251,
        "type": "multiple choice",
        "prompt": " تقع جزيرة مدغشقر في المحيط الهندي في جهة إفريقيا:",
        "options": ["الشمالية", "الغربية", "الشرقية", "الشمالية الغربية"],
        "answer": "الشرقية"
    },
    {
        "id": 252,
        "type": "true/false",
        "prompt": "يختلف اتساع السهول الساحلية في قارة إفريقيا من منطقة لأخرى بسبب اقتراب أو ابتعاد المرتفعات عن الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 253,
        "type": "multiple choice",
        "prompt": "تضيق السهول الساحلية المطلة على البحر الأحمر في مصر والسودان وإريتريا بسبب اقتراب جبال:",
        "options": ["أطلس", "الكاب", "البحر الأحمر", "دراكنزبرج"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 254,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي بالضيق في دولة تنزانيا نتيجة اقتراب هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 255,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة:",
        "options": ["تنزانيا", "كينيا", "مصر", "إريتريا"],
        "answer": "كينيا"
    },
    {
        "id": 256,
        "type": "true/false",
        "prompt": "تعد السهول الساحلية المطلة على المحيط الأطلنطي في غرب القارة الإفريقية سهولاً واسعة غنية بحقولها الزراعية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 257,
        "type": "multiple choice",
        "prompt": "من الجزر الإفريقية التي تقع في المحيط الهندي وتتميز بأنها تقع شمال غرب جزيرة مدغشقر جزر:",
        "options": ["سيشل", "القمر", "موريشيوس", "زنجبار"],
        "answer": "القمر"
    },
    {
        "id": 258,
        "type": "true/false",
        "prompt": "تُصنف جزر القمر كدولة عربية إفريقية وتقع بالكامل في مياه المحيط الأطلنطي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 259,
        "type": "multiple choice",
        "prompt": "أكبر جزر القارة الإفريقية مساحة ويفصلها عن الساحل الشرقي للقارة مضيق موزمبيق هي جزيرة:",
        "options": ["جزر القمر", "سيشل", "مدغشقر", "كوبا"],
        "answer": "مدغشقر"
    },
    {
        "id": 260,
        "type": "true/false",
        "prompt": "تتسم هضبة البحيرات الاستوائية في وسط قارة إفريقيا بأنها تنحدر بشكل عام من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 261,
        "type": "multiple choice",
        "prompt": "تتميز هضبة البحيرات الاستوائية بوجود العديد من الظاهرات الطبيعية حيث تعلوها القمم الجبلية:",
        "options": ["الالتوائية", "البركانية", "الانكسارية", "التصدعية"],
        "answer": "البركانية"
    },
    {
        "id": 262,
        "type": "true/false",
        "prompt": "تكثر البحيرات العذبة في هضبة البحيرات الاستوائية ومن أهمها بحيرة فيكتوريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 263,
        "type": "multiple choice",
        "prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 264,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو عبارة عن مجموعة التواءات باطنية صخرية تمتد غرب قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 265,
        "type": "multiple choice",
        "prompt": "يتجه الامتداد الجغرافي للأخدود الإفريقي العظيم شرق قارة إفريقيا بشكل عام من:",
        "options": ["الشمال إلى الجنوب", "الشرق إلى الغرب", "الجنوب إلى الشمال", "الغرب إلى الشرق"],
        "answer": "الجنوب إلى الشمال"
    },
    {
        "id": 266,
        "type": "true/false",
        "prompt": "يُعد كل من البحر الأحمر وخليج عدن وخليج العقبة من الأجزاء التابعة للأخدود الإفريقي العظيم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 267,
        "type": "multiple choice",
        "prompt": "جبل عوينات المذكور كأحد مظاهر سطح هضبة شمال إفريقيا يقع على الحدود المشتركة بين مصر وبلدين هما:",
        "options": ["ليبيا وتونس", "ليبيا والسودان", "السودان وتشاد", "الجزائر والمغرب"],
        "answer": "ليبيا والسودان"
    },
    {
        "id": 268,
        "type": "true/false",
        "prompt": "تُعد الصحراء الكبرى التي تمثل أكبر صحاري العالم إحدى الظاهر التضاريسية المنتشرة فوق الهضبة الجنوبية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 269,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "الجزائر", "مصر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 270,
        "type": "true/false",
        "prompt": "تقع واحة الجوف كإحدى الظاهرات التضاريسية لهضبة شمال إفريقيا داخل دولة ليبيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 271,
        "type": "multiple choice",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بأنها تمتاز بخصوبة تربتها العالية جداً نتيجة لتعرضها لـ:",
        "options": ["التعرية الهوائية", "الطفوح البركانية", "الحركات الالتوائية القديمة", "الترسيبات النهرية"],
        "answer": "الطفوح البركانية"
    },
    {
        "id": 272,
        "type": "true/false",
        "prompt": "ساعدت خصوبة تربة هضبة الحبشة الناتجة عن الطفوح البركانية على قيام حرفة الزراعة ونشأة الحضارات القديمة بها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 273,
        "type": "multiple choice",
        "prompt": "تُصنف هضبة الحبشة وفقاً للمقارنات التضاريسية الواردة في المنهج بأنها تقع في جهة إفريقيا:",
        "options": ["الشمالية", "الوسطى", "الشرقية", "الجنوبية"],
        "answer": "الشرقية"
    },
    {
        "id": 274,
        "type": "true/false",
        "prompt": "تعد هضبة شمال إفريقيا من هضاب القارة وتتميز بأنها عظيمة الاتساع وقليلة الارتفاع.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 275,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (مساحة واسعة من الأرض مرتفعة مستوية أو شبه مستوية السطح) هو:",
        "options": ["السهل الفيضي", "الهضبة", "الجبل الالتوائي", "الأخدود الطولي"],
        "answer": "الهضبة"
    },
    {
        "id": 276,
        "type": "true/false",
        "prompt": "يُقصد بالطفوح البركانية الصخور المنصهرة التي تندفع من باطن الأرض إلى سطحها وتساهم في تكون الجبال والهضاب.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 277,
        "type": "multiple choice",
        "prompt": "ما هي الظاهرة التضاريسية الإفريقية التي يقطعها مدار الجدي؟",
        "options": ["الهضبة الشمالية", "هضبة الحبشة", "الهضبة الجنوبية", "هضبة الشطوط"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 278,
        "type": "true/false",
        "prompt": "العامل المشترك الجغرافي الأساسي بين هضبة الحبشة والهضبة الجنوبية هو وجود انكسارات طولية بهما.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 279,
        "type": "multiple choice",
        "prompt": "تتقاطع دائرة الاستواء مباشرة مع ظاهرتين تضاريسيتين في وسط إفريقيا هما جبل كينيا و:",
        "options": ["هضبة الحبشة", "هضبة البحيرات الاستوائية", "هضبة شمال إفريقيا", "الهضبة الجنوبية"],
        "answer": "هضبة البحيرات الاستوائية"
    },
    {
        "id": 280,
        "type": "true/false",
        "prompt": "العامل المشترك الطبيعي بين سهول البحر الأحمر وسهول المحيط الهندي في كينيا هو اقتراب المرتفعات من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 281,
        "type": "multiple choice",
        "prompt": "المساحة الإجمالية التي يجري بها نهر النيل وروافده المختلفة تُعرف في المصطلحات بـ:",
        "options": ["السهول الفيضية للنيل", "المجرى المائي الدولي", "حوض نهر النيل", "الدلتا الطبيعية"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 282,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية نحو 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 283,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 284,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان فقط من الدول العربية الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 285,
        "type": "multiple choice",
        "prompt": "من دول حوض نهر النيل الإحدى عشرة والمصنفة ضمن دول شرق ووسط إفريقيا دولة جمهورية الكونغو الديمقراطية و:",
        "options": ["الجزائر", "أوغندا", "المغرب", "تونس"],
        "answer": "أوغندا"
    },
    {
        "id": 286,
        "type": "true/false",
        "prompt": "اقترحت جمهورية مصر العربية على دول الحوض إنشاء تجمع إقليمي عام 1983م أطلق عليه اسم تجمع الأندوجو.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 287,
        "type": "multiple choice",
        "prompt": "يهدف تجمع الأندوجو الإقليمي الذي يضم دول حوض نهر النيل بشكل أساسي إلى التشاور والتنسيق و:",
        "options": ["دعم التعاون والحفاظ على المصالح المشتركة", "تقسيم مياه النهر بالتساوي الفوري", "منع الدول من إقامة مشروعات محلية", "توحيد الحدود السياسية للدول"],
        "answer": "دعم التعاون والحفاظ على المصالح المشتركة"
    },
    {
        "id": 288,
        "type": "true/false",
"prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي مفهوم 'الإخاء' باللغة السواحلية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 289,
"type": "multiple choice",
"prompt": "النهر الذي يمتد مجراه وروافده بالكامل داخل حدود دولة واحدة ولا يشترك مع غيرها يُعرف عكسياً بـ النهر المحلي، أما نهر النيل فيُعرف بـ:",
"options": ["النهر الإقليمي", "النهر القاري", "النهر الدولي", "النهر الساحلي"],
"answer": "النهر الدولي"
},
{
"id": 290,
"type": "true/false",
"prompt": "أكد الجغرافي الراحل جمال حمدان في كتاباته أن نهر النيل يتميز بأنه ثنائي المنبع مما أدى لاستدامته ووصوله إلى مصر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 291,
"type": "multiple choice",
"prompt": "تنقسم منابع نهر النيل الرئيسية إلى قسمين هما منابع دائمة (استوائية) ومنابع موسيقية تقع في هضبة:",
"options": ["شمال إفريقيا", "الحبشة (الإثيوبية)", "البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "الحبشة (الإثيوبية)"
},
{
"id": 292,
"type": "true/false",
"prompt": "تتميز منابع نهر النيل الدائمة (الاستوائية) بسقوط الأمطار طوال العام بسبب موقعها الفلكي ووقوعها عند دائرة الاستواء.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 293,
"type": "multiple choice",
"prompt": "تتميز منابع نهر النيل الموسمية (الإثيوبية) بسقوط الأمطار الغزيرة في فصل محدد من العام هو فصل:",
"options": ["الشتاء", "الربيع", "الصيف", "الخريف"],
"answer": "الصيف"
},
{
"id": 294,
"type": "true/false",
"prompt": "بالرغم من تدفق مياه المنابع الدائمة طوال العام، فإنه يصل منها كميات كبيرة جداً إلى مصر دون أي فاقد مائي.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 295,
"type": "multiple choice",
"prompt": "يرجع السبب الرئيسي وراء وصول كميات قليلة فقط من مياه المنابع الدائمة إلى مصر إلى المستنقعات و:",
"options": ["الانحدار نحو الجنوب", "زيادة معدلات البخر", "كثرة الثورانات البركانية", "الحركات الالتوائية للصخور"],
"answer": "زيادة معدلات البخر"
},
{
"id": 296,
"type": "true/false",
"prompt": "تضم المنابع الدائمة لنهر النيل مجموعة من البحيرات العذبة أهمها بحيرة فيكتوريا التي تعد ثاني أكبر البحيرات الطبيعية العذبة في العالم.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 297,
"type": "multiple choice",
"prompt": "من أهم مصادر التغذية المائية العذبة لبحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب هو نهر:",
"options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 298,
"type": "true/false",
"prompt": "يتميز نهر السوباط بأنه يلتقي بمجرى بحر الجبل ويمده بالمياه العذبة فيسترد النيل قوته الجارية شمالاً.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 299,
"type": "multiple choice",
"prompt": "تتضمن المنابع الموسمية الإثيوبية مجموعة من الروافد المهمة التي تمد النيل بمياهه وتساعده على الجريان شمالاً مثل نهر عطبرة و:",
"options": ["نهر كاجيرا", "نهر الكونغو", "النيل الأزرق", "نهر السنغال"],
"answer": "النيل الأزرق"
},
{
"id": 300,
"type": "true/false",
"prompt": "ينتهي المجرى الطولي لنهر النيل الدولي ويصب مياهه العذبة في جهة الشمال داخل البحر الأحمر.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
    }
],
"متوسط": [
          {
             "id": 301,
        "type": "multiple choice",
        "prompt": "يمر خط الاستواء في قارة إفريقيا بالطرف الجنوبي من دولة:",
        "options": ["مصر", "الصومال", "السودان", "ليبيا"],
        "answer": "الصومال"
    },
    {
        "id": 302,
        "type": "true/false",
        "prompt": "تتميز هضبة شمال إفريقيا بأنها عظيمة الاتساع وقليلة الارتفاع مقارنة بهضبة الحبشة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 303,
        "type": "multiple choice",
        "prompt": "تنحدر هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر:",
        "options": ["الأحمر", "المتوسط", "الأسود", "العربي"],
        "answer": "المتوسط"
    },
    {
        "id": 304,
        "type": "true/false",
        "prompt": "يعد جبل العوينات من المظاهر التضاريسية التي تقع بالكامل داخل الحدود الجغرافية لدولة مصر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 305,
        "type": "multiple choice",
        "prompt": "من أمثلة الواحات التي تقع في دولة ليبيا وتنتشر فوق هضبة شمال إفريقيا واحة:",
        "options": ["سيوة", "القطارة", "الجوف", "عين صالح"],
        "answer": "الجوف"
    },
    {
        "id": 306,
        "type": "true/false",
        "prompt": "تمتاز هضبة الحبشة بخصوبة تربتها العالية نتيجة لتعرضها القديم للطفوح البركانية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 307,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة :",
        "options": ["أقل هضاب القارة ارتفاعاً", "أعلى هضاب القارة ارتفاعاً", "أكثر هضاب القارة اتساعاً", "أقرب الهضاب للمحيط الأطلنطي"],
        "answer": "أعلى هضاب القارة ارتفاعاً"
    },
    {
        "id": 308,
        "type": "true/false",
        "prompt": "تتميز هضبة البحيرات الاستوائية في وسط القارة بأنها تنحدر بشكل عام من الشمال إلى الجنوب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 309,
        "type": "multiple choice",
        "prompt": "تعلو هضبة البحيرات الاستوائية في وسط قارة إفريقيا مجموعة من القمم الجبلية:",
        "options": ["الالتوائية", "الانكسارية", "البركانية", "التصدعية"],
        "answer": "البركانية"
    },
    {
        "id": 310,
        "type": "true/false",
        "prompt": "يقع الأخدود الإفريقي العظيم في الجزء الشرقي من الهضبة الجنوبية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 311,
        "type": "multiple choice",
        "prompt": "يتجه الامتداد الجغرافي العام للأخدود الإفريقي العظيم شرق القارة من:",
        "options": ["الشمال إلى الجنوب", "الشرق إلى الغرب", "الجنوب إلى الشمال", "الغرب إلى الشرق"],
        "answer": "الجنوب إلى الشمال"
    },
    {
        "id": 312,
        "type": "true/false",
        "prompt": "تُصنف جبال أطلس وجبال الكاب في إفريقيا على أنهما جبال انكسارية نشأت نتيجة تصدع الصخور الصلبة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 313,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلسلة جبال أطلس الالتوائية في شمال غرب إفريقيا هي جبل:",
        "options": ["شايب البنات", "كينيا", "توبقال", "كلمنجارو"],
        "answer": "توبقال"
    },
    {
        "id": 314,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس التل وأطلس الصحراء بينهما هضبة الشطوط في دولة الجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 315,
        "type": "multiple choice",
        "prompt": "تعد جبال البحر الأحمر جبالاً انكسارية، وأعلى قمة جبلية في سلسلتها داخل مصر هي جبل:",
        "options": ["توبقال", "شايب البنات", "العوينات", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 316,
        "type": "true/false",
        "prompt": "تمتد جبال البحر الأحمر الانكسارية عبر أراضي ثلاث دول إفريقية هي مصر والسودان وإريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 317,
        "type": "multiple choice",
        "prompt": "يتطابق سبب النشأة التكوينية البركانية لجبل كلمنجارو مع سبب نشأة جبل:",
        "options": ["أطلس", "الكاب", "كينيا", "شايب البنات"],
        "answer": "كينيا"
    },
    {
        "id": 318,
        "type": "true/false",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو نتيجة لموقعه الفلكي في العروض القطبية الباردة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 319,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب:",
        "options": ["اقترابه من مياه المحيط", "شدة ارتفاعه وعلو قمته", "كثرة الأمطار الشتوية", "تأثير الحركات الانكسارية"],
        "answer": "شدة ارتفاعه وعلو قمته"
    },
    {
        "id": 320,
        "type": "true/false",
        "prompt": "تساهم المناطق الجبلية في إفريقيا في دعم نشاط التعدين والصناعة لأنها غنية بالثروات المعدنية كالحديد والذهب.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 321,
        "type": "multiple choice",
        "prompt": "تتميز سهول وادي النيل بخصوبة تربتها العالية نتيجة لتكونها من الطمي المنقول من هضبة:",
        "options": ["شمال إفريقيا", "البحيرات الاستوائية", "الحبشة", "الهضبة الجنوبية"],
        "answer": "هضبة الحبشة"
    },
    {
        "id": 322,
        "type": "true/false",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال أطلس من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 323,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها في دولة تنزانيا بينما تضيق في دولة:",
        "options": ["مصر", "كينيا", "السودان", "الجزائر"],
        "answer": "كينيا"
    },
    {
        "id": 324,
        "type": "true/false",
        "prompt": "تعد سهول المحيط الأطلنطي في غرب القارة سهولاً ضيقة وغير صالحة للاستغلال الزراعي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 325,
        "type": "multiple choice",
        "prompt": "أكبر جزر القارة الإفريقية مساحة وتقع في مياه المحيط الهندي هي جزيرة:",
        "options": ["جزر القمر", "مدغشقر", "سيشل", "موريشيوس"],
        "answer": "مدغشقر"
    },
    {
        "id": 326,
        "type": "true/false",
        "prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية ممر مائي مهم هو مضيق موزمبيق.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 327,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو:",
        "options": ["السهل الفيضي للنيل", "المجرى الدولي", "حوض نهر النيل", "الدلتا الطبيعية"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 328,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل إجمالاً نحو 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 329,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["9 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 330,
        "type": "true/false",
        "prompt": "اقترحت مصر على دول حوض النيل إنشاء تجمع إقليمي عام 1983م أطلق عليه اسم تجمع الأندوجو.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 331,
        "type": "multiple choice",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم المعنى التالي:",
        "options": ["التعاون الاقتصادي", "التنمية المستدامة", "الإخاء", "السلام الدولي"],
        "answer": "الإخاء"
    },
    {
        "id": 332,
        "type": "true/false",
        "prompt": "أشار الجغرافي جمال حمدان إلى أن نهر النيل يتميز بأنه ثنائي المنبع مما أدى لاستدامته ووصوله لمصر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 333,
        "type": "multiple choice",
        "prompt": "تقع منابع نهر النيل الدائمة (الاستوائية) في نطاق تضاريس هضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "هضبة البحيرات الاستوائية"
    },
    {
        "id": 334,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية بسقوط الأمطار الغزيرة عليها طوال العام بسبب موقعها الفلكي الاستوائي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 335,
        "type": "multiple choice",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعد مصدراً للمنابع:",
        "options": ["الموسمية", "الدائمة", "المؤقتة", "البركانية"],
        "answer": "الدائمة"
    },
    {
        "id": 336,
        "type": "true/false",
        "prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بالمياه العذبة فيسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 337,
        "type": "multiple choice",
        "prompt": "من الروافد الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
        "options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 338,
        "type": "true/false",
        "prompt": "من جهود مصر لدعم التنمية المستدامة المائية القيام بحفر عشرات الآبار النقية في دولة كينيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 339,
        "type": "multiple choice",
        "prompt": "السد المائي الذي قامت مصر بالمساهمة في إنشائه ودعم بنائه في دولة أوغندا هو سد:",
        "options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
        "answer": "أوين"
    },
    {
        "id": 340,
        "type": "true/false",
        "prompt": "ساهمت مصر في إنشاء خزان سنار على مجرى النيل الأبيض بدولة السودان.",
        "options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 341,
"type": "multiple choice",
"prompt": "الاتفاقية الإقليمية الموقعة عام 1929م نصت على التزام دول الحوض بعدم إقامة مشروعات مائية دون اتفاق مسبق مع:",
"options": ["إثيوبيا", "السودان", "مصر", "أوغندا"],
"answer": "مصر"
},
{
"id": 342,
"type": "true/false",
"prompt": "اتفقت مصر وإثيوبيا والسودان في اتفاقية عام 2015م على مبدأ الاستخدام المنصف والمناسب لمياه نهر النيل.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 343,
"type": "multiple choice",
"prompt": "حرص المصريون القدماء عبر العصور على توطيد علاقاتهم التجارية مع الحضارات الإفريقية المجاورة مثل بلاد بونت وحضارة:",
"options": ["قرطاج", "أكسوم", "كوش", "أوروبا"],
"answer": "كوش"
},
{
"id": 344,
"type": "true/false",
"prompt": "نشأت حضارة قرطاج القديمة المذكورة في المنهج التاريخي للجزء الشمالي على أرض دولة تونس الحالية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 345,
"type": "multiple choice",
"prompt": "نشأت حضارة أكسوم القديمة في قارة إفريقيا على أراضي دولتي إثيوبيا و:",
"options": ["مصر", "السودان", "إريتريا", "تونس"],
"answer": "إريتريا"
},
{
"id": 346,
"type": "true/false",
"prompt": "تعد دولة الجزائر أكبر دول القارة الإفريقية من حيث المساحة وفقاً للخريطة السياسية للدرس.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 347,
"type": "multiple choice",
"prompt": "يوجد بقارة إفريقيا دول حبيسة (لا تطل على مسطحات مائية) ومذكورة كنموذج بالمنهج مثل دولة النيجر ودولة:",
"options": ["الصومال", "المغرب", "تشاد", "مصر"],
"answer": "تشاد"
},
{
"id": 348,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما عمق دورها الريادي وعلاقاتها مع شعوب القارة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 349,
"type": "multiple choice",
"prompt": "من أوائل الرحالة العرب الذين زاروا إفريقيا وكتبوا عنها وجاء ذكره في امتحانات المحافظات هو الرحالة:",
"options": ["ابن خلدون", "ابن بطوطة", "المسعودي", "ابن سينا"],
"answer": "المسعودي"
},
{
"id": 350,
"type": "true/false",
"prompt": "بدأ البرتغاليون محاولاتهم الاستكشافية بالقرن 15م في عهد الأمير هنري الملاح واستفادوا مما كتبه العرب في رحلاتهم.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 351,
        "type": "multiple choice",
        "prompt": "وفقاً للموقع الفلكي لقارة إفريقيا، يبلغ عدد خطوط الطول التي تمتد عبر القارة حوالي:",
        "options": ["51 خط طول", "17 خط طول", "68 خط طول", "70 خط طول"],
        "answer": "68 خط طول"
    },
    {
        "id": 352,
        "type": "true/false",
        "prompt": "يمتد نحو ثلث مساحة قارة إفريقيا في نصف الكرة الأرضية الجنوبي بينما يقع الثلثان في النصف الشمالي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 353,
        "type": "multiple choice",
        "prompt": "يحد قارة إفريقيا من جهة الشرق البحر الأحمر والمحيط:",
        "options": ["الأطلنطي", "الهندي", "الهادي", "القطبي"],
        "answer": "المحيط الهندي"
    },
    {
        "id": 354,
        "type": "true/false",
        "prompt": "الموقع الجغرافي هو موقع المكان بالنسبة لدوائر العرض وخطوط الطول.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 355,
        "type": "multiple choice",
        "prompt": "يُقصد بـ (موقع المكان سواء كان قارة أو دولة بالنسبة للأماكن الأخرى من بحار ومحيطات ودول مجاورة):",
        "options": ["الموقع الفلكي", "الموقع الجغرافي", "الأهمية الحضارية", "الأهمية الاستراتيجية"],
        "answer": "الموقع الجغرافي"
    },
    {
        "id": 356,
        "type": "true/false",
        "prompt": "تمتد قارة إفريقيا بين دائرتي عرض 37°30' شمالاً و34°30' جنوباً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 357,
        "type": "multiple choice",
        "prompt": "تمتد قارة إفريقيا فلكياً بين خطي طول 17° غرباً و:",
        "options": ["37° شرقاً", "34° شرقاً", "51° شرقاً", "68° شرقاً"],
        "answer": "51° شرقاً"
    },
    {
        "id": 358,
        "type": "true/false",
        "prompt": "يُعد تنوع الحيوانات والنباتات الطبيعية في إفريقيا نتيجة مباشرة لموقعها الجغرافي المتميز.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 359,
        "type": "multiple choice",
        "prompt": "نشأت على أرض قارة إفريقيا العديد من أقدم حضارات العالم، ومنها حضارة كوش التي قامت في دولة:",
        "options": ["مصر", "تونس", "السودان", "إريتريا"],
        "answer": "السودان"
    },
    {
        "id": 360,
        "type": "true/false",
        "prompt": "الحفاظ على أمن شبه جزيرة سيناء يعد ضرورة أساسية للحفاظ على أمن مصر القومي والإفريقي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 361,
        "type": "multiple choice",
        "prompt": "ينقسم الإنتاج الحضاري في مفهومه العام إلى إنتاج مادي (مثل القلاع والمباني) وإنتاج ثقافي مثل:",
        "options": ["القصور والبيوت", "المتاحف والآثار", "العادات والتقاليد والعلوم", "الموانئ والمراكز التجارية"],
        "answer": "العادات والتقاليد والعلوم"
    },
    {
        "id": 362,
        "type": "true/false",
        "prompt": "تعرضت مصر عبر العصور للعديد من الحملات العسكرية من ناحية شبه جزيرة سيناء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 363,
        "type": "multiple choice",
        "prompt": "قام الملك المصري نخاو الثاني بالاستعانة ببحارة وتسيير بعثة للدوران حول إفريقيا، وكان هؤلاء البحارة من:",
        "options": ["العرب", "الفينيقيين", "البرتغاليين", "الرومان"],
        "answer": "الفينيقيين"
    },
    {
        "id": 364,
        "type": "true/false",
        "prompt": "من أوائل المصريين الذين اكتشفوا أجزاء من قارة إفريقيا في العصر القديم الملك نخاو الثاني.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 365,
        "type": "multiple choice",
        "prompt": "قام الرحالة المصري القديم حرخوف برحلاته الاستكشافية في عهد الأسرتين:",
        "options": ["الأولى والثانية", "الرابعة والخامسة", "الخامسة والسادسة", "الواحدة والعشرين"],
        "answer": "الخامسة والسادسة"
    },
    {
        "id": 366,
        "type": "true/false",
        "prompt": "وصل المصريون القدماء في رحلاتهم الاستكشافية إلى السودان وبعض دول شرق إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 367,
        "type": "multiple choice",
        "prompt": "انتهت الرحلات الاستكشافية التي أرسلها محمد علي باشا عام 1839م بالوصول إلى:",
        "options": ["النيل الأزرق", "النيل الأبيض", "نهر عطبرة", "بحيرة تانا"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 368,
        "type": "true/false",
        "prompt": "اقتصر اهتمام مصر بالكشوف الجغرافية الإفريقية في العصر الحديث على فترة حكم محمد علي باشا فقط.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 369,
        "type": "multiple choice",
        "prompt": "شهد العصر الحديث استكمال اكتشاف منابع النيل ورسم خريطة له حتى جنوب السودان في عهد:",
        "options": ["محمد علي باشا", "الخديو إسماعيل", "الملك نخاو الثاني", "الأمير هنري"],
        "answer": "محمد علي باشا"
    },
    {
        "id": 370,
        "type/false": "إلى جانب ابن بطوطة، يُعد الجغرافي المسعودي من أوائل الرحالة العرب الذين زاروا إفريقيا وكتبوا عنها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 371,
        "type": "multiple choice",
        "prompt": "أسس البرتغاليون موانئ ومراكز تجارية على طول طريق رأس الرجاء الصالح من أجل:",
        "options": ["نشر الثقافة الأوروبية", "تأمين الملاحة والتجارة", "الوصول إلى قارة أمريكا الشمالية", "مساعدة الجغرافيين العرب"],
        "answer": "تأمين الملاحة والتجارة"
    },
    {
        "id": 372,
        "type": "true/false",
        "prompt": "بدأ البرتغاليون محاولاتهم الاستكشافية حول إفريقيا في نهاية القرن الثامن عشر الميلادي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 373,
        "type": "multiple choice",
        "prompt": "توالت الكشوف الجغرافية الاستعمارية على قارة إفريقيا في نهاية القرن 18م من دول عدة ليس من بينها:",
        "options": ["فرنسا", "إنجلترا", "هولندا", "البرتغال"],
        "answer": "البرتغال"
    },
    {
        "id": 374,
        "type": "true/false",
        "prompt": "تضم قارة إفريقيا دولاً ساحلية تطل على مسطحات مائية ودولاً حبيسة لا تطل على مسطحات مائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 375,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الساحلية التي تطل على مسطحات مائية دولة:",
        "options": ["تشاد", "النيجر", "مالي", "المغرب"],
        "answer": "المغرب"
    },
    {
        "id": 376,
        "type": "true/false",
        "prompt": "تعد دولة تونس إحدى الدول العربية الإفريقية العشرة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 377,
        "type": "multiple choice",
        "prompt": "من الدول العربية الإفريقية التي تقع في المحيط الهندي وتُصنف ضمن دول القارة دولة:",
        "options": ["موريتانيا", "جيبوتي", "جزر القمر", "الصومال"],
        "answer": "جزر القمر"
    },
    {
        "id": 378,
        "type": "true/false",
        "prompt": "ينحدر سطح هضبة شمال إفريقيا تدريجياً نحو الشمال حتى يلتقي بسواحل البحر الأحمر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 379,
        "type": "multiple choice",
        "prompt": "تنتشر فوق هضبة شمال إفريقيا ظاهرات تضاريسية متعددة، ومن أمثلة الجبال المنتشرة فوقها جبل:",
        "options": ["توبقال", "العوينات", "شايب البنات", "كينيا"],
        "answer": "العوينات"
    },
    {
        "id": 380,
        "type": "true/false",
        "prompt": "تعد الصحراء الكبرى أكبر صحاري العالم، وهي تمثل جزءاً من سطح هضبة شمال إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 381,
        "type": "multiple choice",
        "prompt": "تقع واحة سيوة كإحدى الظاهرات التضاريسية لهضبة شمال إفريقيا في دولة:",
        "options": ["ليبيا", "مصر", "الجزائر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 382,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بأنها تقع في الجزء الغربي من القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 383,
        "type": "multiple choice",
        "prompt": "السبب الرئيسي وراء خصوبة تربة هضبة الحبشة ونشأة الحضارات القديمة بها هو:",
        "options": ["الحركات الالتوائية", "الطفوح البركانية", "الترسيبات الرياحية", "السهول الفيضية للنيل"],
        "answer": "الطفوح البركانية"
    },
    {
        "id": 384,
        "type": "true/false",
        "prompt": "تمر دائرة الاستواء في وسط قارة إفريقيا تقريباً وتقطع هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 385,
        "type": "multiple choice",
        "prompt": "من البحيرات العذبة الكثيرة التي تنتشر فوق سطح هضبة البحيرات الاستوائية بحيرة:",
        "options": ["تانا", "ناصر", "فيكتوريا", "قارون"],
        "answer": "فيكتوريا"
    },
    {
        "id": 386,
        "type": "true/false",
        "prompt": "الهضبة الجنوبية لقارة إفريقيا تنحدر بشدة نحو السواحل الغربية للقارة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 387,
        "type": "multiple choice",
        "prompt": "تمتد السلسلتان المتوازيتان لجبال أطلس (أطلس التل وأطلس الصحراء) على طول الساحل:",
        "options": ["الشمالي الشرقي للقارة", "الشمالي الغربي للقارة", "الجنوبي الشرقي للقارة", "الجنوبي الغربي للقارة"],
        "answer": "الشمالي الغربي للقارة"
    },
    {
        "id": 388,
        "type": "true/false",
        "prompt": "تُصنف جبال البحر الأحمر على أنها جبال انكسارية تمتد في مصر والسودان وإريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 389,
        "type": "multiple choice",
        "prompt": "تتميز جبال كينيا وكلمنجارو في وسط إفريقيا وجبال دراكنزبرج في جنوبها بأنها جبال من النوع:",
        "options": ["الالتوائي", "الانكساري", "البركاني", "التصادمي"],
        "answer": "البركاني"
    },
    {
        "id": 390,
        "type": "true/false",
"prompt": "تساهم المناطق الجبلية في إفريقيا في دعم نشاط السياحة الترفيهية لممارسة الأنشطة بالمناطق الجبلية الخلابة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 391,
"type": "multiple choice",
"prompt": "تتكون سهول وادي النيل في مصر والسودان من التربة الخصبة الصالحة للزراعة نتيجة لترسيب المواد العالقة المنقولة من:",
"options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "الهضبة الجنوبية", "هضبة الشطوط"],
"answer": "هضبة الحبشة"
},
{
"id": 392,
"type": "true/false",
"prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال البحر الأحمر من الساحل.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 393,
"type": "multiple choice",
"prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي بأنها تختلف في الاتساع، حيث تكون واسعة في دولة:",
"options": ["كينيا", "تنزانيا", "مصر", "السودان"],
"answer": "تنزانيا"
},
{
"id": 394,
"type": "true/false",
"prompt": "تعد جزر القمر جزراً إفريقية تقع في مياه المحيط الهندي إلى النصف الشمالي الغربي من جزيرة مدغشقر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 395,
"type": "multiple choice",
"prompt": "المصطلح الجغرافي الذي يُعبر عن (السهول التي كونتها الأنهار عن طريق ترسيب المواد العالقة بمياهها) هو السهول:",
"options": ["الساحلية", "الفيضية", "الصحراوية", "البركانية"],
"answer": "السهول الفيضية"
},
{
"id": 396,
"type": "true/false",
"prompt": "تعني كلمة (الأندوجو) باللغة السواحلية مفهوم 'التعاون والمصلحة المشتركة'.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 397,
"type": "multiple choice",
"prompt": "تشمل منابع نهر النيل الدائمة مجموعة من الروافد، ويلتقي نهر ........ بمجرى بحر الجبل فيمده بالمياه ليسترد النيل قوته الجارية شمالاً:",
"options": ["كاجيرا", "السوباط", "عطبرة", "النيل الأزرق"],
"answer": "نهر السوباط"
},
{
"id": 398,
"type": "true/false",
"prompt": "تتميز منابع نهر النيل الدائمة بسقوط الأمطار عليها طوال العام بسبب موقعها الفلكي عند دائرة الاستواء.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 399,
"type": "multiple choice",
"prompt": "من الجهود التي قامت بها مصر في دولة السودان لدعم التنمية المائية إنشاء خزان سنار على النيل الأزرق و خزان:",
"options": ["سد أوين", "جبل الأولياء", "أسوان", "سنار الجديد"],
"answer": "جبل الأولياء"
},
{
"id": 400,
"type": "true/false",
"prompt": "نصت اتفاقية عام 1929م الدولية على تنظيم وإدارة وتنمية مياه النيل وحظر إقامة مشروعات مائية دون اتفاق مسبق مع مصر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 401,
        "type": "multiple choice",
        "prompt": "يمر مدار الجدي في قارة إفريقيا في جهة:",
        "options": ["الشمال", "الجنوب", "الشرق", "الوسط"],
        "answer": "الجنوب"
    },
    {
        "id": 402,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر المتوسط في شمال إفريقيا بأنها تضيق في شمال مصر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 403,
        "type": "multiple choice",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "الكاب", "أطلس", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 404,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر بأنها غنية بالثروات المعدنية ومصادر الطاقة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 405,
        "type": "multiple choice",
        "prompt": "الشريط الساحلي الضيق في دولة كينيا ينحصر مباشرة بين الساحل وهضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 406,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي بالاتساع الواضح في دولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 407,
        "type": "multiple choice",
        "prompt": "تُعد سهول المحيط الأطلنطي في غرب القارة الإفريقية سهولاً:",
        "options": ["ضيقة جداً وغير صالحة للزراعة", "واسعة غنية بحقولها الزراعية", "بركانية جافة", "صحراوية خالية من السكان"],
        "answer": "واسعة غنية بحقولها الزراعية"
    },
    {
        "id": 408,
        "type": "true/false",
        "prompt": "تعد جزيرة مدغشقر أكبر جزر القارة الإفريقية وتقع في مياه المحيط الأطلنطي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 409,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية ممر مائي مهم هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 410,
        "type": "true/false",
        "prompt": "تقع جزر القمر في المحيط الهندي وتحديداً في جهة الشمال الغربي من جزيرة مدغشقر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 411,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُعبر عن (المساحة التي يجري بها نهر النيل وروافده) هو:",
        "options": ["السهل الفيضي", "حوض نهر النيل", "الدلتا", "المنبع المائي"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 412,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية نحو 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 413,
        "type": "multiple choice",
        "prompt": "يمتد مجرى نهر النيل وروافده داخل أراضي إحدى عشرة دولة إفريقية، ولذلك يُصنف بأنه نهر:",
        "options": ["محلي", "إقليمي", "دولي", "ساحلي"],
        "answer": "دولي"
    },
    {
        "id": 414,
        "type": "true/false",
        "prompt": "اقترحت مصر على دول حوض النيل إنشاء تجمع إقليمي عام 1983م عُرف باسم تجمع الأندوجو.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 415,
        "type": "multiple choice",
        "prompt": "تعني كلمة (الأندوجو) باللغة السواحلية مفهوم المعنى التالي:",
        "options": ["التعاون الاقتصادي", "التنمية المستدامة", "الإخاء", "السلام الدولي"],
        "answer": "الإخاء"
    },
    {
        "id": 416,
        "type": "true/false",
        "prompt": "أشار الجغرافي جمال حمدان إلى أن نهر النيل ثنائي المنبع، مما أدى لاستدامته ووصوله إلى مصر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 417,
        "type": "multiple choice",
        "prompt": "تقع منابع نهر النيل الدائمة (الاستوائية) في نطاق تضاريس هضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "هضبة البحيرات الاستوائية"
    },
    {
        "id": 418,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الدائمة بسقوط الأمطار عليها طوال العام بسبب موقعها الفلكي عند دائرة الاستواء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 419,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة بالنسبة لنهر النيل هي المنبع البارز المسمى بالمنبع:",
        "options": ["الدائم", "الموسمي", "المؤقت", "الفرعي"],
        "answer": "الموسمي"
    },
    {
        "id": 420,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية بسقوط الأمطار الصيفية الغزيرة عليها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 421,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الدائمة إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر و وجود:",
        "options": ["الطفوح البركانية", "الانكسارات الطولية", "المستنقعات", "الإنحدار الشديد نحو الجنوب"],
        "answer": "المستنقعات"
    },
    {
        "id": 422,
        "type": "true/false",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 423,
        "type": "multiple choice",
        "prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها من جهة الغرب هو نهر:",
        "options": ["السوباط", "عطبرة", "kاجيرا", "النيل الأزرق"],
        "answer": "kاجيرا"
    },
    {
        "id": 424,
        "type": "true/false",
        "prompt": "يلتقي نهر السوباط ببحر الجبل ويمده بمياهه فيسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 425,
        "type": "multiple choice",
        "prompt": "من الروافد الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
        "options": ["kاجيرا", "بحر الغزال", "النيل الأزرق", "بحر العرب"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 426,
        "type": "true/false",
        "prompt": "قامت مصر بحفر عشرات الآبار النقية في دولة كينيا لدعم التنمية المستدامة والمائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 427,
        "type": "multiple choice",
        "prompt": "ساهمت مصر في تنمية دول حوض النيل فأنشأت سد أوين الشهير في دولة:",
        "options": ["السودان", "كينيا", "أوغندا", "تنزانيا"],
        "answer": "أوغندا"
    },
    {
        "id": 428,
        "type": "true/false",
        "prompt": "قامت مصر بالمساعدة والمساهمة في تطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات الضارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 429,
        "type": "multiple choice",
        "prompt": "من الجهود التي قامت بها مصر في دولة السودان إنشاء خزان سنار على النيل الأزرق والمساهمة في خزان:",
        "options": ["سد أوين", "جبل الأولياء", "أسوان", "فيكتوريا المائي"],
        "answer": "جبل الأولياء"
    },
    {
        "id": 430,
        "type": "true/false",
        "prompt": "أنشأت مصر مركزاً متطوراً للبحوث المائية في دولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 431,
        "type": "multiple choice",
        "prompt": "الاتفاقية الإقليمية الموقعة عام 1929م نصت على التزام دول حوض النيل بعدم القيام بأي مشروعات بغير اتفاق مسبق مع:",
        "options": ["إثيوبيا", "السودان", "مصر", "أوغندا"],
        "answer": "مصر"
    },
    {
        "id": 432,
        "type": "true/false",
        "prompt": "اتفقت مصر وإثيوبيا والسودان في اتفاقية عام 2015م على مبادئ التنمية والتعاون وعدم التسبب في ضرر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 433,
        "type": "multiple choice",
        "prompt": "حرص المصريون القدماء عبر العصور على توطيد علاقاتهم التجارية مع الحضارات الإفريقية المجاورة مثل بلاد بونت وحضارة:",
        "options": ["قرطاج", "أكسوم", "كوش", "أوروبا"],
        "answer": "كوش"
    },
    {
        "id": 434,
        "type": "true/false",
        "prompt": "نشأت حضارة قرطاج القديمة المذكورة في المنهج التاريخي للقارة على أرض دولة تونس الحالية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 435,
        "type": "multiple choice",
        "prompt": "نشأت حضارة أكسوم القديمة في قارة إفريقيا على أراضي دولتي إثيوبيا و:",
        "options": ["مصر", "السودان", "إريتريا", "تونس"],
        "answer": "إريتريا"
    },
    {
        "id": 436,
        "type": "true/false",
        "prompt": "تعد دولة الجزائر أكبر دول القارة الإفريقية من حيث المساحة .",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 437,
        "type": "multiple choice",
        "prompt": "يوجد بقارة إفريقيا دول حبيسة (لا تطل على مسطحات مائية) ومذكورة كنموذج بالمنهج مثل دولة النيجر ودولة:",
        "options": ["الصومال", "المغرب", "تشاد", "مصر"],
        "answer": "تشاد"
    },
    {
        "id": 438,
        "type": "true/false",
        "prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما عمق دورها الريادي وعلاقاتها مع شعوب القارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 439,
        "type": "multiple choice",
        "prompt": "من أوائل الرحالة العرب الذين زاروا إفريقيا وكتبوا عنها وجاء ذكره في امتحانات المحافظات هو الرحالة:",
        "options": ["ابن خلدون", "ابن بطوطة", "المسعودي", "ابن سينا"],
        "answer": "المسعودي"
    },
    {
        "id": 440,
        "type": "true/false",
        "prompt": "بدأ البرتغاليون محاولاتهم الاستكشافية بالقرن 15م في عهد الأمير هنري الملاح واستفادوا مما كتبه العرب في رحلاتهم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 441,
        "type": "multiple choice",
"prompt": "تقع قارة إفريقيا بين خطي طول 51° شرقاً و17° غرباً، أي حوالي كم خط طول؟",
"options": ["54 خط طول", "68 خط طول", "70 خط طول", "72 خط طول"],
"answer": "68 خط طول"
},
{
"id": 442,
"type": "true/false",
"prompt": "يمر مدار السرطان في الجزء الجنوبي من قارة إفريقيا بينما يمر مدار الجدي في الجزء الشمالي.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 444,
"type": "true/false",
"prompt": "تتميز هضبة شمال إفريقيا بوجود العديد من التضاريس فوقها مثل منخفض القطارة في مصر واحة الجوف في ليبيا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 445,
"type": "multiple choice",
"prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة مباشرة بين مصر و:",
"options": ["ليبيا وتونس", "ليبيا والسودان", "السودان وتشاد", "الجزائر والمغرب"],
"answer": "ليبيا والسودان"
},
{
"id": 446,
"type": "true/false",
"prompt": "تُصنف جبال أطلس في شمال غرب القارة وجبال الكاب في جنوبها على أنهما من الجبال الانكسارية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 447,
"type": "multiple choice",
"prompt": "تحصر سلسلتا جبال أطلس (أطلس التل وأطلس الصحراء) بينهما ظاهرة تضاريسية هامة في الجزائر هي هضبة:",
"options": ["شمال إفريقيا", "الحبشة", "الشطوط", "البحيرات الاستوائية"],
"answer": "الشطوط"
},
{
"id": 448,
"type": "true/false",
"prompt": "تتميز جبال البحر الأحمر الانكسارية بأنها تمتد داخل أراضي مصر والسودان ودولة إريتريا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 449,
"type": "multiple choice",
"prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية وتوجد داخل مصر هي جبل:",
"options": ["توبقال", "شايب البنات", "كينيا", "كلمنجارو"],
"answer": "شايب البنات"
},
{
"id": 450,
"type": "true/false",
"prompt": "تعد جبال كينيا وكلمنجارو في وسط إفريقيا وجبال دراكنزبرج في جنوبها من الجبال البركانية التكوين.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 451,
"type": "multiple choice",
"prompt": "المصطلح الجغرافي الذي يُعبر عن (مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال) هو:",
"options": ["حوض نهر النيل", "الأخدود الإفريقي العظيم", "السهول الفيضية", "سلاسل جبال أطلس"],
"answer": "الأخدود الإفريقي العظيم"
},
{
"id": 452,
"type": "true/false",
"prompt": "يُعد كل من البحر الأحمر وخليج عدن وخليج العقبة من الأجزاء التابعة للأخدود الإفريقي العظيم شرق القارة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 453,
"type": "multiple choice",
"prompt": "تساهم المناطق الجبلية في قارة إفريقيا في دعم العديد من الأنشطة الاقتصادية الهامة مثل التعدين والصناعة و:",
"options": ["الرعي الجاف", "السياحة", "صيد الأسماك النهرية", "استصلاح الصحاري الملحية"],
"answer": "السياحة"
},
{
"id": 454,
"type": "true/false",
"prompt": "تتميز السهول الفيضية الخصبة في إفريقيا بصلاحيتها التامة لحرفة الزراعة نتيجة للمواد والترسبات الطمية التي كونتها الأنهار.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 455,
        "type": "multiple choice",
        "prompt": "يمتد اليابس الإفريقي فلكياً عبر عدد من الدوائر العرضية يبلغ حوالي:",
        "options": ["51 دائرة عرضية", "68 دائرة عرضية", "70 دائرة عرضية", "72 دائرة عرضية"],
        "answer": "70 دائرة عرضية"
    },
    {
        "id": 456,
        "type": "true/false",
        "prompt": "يمر خط الطول الرئيسي جرينتش في الجزء الشرقي من القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 457,
        "type": "multiple choice",
        "prompt": "المسطح المائي الذي يحد قارة إفريقيا من جهة الغرب ويفصلها عن قارتي أمريكا الشمالية والجنوبية هو:",
        "options": ["المحيط الهندي", "المحيط الأطلنطي", "البحر المتوسط", "خليج عدن"],
        "answer": "المحيط الأطلنطي"
    },
    {
        "id": 458,
        "type": "true/false",
        "prompt": "تقع دولة الجزائر كأكبر دول القارة الإفريقية مساحة في نطاق تضاريس الهضبة الجنوبية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 459,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية ومذكورة في الخريطة السياسية للدرس دولة:",
        "options": ["مصر", "المغرب", "الصومال", "مالي"],
        "answer": "مالي"
    },
    {
        "id": 460,
        "type": "true/false",
        "prompt": "تُصنف دولة الصومال ودولة المغرب كأمثلة للدول الساحلية في قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 461,
        "type": "multiple choice",
        "prompt": "أحد الجغرافيين والرحالة العرب الذي زار إفريقيا وكتب عنها وكان من أوائل الرحالة هو:",
        "options": ["ابن خلدون", "ابن سينا", "المسعودي", "ابن الهيثم"],
        "answer": "المسعودي"
    },
    {
        "id": 462,
        "type": "true/false",
        "prompt": "نجح الرحالة العربي ابن بطوطة في اختراق الصحراء الكبرى من الشمال إلى الجنوب حتى وصل إلى مالي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 463,
        "type": "multiple choice",
        "prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا في القرن الخامس عشر الميلادي خلال عهد الأمير:",
        "options": ["فاسكو دي جاما", "بارتولوميو دياس", "هنري الملاح", "جون سبيك"],
        "answer": "هنري الملاح"
    },
    {
        "id": 464,
        "type": "true/false",
        "prompt": "أسس البرتغاليون الموانئ والمراكز التجارية على طول طريق رأس الرجاء الصالح بهدف تأمين الملاحة والتجارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 465,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات لاكتشاف منابع النيل عام 1839م وانتهت باكتشاف النيل:",
        "options": ["الأزرق", "الأبيض", "المباركي", "الفيضي"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 466,
        "type": "true/false",
        "prompt": "وصل المد الحضاري والحكم المصري في عهد الخديو إسماعيل إلى جنوب دائرة الاستواء أثناء اكتشاف منابع النيل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 467,
        "type": "multiple choice",
        "prompt": "من الرحالة المصريين القدامى في عصر الأسرتين الخامسة والسادسة الذي قام بأربع رحلات نحو الجنوب:",
        "options": ["الملك نخاو الثاني", "الرحالة حرخوف", "محمد علي باشا", "الخديو إسماعيل"],
        "answer": "الرحالة حرخوف"
    },
    {
        "id": 468,
        "type": "true/false",
        "prompt": "بدأت رحلة بعثة الملك نخاو الثاني للدوران حول إفريقيا من البحر الأحمر وعادت عبر مضيق جبل طارق.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 469,
        "type": "multiple choice",
        "prompt": "الحضارة القديمة التي نشأت تاريخياً في قارة إفريقيا على أراضي دولتي إريتريا وإثيوبيا معاً هي حضارة:",
        "options": ["قرطاج", "كوش", "أكسوم", "المصرية القديمة"],
        "answer": "أكسوم"
    },
    {
        "id": 470,
        "type": "true/false",
        "prompt": "نشأت حضارة قرطاج القديمة على أرض دولة تونس الحالية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 471,
        "type": "multiple choice",
        "prompt": "تتميز هضبة الحبشة بخصوبة تربتها العالية، وتُصنف جغرافياً في المنهج بأنها تقع في جهة إفريقيا:",
        "options": ["الشمالية", "الوسطى", "الشرقية", "الجنوبية"],
        "answer": "الشرقية"
    },
    {
        "id": 472,
        "type": "true/false",
        "prompt": "تعد هضبة البحيرات الاستوائية في وسط القارة هي المنبع الموسمي الرئيسي لنهر النيل.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 473,
        "type": "multiple choice",
        "prompt": "أي من الهضاب الإفريقية التالية يوجد في جزئها الشرقي تضاريس الأخدود الإفريقي العظيم؟",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 474,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 475,
        "type": "multiple choice",
        "prompt": "من أجزاء الأخدود الإفريقي العظيم المذكورة في متن الدرس البحر الأحمر وخليج عدن وخليج:",
        "options": ["غينيا", "العقبة", "السويس", "العرب"],
        "answer": "العقبة"
    },
    {
        "id": 476,
        "type": "true/false",
        "prompt": "تحصر سلاسل جبال أطلس المتوازية في شمال غرب القارة بينهما هضبة الشطوط بدولة الجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 477,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية وتوجد داخل مصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 478,
        "type": "true/false",
        "prompt": "تتميز جبال كينيا وكلمنجارو في وسط إفريقيا بأنها جبال التوائية نشأت نتيجة حركات باطنية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 479,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب:",
        "options": ["موقعه الفلكي القطبي", "شدة ارتفاعه وعلو قمته", "كثرة الأمطار الشتوية", "تأثير الرياح التجارية الغربية"],
        "answer": "شدة ارتفاعه وعلو قمته"
    },
    {
        "id": 480,
        "type": "true/false",
        "prompt": "تساهم المناطق الجبلية في قارة إفريقيا في دعم نشاط التعدين والصناعة لأنها غنية بالثروات المعدنية كالحديد والذهب.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 481,
        "type": "multiple choice",
        "prompt": "السهول التي كونتها الأنهار عن طريق ترسيب المواد العالقة بمياهها تُعرف في الجغرافيا بالسهول:",
        "options": ["الساحلية", "الفيضية", "الصحراوية", "البركانية"],
        "answer": "الفيضية"
    },
    {
        "id": 482,
        "type": "true/false",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال أطلس من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 483,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي باتساعها الواضح في دولة تنزانيا بينما تضيق في دولة:",
        "options": ["مصر", "كينيا", "السودان", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 484,
        "type": "true/false",
        "prompt": "تعد سهول المحيط الأطلنطي في غرب القارة الإفريقية سهولاً واسعة وغنية بحقولها الزراعية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 485,
        "type": "multiple choice",
        "prompt": "أكبر جزر القارة الإفريقية مساحة وتقع في مياه المحيط الهندي هي جزيرة:",
        "options": ["جزر القمر", "مدغشقر", "سيشل", "موريشيوس"],
        "answer": "مدغشقر"
    },
    {
        "id": 486,
        "type": "true/false",
        "prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية مضيق موزمبيق المائي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 487,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو حوض:",
        "options": ["نهر النيجر", "نهر الكونغو", "نهر النيل", "نهر السنغال"],
        "answer": "نهر النيل"
    },
    {
        "id": 488,
        "type": "true/false",
        "prompt": "يمتد مجرى نهر النيل وروافده داخل أراضي إحدى عشرة دولة إفريقية ويُصنف كأحد الأنهار الدولية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 489,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي أنشئ عام 1983م باقتراح مصري للتشاور والتنسيق ودعم التعاون بين دول حوض النيل:",
        "options": ["الاتحاد الإفريقي", "تجمع الأندوجو", "تجمع الكوميسا", "منظمة سيا المائية"],
        "answer": "تجمع الأندوجو"
    },
    {
        "id": 490,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في أصلها اللغوي السواحلي مفهوم 'الإخاء'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 491,
        "type": "multiple choice",
        "prompt": "تقع منابع نهر النيل الدائمة (الاستوائية) في نطاق تضاريس هضبة:",
        "options": ["هضبة الحبشة", "هضبة شمال إفريقيا", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "هضبة البحيرات الاستوائية"
    },
    {
        "id": 492,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية بسقوط الأمطار الغزيرة عليها طوال العام بسبب موقعها الفلكي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 493,
        "type": "multiple choice",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعد مصدراً للمنابع:",
        "options": ["الموسمية", "الدائمة", "المؤقتة", "البركانية"],
"answer": "الدائمة"
},
{
"id": 494,
"type": "true/false",
"prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بمياه عذبة فيسترد النيل قوته الجارية شمالاً.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 495,
"type": "multiple choice",
"prompt": "من الروافد الموسمية التي تمد النيل بمياهه وتساعده على الجريان نحو الشمال نهر عطبرة ونهر:",
"options": ["نهر كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 496,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا لدعم التنمية المستدامة المائية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 497,
"type": "multiple choice",
"prompt": "من جهود مصر المائية الموثقة في المنهج لخدمة دول حوض النيل إنشاء سد أوين في دولة:",
"options": ["السودان", "كينيا", "أوغندا", "تنزانيا"],
"answer": "أوغندا"
},
{
"id": 498,
"type": "true/false",
"prompt": "ساهمت مصر في إنشاء وتأسيس خزان سنار على مجرى النيل الأبيض بدولة السودان.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 499,
"type": "multiple choice",
"prompt": "الاتفاقية الإقليمية الموقعة عام 1929م نصت على عدم قيام دول حوض النيل بأي مشروعات دون اتفاق مسبق مع:",
"options": ["إثيوبيا", "السودان", "مصر", "أوغندا"],
"answer": "مصر"
},
{
"id": 500,
"type": "true/false",
"prompt": "اتفقت مصر وإثيوبيا والسودان في اتفاقية عام 2015م على مبادئ التعاون والتنمية وعدم التسبب في ضرر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 501,
"type": "multiple choice",
"prompt": "حرص المصريون القدماء على توطيد العلاقات التجارية مع الحضارات الإفريقية المجاورة مثل حضارة كوش وبلاد:",
"options": ["قرطاج", "أكسوم", "بونت", "أوروبا"],
"answer": "بونت"
},
{
"id": 502,
"type": "true/false",
"prompt": "تضم قارة إفريقيا وفقاً للحصر السياسي للمنهج عشر دول عربية مختلفة المساحة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 503,
"type": "multiple choice",
"prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية دولة النيجر ودولة:",
"options": ["الصومال", "المغرب", "تشاد", "مصر"],
"answer": "تشاد"
},
{
"id": 504,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في القارة وتدعيم علاقاتها.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
 "id": 505,
        "type": "multiple choice",
        "prompt": "تمثل مساحة قارة إفريقيا من المساحة الإجمالية لقارات العالم نسبة محددة تبلغ:",
        "options": ["10%", "15%", "20%", "25%"],
        "answer": "20%"
    },
    {
        "id": 506,
        "type": "true/false",
        "prompt": "تعد قارة إفريقيا ثاني أكبر قارات العالم من حيث المساحة بعد قارة آسيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 507,
        "type": "multiple choice",
        "prompt": "المسطح المائي الذي يحد قارة إفريقيا من جهة الشمال ويفصلها جغرافياً عن قارة أوروبا هو:",
        "options": ["البحر الأحمر", "البحر المتوسط", "المحيط الأطلنطي", "المحيط الهندي"],
        "answer": "البحر المتوسط"
    },
    {
        "id": 508,
        "type": "true/false",
        "prompt": "تقترب قارة إفريقيا من قارة أوروبا بشكل مباشر عند مضيق باب المندب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 509,
        "type": "multiple choice",
        "prompt": "تقترب قارة إفريقيا من قارة آسيا عند ممر مائي استراتيجي مهم هو مضيق:",
        "options": ["جبل طارق", "هرمز", "باب المندب", "موزمبيق"],
        "answer": "باب المندب"
    },
    {
        "id": 510,
        "type": "true/false",
        "prompt": "تتصل قارة إفريقيا بقارة آسيا جغرافياً عن طريق مضيق جبل طارق.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 511,
        "type": "multiple choice",
        "prompt": "الممر الجغرافي الأرضي الذي يربط بين يابس قارة إفريقيا ويابس قارة آسيا هو:",
        "options": ["مضيق جبل طارق", "شبه جزيرة سيناء", "مضيق باب المندب", "قناة السويس"],
        "answer": "شبه جزيرة سيناء"
    },
    {
        "id": 512,
        "type": "true/false",
        "prompt": "يُقصد بالموقع الفلكي في المنهج الجغرافي موقع المكان بالنسبة لدوائر العرض وخطوط الطول.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 513,
        "type": "multiple choice",
        "prompt": "يمر في الجزء الأوسط تقريباً من قارة إفريقيا أحد دوائر العرض الرئيسية وهي:",
        "options": ["مدار السرطان", "مدار الجدي", "دائرة الاستواء", "الدائرة القطبية"],
        "answer": "دائرة الاستواء"
    },
    {
        "id": 514,
        "type": "true/false",
        "prompt": "يمر مدار الجدي في الجزء الشمالي من قارة إفريقيا بينما يمر مدار السرطان في الجزء الجنوبي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 515,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُعبر عن (الأهمية وقت الحروب والأزمات والسلم) هو الأهمية:",
        "options": ["الحضارية", "الاقتصادية", "الاستراتيجية", "الفلكية"],
        "answer": "الاستراتيجية"
    },
    {
        "id": 516,
        "type": "true/false",
        "prompt": "أدى الموقع الفلكي المتميز لقارة إفريقيا بشكل مباشر إلى تنوع المناخ والنباتات الطبيعية والحيوانات.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 517,
        "type": "multiple choice",
        "prompt": "مجموع الإنتاج الثقافي والمادي الذي يميز مجتمعاً عن غيره يُعرف في متن الدرس بـ:",
        "options": ["الأهمية الاقتصادية", "الحضارة", "الكشوف الجغرافية", "الموقع الجغرافي"],
        "answer": "الحضارة"
    },
    {
        "id": 518,
        "type": "true/false",
        "prompt": "نشأت الحضارة المصرية القديمة على ضفاف نهر النيل في شمال شرق قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 519,
        "type": "multiple choice",
        "prompt": "من أقدم الحضارات التي نشأت في قارة إفريقيا وقامت تاريخياً على أرض دولة تونس الحالية حضارة:",
        "options": ["كوش", "أكسوم", "قرطاج", "المصرية القديمة"],
        "answer": "قرطاج"
    },
    {
        "id": 520,
        "type": "true/false",
        "prompt": "شهدت شبه جزيرة سيناء عبر العصور التاريخية انتقال بعض الثقافات والحضارات من إفريقيا إلى آسيا مثل الحضارة الإسلامية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 521,
        "type": "multiple choice",
        "prompt": "من أوائل المصريين القدماء في عصر الأسرتين الخامسة والسادسة الذين قاموا بأربع رحلات نحو الجنوب واكتشفوا أجزاء من إفريقيا:",
        "options": ["الملك نخاو الثاني", "الرحالة حرخوف", "محمد علي باشا", "الخديو إسماعيل"],
        "answer": "الرحالة حرخوف"
    },
    {
        "id": 522,
        "type": "true/false",
        "prompt": "أرسل الملك المصري نخاو الثاني بعثة تاريخية من البحارة الفينيقيين للدوران حول إفريقيا استمرت ثلاث سنوات.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 523,
        "type": "multiple choice",
        "prompt": "بدأت رحلة الدوران حول إفريقيا التي أرسلها الملك نخاو الثاني من مياه:",
        "options": ["البحر المتوسط", "البحر الأحمر", "مضيق جبل طارق", "المحيط الأطلنطي"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 524,
        "type": "true/false",
        "prompt": "عادت بعثة الملك نخاو الثاني الاستكشافية إلى مصر عبر مضيق باب المندب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 525,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات استكشافية عام 1839م أدت تاريخياً لاكتشاف النيل:",
        "options": ["الأزرق", "عطبرة", "الأبيض", "الفيضي"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 526,
        "type": "true/false",
        "prompt": "نجح الخديو إسماعيل في رسم خريطة تفصيلية لنهر النيل وصلت حتى حدود جنوب السودان.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 527,
        "type": "multiple choice",
        "prompt": "وصل حكم المد المصري والسيطرة الجغرافية في عهد الخديو إسماعيل إلى منطقة تقع في:",
        "options": ["شمال مدار السرطان", "جنوب دائرة الاستواء", "شرق البحر الأحمر", "غرب خط جرينتش"],
        "answer": "جنوب دائرة الاستواء"
    },
    {
        "id": 528,
        "type": "true/false",
        "prompt": "يُعد الجغرافي والرحالة العربي المسعودي من أوائل العرب الذين زاروا إفريقيا وكتبوا عنها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 529,
        "type": "multiple choice",
        "prompt": "الرحالة العربي الشهير الذي قام برحلات في شمال وغرب إفريقيا واخترق الصحراء الكبرى حتى وصل لمالي هو:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "الإدريسي"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 530,
        "type": "true/false",
        "prompt": "تعددت الممالك الإسلامية التاريخية في قارة إفريقيا على السواحل الغربية وامتدت إلى هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 531,
        "type": "multiple choice",
        "prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا والدوران حولها في القرن الخامس عشر الميلادي خلال عهد الأمير:",
        "options": ["فاسكو دي جاما", "بارتولوميو دياس", "هنري الملاح", "جون سبيك"],
        "answer": "هنري الملاح"
    },
    {
        "id": 532,
        "type": "true/false",
        "prompt": "أسس البرتغاليون الموانئ والمراكز التجارية على طول طريق رأس الرجاء الصالح بهدف تأمين الملاحة والتجارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 533,
        "type": "multiple choice",
        "prompt": "توالت الكشوف الأوروبية على إفريقيا في نهاية القرن 18م وخلال القرن 19م من دول عدة ليس من بينها:",
        "options": ["الفرنسيين", "الإنجليز", "الهولنديين", "الفينيقيين"],
        "answer": "الفينيقيين"
    },
    {
        "id": 534,
        "type": "true/false",
        "prompt": "تسبب تصارع الدول الاستعمارية على إفريقيا لنهب خيراتها في تقسيمها إلى 54 دولة مختلفة المساحة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 535,
        "type": "multiple choice",
        "prompt": "تُصنف دولة الجزائر بأنها:",
        "options": ["أصغر دول القارة مساحة", "أكبر دول القارة مساحة", "إحدى الدول الحبيسة", "دولة تقع في جنوب القارة"],
        "answer": "أكبر دول القارة مساحة"
    },
    {
        "id": 536,
        "type": "true/false",
        "prompt": "الدول الساحلية في قارة إفريقيا هي الدول التي تطل مباشرة على مسطحات مائية مثل الصومال والمغرب ومصر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 537,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية دولة:",
        "options": ["الصومال", "تشاد", "المغرب", "مصر"],
        "answer": "تشاد"
    },
    {
        "id": 538,
        "type": "true/false",
        "prompt": "يبلغ عدد الدول العربية الواقعة داخل قارة إفريقيا 12 دولة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 539,
        "type": "multiple choice",
        "prompt": "تم انتخاب جمهورية مصر العربية لرئاسة الاتحاد الإفريقي مما ساهم في تعميق دورها الريادي وكان ذلك عام:",
        "options": ["2011م", "2015م", "2019م", "2026م"],
        "answer": "2019م"
    },
    {
        "id": 540,
        "type": "true/false",
        "prompt": "يتكون أغلب سطح قارة إفريقيا من مظاهر تضاريسية واسعة وعظيمة هي السهول الفيضية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 541,
        "type": "multiple choice",
        "prompt": "تتميز هضبة شمال إفريقيا التضاريسية بأنها عظيمة الاتساع وقليلة الارتفاع وتنحدر تدريجياً نحو:",
        "options": ["الجنوب", "الشرق", "الشمال", "الغرب"],
        "answer": "الشمال"
    },
    {
        "id": 542,
        "type": "true/false",
        "prompt": "من مظاهر السطح المنتشرة فوق هضبة شمال إفريقيا منخفض القطارة في مصر واحة الجوف في ليبيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 543,
        "type": "multiple choice",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة مباشرة بين مصر ودولتي:",
"options": ["ليبيا وتونس", "السودان وتشاد", "ليبيا والسودان", "الجزائر والمغرب"],
"answer": "ليبيا والسودان"
},
{
"id": 544,
"type": "true/false",
"prompt": "تعد هضبة الحبشة (الهضبة الإثيوبية) أعلى هضاب القارة الإفريقية وتوجد في الجزء الشرقي منها.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 545,
"type": "multiple choice",
"prompt": "تمر دائرة الاستواء الرئيسية في وسط القارة الإفريقية تقريباً وتقطع هضبة:",
"options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "البحيرات الاستوائية"
},
{
"id": 546,
"type": "true/false",
"prompt": "تتميز هضبة البحيرات الاستوائية بكثرة البحيرات العذبة فوق سطحها ومن أهمها بحيرة فيكتوريا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 547,
"type": "multiple choice",
"prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد بجزئها الشرقي الأخدود الإفريقي العظيم هي:",
"options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "الهضبة الجنوبية"
},
{
"id": 548,
"type": "true/false",
"prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 549,
"type": "multiple choice",
"prompt": "تُصنف السلاسل المتوازية لجبال أطلس (أطلس التل وأطلس الصحراء) في شمال غرب القارة على أنها جبال:",
"options": ["انكسارية", "التوائية", "بركانية", "تصدعية"],
"answer": "التوائية"
},
{
"id": 550,
"type": "true/false",
"prompt": "تحصر سلاسل جبال أطلس المتوازية بينهما ظاهرة تضاريسية هامة هي هضبة الشطوط في دولة الجزائر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 551,
"type": "multiple choice",
"prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية وتوجد داخل حدود مصر هي جبل:",
"options": ["توبقال", "شايب البنات", "كينيا", "كلمنجارو"],
"answer": "شايب البنات"
},
{
"id": 552,
"type": "true/false",
"prompt": "تتميز جبال كينيا وجبل كلمنجارو في وسط إفريقيا بأنها جبال بركانية تكونت نتيجة الثورانات البركانية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 553,
"type": "multiple choice",
"prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة نتيجة لـ:",
"options": ["موقعه الفلكي القطبي", "شدة ارتفاعه وعلو قمته", "قربه من المحيط الهندي", "تأثير الرياح التجارية"],
"answer": "شدة ارتفاعه وعلو قمته"
},
{
"id": 554,
"type": "true/false",
"prompt": "تساهم المناطق الجبلية في إفريقيا في دعم الأنشطة الاقتصادية حيث تعد غنية بالثروات المعدنية المتنوعة التي تدخل في الصناعة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 555,
        "type": "multiple choice",
        "prompt": "ساعد جريان العديد من الأنهار في قارة إفريقيا على تكوين السهول:",
        "options": ["الساحلية", "الفيضية", "الصحراوية", "البركانية"],
        "answer": "الفيضية"
    },
    {
        "id": 556,
        "type": "true/false",
        "prompt": "تتميز السهول الفيضية في قارة إفريقيا بأنها تربة خصبة وصالحة تماماً لحرفة الزراعة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 558,
        "type": "true/false",
        "prompt": "تتميز سهول وادي النيل في مصر والسودان بخصوبة تربتها بسبب تكونها من الطمي المنقول من هضبة شمال إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 559,
        "type": "multiple choice",
        "prompt": "تتميز سهول وادي النيل بخصوبة تربتها بسبب تكونها من الطمي المنقول مباشرة من تضاريس هضبة:",
        "options": ["شمال إفريقيا", "البحيرات الاستوائية", "الحبشة", "الهضبة الجنوبية"],
        "answer": "هضبة الحبشة"
    },
    {
        "id": 560,
        "type": "true/false",
        "prompt": "تتسع السهول الساحلية للبحر المتوسط في شمال مصر وتتميز بوجود نباتات طبيعية ومحاصيل تعتمد على الأمطار الشتوية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 561,
        "type": "multiple choice",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "الكاب", "أطلس", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 562,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان وإريتريا بالاتساع الكبير جداً.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 563,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر بأنها ضيقة وغنية بمصادر الطاقة و:",
        "options": ["التربة الطمية الخصبة", "الثروات المعدنية", "المحاصيل الشتوية الكثيفة", "الغابات المدارية الكبرى"],
        "answer": "الثروات المعدنية"
    },
    {
        "id": 564,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي بالاتساع الواضح في دولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 565,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي في دولة كينيا بأنها عبارة عن شريط ضيق ينحصر بين الساحل وهضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 566,
        "type": "true/false",
        "prompt": "تعد سهول المحيط الأطلنطي في غرب القارة الإفريقية سهولاً واسعة وغنية بحقولها الزراعية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 567,
        "type": "multiple choice",
        "prompt": "أكبر جزر القارة الإفريقية وتقع في مياه المحيط الهندي هي جزيرة:",
        "options": ["جزر القمر", "مدغشقر", "سيشل", "موريشيوس"],
        "answer": "مدغشقر"
    },
    {
        "id": 568,
        "type": "true/false",
        "prompt": "يفصل جزيرة مدغشقر عن الساحل الشرقي للقارة الإفريقية مضيق جبل طارق المائي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 569,
        "type": "multiple choice",
        "prompt": "من الجزر الإفريقية التي تقع في المحيط الهندي وتتميز بأنها تقع شمال غرب جزيرة مدغشقر جزر:",
        "options": ["سيشل", "القمر", "موريشيوس", "زنجبار"],
        "answer": "القمر"
    },
    {
        "id": 570,
        "type": "true/false",
        "prompt": "تُصنف جزر القمر كدولة عربية إفريقية وتقع بالكامل في مياه المحيط الهندي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 571,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيجر وروافده) هو حوض:",
        "options": ["نهر النيجر", "نهر الكونغو", "نهر النيل", "نهر السنغال"],
        "answer": "نهر النيجر"
    },
    {
        "id": 572,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية نحو 20% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 573,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 574,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان وهما من الدول العربية الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 575,
        "type": "multiple choice",
        "prompt": "من دول حوض نهر النيل الإحدى عشرة والمصنفة ضمن دول شرق ووسط إفريقيا دولة جمهورية الكونغو الديمقراطية و دولة:",
        "options": ["الجزائر", "أوغندا", "المغرب", "تونس"],
        "answer": "أوغندا"
    },
    {
        "id": 576,
        "type": "true/false",
        "prompt": "اقترحت جمهورية مصر العربية على دول الحوض إنشاء تجمع إقليمي عام 1983م أطلق عليه اسم تجمع الأندوجو.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 577,
        "type": "multiple choice",
        "prompt": "يهدف تجمع الأندوجو الإقليمي الذي يضم دول حوض نهر النيل بشكل أساسي إلى التشاور والتنسيق و:",
        "options": ["دعم التعاون والحفاظ على المصالح المشتركة", "تقسيم مياه النهر بالتساوي الفوري", "منع الدول من إقامة مشروعات محلية", "توحيد الحدود السياسية للدول"],
        "answer": "دعم التعاون والحفاظ على المصالح المشتركة"
    },
    {
        "id": 578,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'التصارع والحروب'.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 579,
        "type": "multiple choice",
        "prompt": "النهر الذي يمتد مجراه وروافده بالكامل داخل حدود دولة واحدة ولا يشترك مع غيرها يُعرف بالنهر المحلي، أما نهر النيل فيُعرف بـ:",
        "options": ["النهر الإقليمي", "النهر القاري", "النهر الدولي", "النهر الساحلي"],
        "answer": "النهر الدولي"
    },
    {
        "id": 580,
        "type": "true/false",
        "prompt": "أكد الجغرافي جمال حمدان في كتاباته أن نهر النيل يتميز بأنه ثنائي المنبع مما أدى لاستدامته ووصوله إلى مصر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 581,
        "type": "multiple choice",
        "prompt": "تنقسم منابع نهر النيل الرئيسية إلى قسمين هما منابع دائمة (استوائية) ومنابع موسمية تقع في هضبة:",
        "options": ["شمال إفريقيا", "الحبشة (الإثيوبية)", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الحبشة (الإثيوبية)"
    },
    {
        "id": 582,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الدائمة (الاستوائية) بسقوط الأمطار طوال العام بسبب موقعها الفلكي ووقوعها عند دائرة الاستواء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 583,
        "type": "multiple choice",
        "prompt": "تتميز منابع نهر النيل الموسمية (الإثيوبية) بسقوط الأمطار الغزيرة في فصل محدد من العام هو فصل:",
        "options": ["الشتاء", "الربيع", "الصيف", "الخريف"],
        "answer": "الصيف"
    },
    {
        "id": 584,
        "type": "true/false",
        "prompt": "بالرغم من تدفق مياه المنابع الدائمة طوال العام، فإنه يصل منها كميات كبيرة جداً إلى مصر دون أدنى فاقد مائي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 585,
        "type": "multiple choice",
        "prompt": "يرجع السبب الرئيسي وراء وصول كميات قليلة فقط من مياه المنابع الدائمة إلى مصر إلى وجود المستنقعات و:",
        "options": ["الانحدار نحو الجنوب", "زيادة معدلات البخر", "كثرة الثورانات البركانية", "الحركات الالتوائية للصخور"],
        "answer": "زيادة معدلات البخر"
    },
    {
        "id": 586,
        "type": "true/false",
        "prompt": "تضم المنابع الدائمة لنهر النيل مجموعة من البحيرات العذبة أهمها بحيرة فيكتوريا التي تعد ثاني أكبر البحيرات الطبيعية العذبة في العالم.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 587,
        "type": "multiple choice",
        "prompt": "من أهم مصادر التغذية المائية لبحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب وهو نهر:",
        "options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
        "answer": "كاجيرا"
    },
    {
        "id": 588,
        "type": "true/false",
        "prompt": "تميز نهر السوباط بأنه يلتقي بمجرى بحر الجبل ويمده بالمياه العذبة فيسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 589,
        "type": "multiple choice",
        "prompt": "تتضمن المنابع الموسمية الإثيوبية مجموعة من الروافد المهمة التي تمد النيل بمياهه وتساعده على الجريان شمالاً مثل نهر عطبرة و:",
        "options": ["نهر كاجيرا", "نهر الكونغو", "النيل الأزرق", "نهر السنغال"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 590,
        "type": "true/false",
        "prompt": "ينتهي المجرى الطولي لنهر النيل الدولي ويصب مياهه العذبة في جهة الشمال داخل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 591,
        "type": "multiple choice",
        "prompt": "من الجهود المائية لمصر لخدمة دول حوض النيل قيامها بحفر عشرات الآبار لتوفير مياه نقية في دولة:",
        "options": ["كينيا", "السودان", "تنزانيا", "أوغندا"],
        "answer": "كينيا"
    },
    {
        "id": 592,
        "type": "true/false",
"prompt": "قامت مصر بالمساهمة في بناء وتشييد خزان سنار الواقع على النيل الأزرق لتوفير الطاقة لجمهورية السودان.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 593,
"type": "multiple choice",
"prompt": "قامت مصر بدفع وتكفل كامل تكاليف بناء وتشييد خزان مائي لتوليد الطاقة الكهربائية بالسودان هو خزان:",
"options": ["سد أوين", "خزان سنار", "جبل الأولياء", "السد العالي"],
"answer": "جبل الأولياء"
},
{
"id": 594,
"type": "true/false",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في تأسيسه وإنشائه بدولة أوغندا هو سد أوين الشهير.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 595,
"type": "multiple choice",
"prompt": "ساهمت جمهورية مصر العربية في تطهير مجاري دول الحوض من الحشائش والنباتات المائية الضارة في بحيرتي كيوجا و:",
"options": ["تانا", "فيكتوريا", "ألبرت", "إدوارد"],
"answer": "فيكتوريا"
},
{
"id": 596,
"type": "true/false",
"prompt": "من المشروعات المستدامة المائية لمصر في دولة تنزانيا تأسيس وإنشاء مركز متطور للبحوث المائية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 597,
"type": "multiple choice",
"prompt": "وضعت منظمة الأمم المتحدة اتفاقية قانون تنظيم استخدام المجاري المائية في الأغراض غير الملاحية وهي اتفاقية:",
"options": ["دولية", "إقليمية", "ثنائية", "محلية"],
"answer": "دولية"
},
{
"id": 598,
"type": "true/false",
"prompt": "تستهدف اتفاقية الأمم المتحدة تنظيم استخدام مياه الأنهار الدولية وحمايتها وتحقيق الانتفاع الأمثل والمستدام للأجيال.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 599,
"type": "multiple choice",
"prompt": "الاتفاقية الإقليمية الموقعة عام 1929م نصت على التزام دول حوض النيل بعدم القيام بأي مشروعات بغير اتفاق مسبق مع:",
"options": ["إثيوبيا", "السودان", "مصر", "أوغندا"],
"answer": "مصر"
},
{
"id": 600,
"type": "true/false",
"prompt": "اتفقت مصر وإثيوبيا والسودان في اتفاقية المبادئ عام 2015م على مبدأ التعاون والتنمية وعدم التسبب في ضرر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 601,
"type": "multiple choice",
"prompt": "أقام المصريون القدماء حضارتهم العريقة المستقرة تاريخياً منذ آلاف السنين على ضفاف:",
"options": ["البحر الأحمر", "البحر المتوسط", "نهر النيل", "الأخدود الإفريقي"],
"answer": "نهر النيل"
},
{
"id": 602,
"type": "true/false",
"prompt": "عرف المصري القديم على ضفاف النيل حرفة الزراعة واستأنس الحيوانات مما ساعده على التوحيد وتكوين الأسرات.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 603,
"type": "multiple choice",
"prompt": "حرص المصريون القدماء عبر العصور على توطيد علاقاتهم التجارية القوية مع جيرانهم في القارة مثل حضارة كوش وبلاد:",
"options": ["قرطاج", "جنوب افريقيا", "بونت", "أوروبا الساحلية"],
"answer": "بونت"
},
{
"id": 604,
"type": "true/false",
"prompt": "أثرت الحضارة المصرية القديمة بشكل متبادل على بعض الحضارات الإفريقية وتركت تراثاً مادياً وثقافياً عظيماً.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 605,
        "type": "multiple choice",
        "prompt": "تبلغ المساحة الإجمالية لقارة إفريقيا :",
        "options": ["20 مليون كم٢", "30.4 مليون كم٢", "44 مليون كم٢", "54 مليون كم٢"],
        "answer": "30.4 million km²"
    },
    {
        "id": 606,
        "type": "true/false",
        "prompt": "تقع قارة إفريقيا في قارات العالم الجديد وتتسم بموقع جغرافي متميز.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 607,
        "type": "multiple choice",
        "prompt": "الموقع الفلكي لمكان ما يُقصد به في المنهج الجغرافي موقع هذا المكان بالنسبة لـ:",
        "options": ["البحار والمحيطات المجاورة", "الدول والحدود السياسية", "دوائر العرض وخطوط الطول", "الممرات والمضايق الاستراتيجية"],
        "answer": "دوائر العرض وخطوط الطول"
    },
    {
        "id": 608,
        "type": "true/false",
        "prompt": "يمر خط الطول الرئيسي (خط جرينتش) في الأجزاء الغربية من القارة الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 609,
        "type": "multiple choice",
        "prompt": "تمتد قارة إفريقيا فلكياً عبر عدد من دوائر العرض يبلغ إجمالاً حوالي:",
        "options": ["51 دائرة عرضية", "68 دائرة عرضية", "70 دائرة عرضية", "72 دائرة عرضية"],
        "answer": "70 دائرة عرضية"
    },
    {
        "id": 610,
        "type": "true/false",
        "prompt": "يمر مدار السرطان في الجزء الأوسط تقريباً من قارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 611,
        "type": "multiple choice",
        "prompt": "دائرة العرض الرئيسية التي تمر في الجزء الجنوبي من قارة إفريقيا هي:",
        "options": ["مدار السرطان", "دائرة الاستواء", "مدار الجدي", "الدائرة القطبية الجنوبية"],
        "answer": "مدار الجدي"
    },
    {
        "id": 612,
        "type": "true/false",
        "prompt": "يقع نحو ثلثي مساحة قارة إفريقيا في نصف الكرة الأرضية الشمالي والثلث الآخر في النصف الجنوبي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 613,
        "type": "multiple choice",
        "prompt": "المصطلح الذي يُطلق على (الأهمية وقت الحروب والأزمات والسلم) هو الأهمية:",
        "options": ["الحضارية", "الاقتصادية", "الاستراتيجية", "الفلكية"],
        "answer": "الاستراتيجية"
    },
    {
        "id": 614,
        "type": "true/false",
        "prompt": "أدى الموقع الجغرافي لقارة إفريقيا وتحكمها في الممرات المائية إلى تنوع مناخها بشكل مباشر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 615,
        "type": "multiple choice",
        "prompt": "أدى الموقع الفلكي لقارة إفريقيا وامتدادها الواسع بين دوائر العرض إلى تنوع:",
        "options": ["الممرات الاستراتيجية", "المناخ والنبات والحيوان", "طرق الملاحة العالمية", "الحدود السياسية للدول"],
        "answer": "المناخ والنبات والحيوان"
    },
    {
        "id": 616,
        "type": "true/false",
        "prompt": "تُعرف الحضارة بأنها مجموع الإنتاج الثقافي والمادي الذي يميز مجتمعاً عن غيره.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 617,
        "type": "multiple choice",
        "prompt": "من أقدم الحضارات في العالم والتي نشأت تاريخياً على أرض دولة السودان حضارة:",
        "options": ["قرطاج", "أكسوم", "كوش", "المصرية القديمة"],
        "answer": "كوش"
    },
    {
        "id": 618,
        "type": "true/false",
        "prompt": "انتقلت الثقافة والحضارة الإسلامية من آسيا إلى إفريقيا عبر ممر مضيق جبل طارق المائي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 619,
        "type": "multiple choice",
        "prompt": "تعد شبه جزيرة سيناء ذات أهمية استراتيجية كبيرة لمصر وإفريقيا لأن مصر تعرضت من خلالها للعديد من:",
        "options": ["الرحلات التجارية الفينيقية", "الحملات العسكرية عبر العصور", "الطفوح البركانية القديمة", "الممالك الإسلامية الغربية"],
        "answer": "الحملات العسكرية عبر العصور"
    },
    {
        "id": 620,
        "type": "true/false",
        "prompt": "قام الرحالة المصري القديم حرخوف بأربع رحلات استكشافية متجهاً نحو جهة الجنوب.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 621,
        "type": "multiple choice",
        "prompt": "أرسل الملك المصري نخاو الثاني بعثة للدوران حول إفريقيا استمرت ثلاث سنوات، واستعان ببحارة من:",
        "options": ["العرب", "الفينيقيين", "البرتغاليين", "الفرنسيين"],
        "answer": "الفينيقيين"
    },
    {
        "id": 622,
        "type": "true/false",
        "prompt": "بدأت بعثة الملك نخاو الثاني للدوران حول إفريقيا من البحر الأحمر وعادت إلى مصر عبر مضيق جبل طارق.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 623,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات استكشافية عام 1839م أدت إلى اكتشاف النيل:",
        "options": ["الأزرق", "الأبيض", "المباركي", "الفيضي"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 624,
        "type": "true/false",
        "prompt": "نجح محمد علي باشا في رسم خريطة لنهر النيل وصلت حدودها الاستكشافية حتى جنوب السودان.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 625,
        "type": "multiple choice",
        "prompt": "اهتم الخديو إسماعيل حفيد محمد علي باشا بالكشوف الجغرافية لمنابع النيل، ووصل حكمه إلى جنوب:",
        "options": ["مدار السرطان", "مدار الجدي", "دائرة الاستواء", "خط جرينتش"],
        "answer": "دائرة الاستواء"
    },
    {
        "id": 626,
        "type": "true/false",
        "prompt": "يُعد الجغرافي والرحالة العربي المسعودي من أوائل الرحالة العرب الذين زاروا إفريقيا وكتبوا عنها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 627,
        "type": "multiple choice",
        "prompt": "الرحالة العربي الذي قام برحلات في شمال وغرب إفريقيا واخترق الصحراء الكبرى حتى وصل لمالي هو:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "ابن سينا"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 628,
        "type": "true/false",
        "prompt": "تعددت الممالك الإسلامية التاريخية في قارة إفريقيا على السواحل الغربية وامتدت إلى هضبة البحيرات الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 629,
        "type": "multiple choice",
        "prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا في القرن الخامس عشر الميلادي خلال عهد الأمير:",
        "options": ["فاسكو دي جاما", "بارتولوميو دياس", "هنري الملاح", "جون سبيك"],
        "answer": "هنري الملاح"
    },
    {
        "id": 630,
        "type": "true/false",
        "prompt": "أسس البرتغاليون الموانئ والمراكز التجارية على طول طريق رأس الرجاء الصالح بهدف تأمين الملاحة والتجارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 631,
        "type": "multiple choice",
        "prompt": "تصارعت الدول الاستعمارية الأوروبية على إفريقيا لنهب خيراتها واستغلال ثرواتها، مما نتج عنه تقسيمها لـ:",
        "options": ["22 دولة", "44 دولة", "54 دولة", "64 دولة"],
        "answer": "54 دولة"
    },
    {
        "id": 632,
        "type": "true/false",
        "prompt": "تسبب الاستعمار الأوروبي وتقسيم إفريقيا في جعلها تعاني من الفقر رغم ما تملكه من ثروات طبيعية متعددة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 633,
        "type": "multiple choice",
        "prompt": "تُصنف دولة الجزائر وفقاً بأنها:",
        "options": ["أصغر دول القارة مساحة", "أكبر دول القارة مساحة", "إحدى الدول الحبيسة", "دولة تقع في جنوب القارة"],
        "answer": "أكبر دول القارة مساحة"
    },
    {
        "id": 634,
        "type": "true/false",
        "prompt": "الدول الساحلية في قارة إفريقيا هي الدول التي لا تطل على مسطحات مائية مثل تشاد والنيجر ومالي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 635,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الحبيسة (التي لا تطل على مسطحات مائية) دولة:",
        "options": ["الصومال", "النيجر", "المغرب", "مصر"],
        "answer": "النيجر"
    },
    {
        "id": 636,
        "type": "true/false",
        "prompt": "يبلغ عدد الدول العربية الواقعة داخل قارة إفريقيا  10 دول.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 637,
        "type": "multiple choice",
        "prompt": "تم انتخاب جمهورية مصر العربية لرئاسة الاتحاد الإفريقي عام 2019م، مما أدى مباشرة إلى وجود فرصة لـ:",
        "options": ["تغيير الحدود السياسية للقارة", "تعميق دور مصر الريادي وتدعيم علاقاتها بدول وشعوب القارة", "تقسيم القارة لعدد أكبر من الدول الحبيسة", "إلغاء الاتفاقيات المائية التاريخية"],
        "answer": "تعميق دور مصر الريادي وتدعيم علاقاتها بدول وشعوب القارة"
    },
    {
        "id": 638,
        "type": "true/false",
        "prompt": "يتكون أغلب سطح قارة إفريقيا من مظاهر تضاريسية واسعة وعظيمة هي الهضاب الواسعة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 639,
        "type": "multiple choice",
        "prompt": "تتميز هضبة شمال إفريقيا التضاريسية بأنها عظيمة الاتساع وقليلة الارتفاع وتنحدر تدريجياً نحو:",
        "options": ["الجنوب", "الشرق", "الشمال", "الغرب"],
        "answer": "الشمال"
    },
    {
        "id": 640,
        "type": "true/false",
        "prompt": "من مظاهر السطح التضاريسية المنتشرة فوق هضبة شمال إفريقيا جبل العوينات ومنخفض القطارة وواحة سيوة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 641,
        "type": "multiple choice",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة مباشرة بين مصر ودولتي:",
        "options": ["ليبيا وتونس", "السودان وتشاد", "ليبيا والسودان", "الجزائر والمغرب"],
        "answer": "ليبيا والسودان"
    },
    {
        "id": 642,
        "type": "true/false",
"prompt": "تعد هضبة الحبشة (الهضبة الإثيوبية) أعلى هضاب القارة الإفريقية وتوجد في الجزء الشرقي منها.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 643,
"type": "multiple choice",
"prompt": "السبب الرئيسي وراء خصوبة تربة هضبة الحبشة ونشأة الحضارات وحرفة الزراعة بها هو وجود:",
"options": ["المنخفضات المائية الواسعة", "الطفوح البركانية الناتجة عن الصخور المنصهرة", "الرمال الطمية للصحراء الكبرى", "الحركات الالتوائية الضعيفة"],
"answer": "الطفوح البركانية الناتجة عن الصخور المنصهرة"
},
{
"id": 644,
"type": "true/false",
"prompt": "تمر دائرة الاستواء الرئيسية في وسط القارة الإفريقية تقريباً وتقطع هضبة الحبشة.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 645,
"type": "multiple choice",
"prompt": "هضبة في وسط قارة إفريقيا تنحدر من الجنوب للشمال وتكثر بها البحيرات العذبة مثل بحيرة فيكتوريا هي:",
"options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "هضبة البحيرات الاستوائية"
},
{
"id": 646,
"type": "true/false",
"prompt": "الهضبة الجنوبية لقارة إفريقيا تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 647,
"type": "multiple choice",
"prompt": "المصطلح الجغرافي الذي يُعبر عن (مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال) هو:",
"options": ["حوض نهر النيل", "الأخدود الإفريقي العظيم", "السهول الفيضية للنيل", "سلاسل جبال أطلس المتوازية"],
"answer": "الأخدود الإفريقي العظيم"
},
{
"id": 648,
"type": "true/false",
"prompt": "تُصنف السلاسل المتوازية لجبال أطلس (أطلس التل وأطلس الصحراء) في شمال غرب القارة على أنها جبال انكسارية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 649,
"type": "multiple choice",
"prompt": "تحصر سلاسل جبال أطلس المتوازية بينهما ظاهرة تضاريسية هامة في دولة الجزائر هي هضبة:",
"options": ["شمال إفريقيا", "الحبشة", "الشطوط", "البحيرات الاستوائية"],
"answer": "الشطوط"
},
{
"id": 650,
"type": "true/false",
"prompt": "تتميز جبال البحر الأحمر الانكسارية بأنها تمتد داخل أراضي مصر والسودان ودولة إريتريا على ساحل البحر الأحمر.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 651,
"type": "multiple choice",
"prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية وتوجد داخل حدود مصر هي جبل:",
"options": ["توبقال", "شايب البنات", "كينيا", "كلمنجارو"],
"answer": "شايب البنات"
},
{
"id": 652,
"type": "true/false",
"prompt": "تعد جبال كينيا وجبل كلمنجارو في وسط إفريقيا وجبال دراكنزبرج في جنوبها من الجبال الالتوائية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 653,
"type": "multiple choice",
"prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة نتيجة لـ:",
"options": ["موقعه الفلكي القطبي البارد", "شدة ارتفاعه وعلو قمته الشاهقة", "قربه من مياه المحيط الهندي", "تأثير الرياح التجارية الجافة"],
"answer": "شدة ارتفاعه وعلو قمته الشاهقة"
},
{
"id": 654,
"type": "true/false",
"prompt": "تساهم المناطق الجبلية في إفريقيا في دعم الأنشطة الاقتصادية الهامة مثل قطاعي السياحة، والتعدين والصناعة.",
"options": ["صح", "خطأ"],
"answer": "صح"
  }
],
 "محترف": [
        {
          "id": 655,
        "type": "multiple choice",
        "prompt": "وفقاً للموقع الفلكي لقارة إفريقيا، يقطع خط الطول الرئيسي (جرينتش) هضبة رئيسية في القارة هي هضبة:",
        "options": ["الحبشة", "البحيرات الاستوائية", "شمال إفريقيا", "الهضبة الجنوبية"],
        "answer": "شمال إفريقيا"
    },
    {
        "id": 656,
        "type": "true/false",
        "prompt": "يمر خط جرينتش في النصف الغربي من قارة إفريقيا ويقطع دولة مالي الحبيسة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 657,
        "type": "multiple choice",
        "prompt": "أي من دوائر العرض الرئيسية التالية تقطع هضبة البحيرات الاستوائية مباشرة في وسط القارة؟",
        "options": ["مدار السرطان", "دائرة الاستواء", "مدار الجدي", "الدائرة القطبية الشمالية"],
        "answer": "دائرة الاستواء"
    },
    {
        "id": 658,
        "type": "true/false",
        "prompt": "يقطع مدار الجدي الأطراف الشمالية من الهضبة الجنوبية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 659,
        "type": "multiple choice",
        "prompt": "الدولة العربية الإفريقية التي يتقاطع فيها مدار السرطان مع خط جرينتش هي دولة:",
        "options": ["مصر", "ليبيا", "تونس", "الجزائر"],
        "answer": "الجزائر"
    },
    {
        "id": 660,
        "type": "true/false",
        "prompt": "تعد دولة الصومال الدولة العربية الإفريقية الوحيدة التي تمر بها دائرة الاستواء في شرق القارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 661,
        "type": "multiple choice",
        "prompt": "نشأت حضارة أكسوم القديمة في قارة إفريقيا فوق أراضي دولتي الحاضر:",
        "options": ["مصر والسودان", "تونس والجزائر", "إريتريا وإثيوبيا", "ليبيا وتشاد"],
        "answer": "إريتريا وإثيوبيا"
    },
    {
        "id": 662,
        "type": "true/false",
        "prompt": "تطابقت جبال كينيا وكلمنجارو في سبب النشأة التضاريسية، حيث تكونتا نتيجة الحركات الالتوائية الباطنية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 663,
        "type": "multiple choice",
        "prompt": "يتشابه سبب النشأة التكوينية لجبال أطلس في الشمال الغربي مع جبال الكاب في الجنوب بوصفهما جبالاً:",
        "options": ["انكسارية", "التوائية", "بركانية", "تصدعية"],
        "answer": "التوائية"
    },
    {
        "id": 664,
        "type": "true/false",
        "prompt": "تتميز جبال البحر الأحمر بأنها جبال انكسارية تمتد على ساحل البحر الأحمر في مصر والسودان وإريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 665,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلاسل جبال البحر الأحمر الانكسارية وتقع داخل حدود مصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 666,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) بينهما هضبة الشطوط بدولة الجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 667,
        "type": "multiple choice",
        "prompt": "العامل الأساسي وراء تكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة هو:",
        "options": ["الموقع الفلكي البارد", "شدة الارتفاع", "القرب من المحيط الهندي", "تأثير الرياح التجارية"],
        "answer": "شدة الارتفاع"
    },
    {
        "id": 668,
        "type": "true/false",
        "prompt": "يقع جبل العوينات كأحد مظاهر السطح على الحدود السياسية المشتركة بين مصر وليبيا والسودان.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 669,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "الجزائر", "مصر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 670,
        "type": "true/false",
        "prompt": "تقع واحة الجوف كإحدى الظاهرات التضاريسية التابعة لهضبة شمال إفريقيا داخل دولة السودان.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 671,
        "type": "multiple choice",
        "prompt": "من الواحات التضاريسية التابعة لهضبة شمال إفريقيا والتي تقع في دولة ليبيا واحة:",
        "options": ["سيوة", "القطارة", "الجوف", "عين صالح"],
        "answer": "الجوف"
    },
    {
        "id": 672,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بخصوبة تربتها نتيجة لتعرضها القديم للطفوح البركانية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 673,
        "type": "multiple choice",
        "prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 674,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 675,
        "type": "multiple choice",
        "prompt": "يُعد كل من البحر الأحمر وخليج عدن وخليج ........ من الأجزاء التابعة للأخدود الإفريقي العظيم شرق القارة:",
        "options": ["العقبة", "عمان", "غينيا", "العرب"],
        "answer": "العقبة"
    },
    {
        "id": 676,
        "type": "true/false",
        "prompt": "تنحدر هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 677,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للبحر المتوسط بضيقها الواضح في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "أطلس", "الكاب", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 678,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير والخلو من الحواجز الجبلية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 679,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة:",
        "options": ["تنزانيا", "كينيا", "مصر", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 680,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها الواضح في دولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 681,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي لإفريقيا مضيق مائي هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 682,
        "type": "true/false",
        "prompt": "تقع جزر القمر في مياه المحيط الهندي وتحديداً في جهة الشمال الغربي من جزيرة مدغشقر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 683,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد بـ (المساحة التي يجري بها نهر النيل وروافده) هو:",
        "options": ["السهل الفيضي للنيل", "المجرى الدولي للنهر", "حوض نهر النيل", "الدلتا المائية"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 684,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية حوالي 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 685,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 686,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان وهما من الدول العربية الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 687,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي أنشئ عام 1983م باقترح مصري للتشاور والتنسيق ودعم التعاون بين دول حوض النيل يُعرف باسم تجمع:",
        "options": ["الاتحاد الإفريقي", "الأندوجو", "الكوميسا", "سيا المائي"],
        "answer": "الأندوجو"
    },
    {
        "id": 688,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'الإخاء'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 689,
        "type": "multiple choice",
        "prompt": "أشار الجغرافي جمال حمدان إلى ميزة جغرافية لنهر النيل أدت لاستدامته ووصوله لمصر وهي أنه نهر:",
        "options": ["أحادي المنبع", "ثنائي المنبع", "محلي المجرى", "موسمي الفيضان"],
        "answer": "ثنائي المنبع"
    },
    {
        "id": 690,
        "type": "true/false",
        "prompt": "تعد هضبة البحيرات الاستوائية في وسط القارة هي المنبع الدائم لنهر النيل وتتميز بسقوط الأمطار طوال العام.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 691,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة (الإثيوبية) بالنسبة لمياه نهر النيل الجارية شمالاً هي المنبع:",
        "options": ["الدائم", "الموسمي", "المؤقت", "الفرعي"],
        "answer": "الموسمي"
    },
    {
        "id": 692,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية (هضبة الحبشة) بسقوط الأمطار الغزيرة في فصل الصيف.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 693,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الدائمة إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر ووجود:",
"options": ["الطفوح البركانية", "الانكسارات الطولية", "المستنقعات", "الإنحدار الشديد نحو الجنوب"],
"answer": "المستنقعات"
},
{
"id": 694,
"type": "true/false",
"prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعتبر من أهم بحيرات المنابع الدائمة الاستوائية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 695,
"type": "multiple choice",
"prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب هو نهر:",
"options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 696,
"type": "true/false",
"prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بالمياه العذبة فيسترد النيل قوته الجارية شمالاً.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 697,
"type": "multiple choice",
"prompt": "من الروافد المائية للمنابع الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
"options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 698,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا كأحد جهود التنمية المائية المستدامة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 699,
"type": "multiple choice",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
"options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
"answer": "أوين"
},
{
"id": 700,
"type": "true/false",
"prompt": "ساهمت مصر في إنشاء وتأسيس خزان سنار على مجرى النيل الأزرق لخدمة دولة السودان.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 701,
"type": "multiple choice",
"prompt": "تحملت مصر تكاليف إنشاء خزان مائي لتوليد الطاقة الكهربائية وتخزين المياه بدولة السودان هو خزان:",
"options": ["سد أوين", "جبل الأولياء", "خزان سنار", "السد العالي"],
"answer": "جبل الأولياء"
},
{
"id": 702,
"type": "true/false",
"prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات المائية الضارة المانعة للجريان.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 703,
"type": "multiple choice",
"prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي إنشاء مركز للبحوث المائية في دولة:",
"options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
"answer": "تنزانيا"
},
{
"id": 704,
"type": "true/false",
"prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف.",
"options": ["صح", "خطأ"],
"answer": "صح"
    },
    {
        "id": 706,
        "type": "true/false",
        "prompt": "الدولتان العربيتان الإفريقيتان اللتان تقعان بالكامل في نصف الكرة الأرضية الغربي تطلان معاً على البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 707,
        "type": "multiple choice",
        "prompt": "إذا تحركت سفينة تجارية من خليج غينيا متجهة مباشرة نحو الساحل الشمالي لمصر، فإنها ستسير عبر المحيط الأطلنطي ثم تعبر مضيق:",
        "options": ["باب المندب", "جبل طارق", "موزمبيق", "قناة السويس"],
        "answer": "جبل طارق"
    },
    {
        "id": 709,
        "type": "multiple choice",
        "prompt": "العامل التضاريسي المشترك الذي تسبب في تشكيل كل من جبال كينيا وكلمنجارو وهضبة الحبشة هو:",
        "options": ["الحركات الالتوائية", "الطفوح والثورانات البركانية", "الانكسارات الصخرية الصلبة", "التعرية المائية النهرية"],
        "answer": "الطفوح والثورانات البركانية"
    },
    {
        "id": 711,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية الشرقية في كينيا بالضيق نتيجة اقترابها المباشر من تضاريس هضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "البحيرات الاستوائية"
    },
    {
        "id": 712,
        "type": "true/false",
        "prompt": "يتطابق الامتداد الفلكي لمدار السرطان في شمال إفريقيا مع امتداد هضبة شمال إفريقيا عظيمة الاتساع.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 713,
        "type": "multiple choice",
        "prompt": "تشترك دولتا مصر والسودان معاً في كونهما دولاً ساحلية تطلان على نفس البحر، كما يجمع بينهما تضاريس جبلية انكسارية هي جبال:",
        "options": ["أطلس", "الكاب", "البحر الأحمر", "دراكنزبرج"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 714,
        "type": "true/false",
        "prompt": "انتقلت بعض الثقافات والحضارات من إفريقيا إلى آسيا عبر ممر سيناء التاريخي مثل الحضارة الإسلامية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 715,
        "type": "multiple choice",
        "prompt": "تجمع مائي إقليمي يضم دول حوض نهر النيل، يهدف إلى الحفاظ على المصالح المشتركة والتشاور، ويعني اسمه (الإخاء):",
        "options": ["الاتحاد الإفريقي", "تجمع الكوميسا", "تجمع الأندوجو", "الأمم المتحدة للمجاري المائية"],
        "answer": "تجمع الأندوجو"
    },
    {
        "id": 716,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة بسقوط أمطار شتوية غزيرة وهي المنبع الدائم لمياه نهر النيل.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 717,
        "type": "multiple choice",
        "prompt": "الرافد المائي لنهر النيل الذي يصب مباشرة في مياه بحيرة فيكتوريا العذبة من جهة الغرب هو نهر:",
        "options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
        "answer": "كاجيرا"
    },
    {
        "id": 718,
        "type": "true/false",
        "prompt": "يتطابق سبب الخصوبة العالية لتربة سهول وادي النيل في مصر مع تربة هضبة الحبشة نتيجة لعمليات نقل الطمي النهري.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 719,
        "type": "multiple choice",
        "prompt": "المشروع المائي المستدام الذي ساهمت مصر في دفع وتكفل كامل تكاليف إنشائه في دولة السودان لتوليد الطاقة هو:",
        "options": ["سد أوين", "خزان سنار", "خزان جبل الأولياء", "السد العالي"],
        "answer": "خزان جبل الأولياء"
    },
    {
        "id": 720,
        "type": "true/false",
        "prompt": "نصت اتفاقية عام 1929م الإقليمية للمياه على التزام دول الحوض بعدم القيام بأي مشروعات بغير اتفاق مسبق مع مصر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 721,
        "type": "multiple choice",
        "prompt": "الحضارة الإفريقية القديمة التي نشأت وازدهرت تاريخياً على أرض دولة تونس الحالية هي حضارة:",
        "options": ["كوش", "أكسوم", "قرطاج", "المصرية القديمة"],
        "answer": "قرطاج"
    },
    {
        "id": 722,
        "type": "true/false",
        "prompt": "تعد دولة ناميبيا ودولة أنغولا من أمثلة الدول الحبيسة داخل القارة الإفريقية وفقاً للخريطة السياسية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 723,
        "type": "multiple choice",
        "prompt": "تضم قارة إفريقيا تصنيفات متعددة للدول، وتعد دولتا تشاد والنيجر من أمثلة الدول:",
        "options": ["الساحلية", "الحبيسة", "الجزرية", "العربية بالكامل"],
        "answer": "الحبيسة"
    },
    {
        "id": 724,
        "type": "true/false",
        "prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما عمق دورها وعلاقاتها مع دول وشعوب القارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 725,
        "type": "multiple choice",
        "prompt": "الرحالة العربي الذي قام برحلات في شمال وغرب إفريقيا واخترق الصحراء الكبرى حتى وصل لدولة مالي هو:",
        "options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "الإدريسي"],
        "answer": "ابن بطوطة"
    },
    {
        "id": 726,
        "type": "true/false",
        "prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا بالدوران حولها في القرن الخامس عشر الميلادي خلال عهد الأمير هنري الملاح.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 727,
        "type": "multiple choice",
        "prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات استكشافية عام 1839م انتهت جغرافياً باكتشاف النيل:",
        "options": ["الأزرق", "عطبرة", "الأبيض", "الفيضي"],
        "answer": "النيل الأبيض"
    },
    {
        "id": 728,
        "type": "true/false",
        "prompt": "وصل حكم المد والسيطرة المصرية في عهد الخديو إسماعيل حفيد محمد علي إلى جنوب دائرة الاستواء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 729,
        "type": "multiple choice",
        "prompt": "الظاهرة التضاريسية المنتشرة فوق هضبة شمال إفريقيا وتقع على الحدود المشتركة بين مصر وليبيا والسودان هي:",
        "options": ["منخفض القطارة", "واحة سيوة", "جبل العوينات", "واحة الجوف"],
        "answer": "جبل العوينات"
    },
    {
        "id": 730,
        "type": "true/false",
        "prompt": "تقع واحة الجوف كإحدى الظاهرات التضاريسية لهضبة شمال إفريقيا داخل دولة مصر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 731,
        "type": "multiple choice",
        "prompt": "من المظاهر التضاريسية المنتشرة فوق هضبة شمال إفريقيا في دولة ليبيا واحة:",
        "options": ["سيوة", "القطارة", "الجوف", "عين صالح"],
        "answer": "الجوف"
    },
    {
        "id": 732,
        "type": "true/false",
        "prompt": "تتميز الهضبة الجنوبية لقارة إفريقيا بأنها تنحدر بشدة نحو السواحل الغربية للقارة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 733,
        "type": "multiple choice",
        "prompt": "مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه بشكل عام من الجنوب إلى الشمال هي:",
        "options": ["حوض نهر النيل", "الأخدود الإفريقي العظيم", "السهول الفيضية للنيل", "سلاسل جبال أطلس"],
        "answer": "الأخدود الإفريقي العظيم"
    },
    {
        "id": 734,
        "type": "true/false",
        "prompt": "يُعد كل من البحر الأحمر وخليج عدن وخليج العقبة من الأجزاء التابعة للأخدود الإفريقي العظيم شرق القارة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 735,
        "type": "multiple choice",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) في شمال غرب القارة بينهما هضبة:",
        "options": ["شمال إفريقيا", "الحبشة", "الشطوط", "البحيرات الاستوائية"],
        "answer": "الشطوط"
    },
    {
        "id": 736,
        "type": "true/false",
        "prompt": "تُصنف جبال أطلس في شمال غرب القارة وجبال الكاب في جنوبها على أنهما جبال انكسارية صلبة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 737,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلسلة جبال البحر الأحمر الانكسارية وتوجد داخل حدود مصر هي جبل:",
        "options": ["توبقال", "شايب البنات", "كينيا", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 738,
        "type": "true/false",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب شدة ارتفاعه وعلو قمته.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 739,
        "type": "multiple choice",
        "prompt": "تساهم المناطق الجبلية في قارة إفريقيا في دعم الأنشطة الاقتصادية الهامة مثل قطاعي التعدين والصناعة و:",
        "options": ["الرعي الجاف", "صيد الأسماك النهرية", "السياحة", "استصلاح الصحاري الملحية"],
        "answer": "السياحة"
    },
    {
        "id": 740,
        "type": "true/false",
        "prompt": "تتميز السهول الفيضية في إفريقيا بصلاحيتها التامة للزراعة نتيجة للمواد والترسبات الطمية التي كونتها الأنهار.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 741,
        "type": "multiple choice",
        "prompt": "تضيق السهول الساحلية للبحر المتوسط في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "الكاب", "أطلس", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 742,
        "type": "true/false",
"prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير والخلو من الحواجز الجبلية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 743,
"type": "multiple choice",
"prompt": "تتميز السهول الساحلية للمحيط الهندي باتساعها الواضح في دولة تنزانيا بينما تضيق في دولة:",
"options": ["مصر", "السودان", "كينيا", "الصومال"],
"answer": "كينيا"
},
{
"id": 744,
"type": "true/false",
"prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي لإفريقيا مضيق موزمبيق.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 745,
"type": "multiple choice",
"prompt": "من الجزر الإفريقية التي تقع في المحيط الهندي وتتميز بأنها تقع شمال غرب جزيرة مدغشقر جزر:",
"options": ["سيشل", "القمر", "موريشيوس", "زنجبار"],
"answer": "القمر"
},
{
"id": 746,
"type": "true/false",
"prompt": "تشغل مساحة حوض نهر النيل الإجمالية نحو 10% من المساحة الكلية لقارة إفريقيا.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 747,
"type": "multiple choice",
"prompt": "يمتد مجرى نهر النيل وروافده داخل أراضي إحدى عشرة دولة إفريقية، ولذلك يُصنف بأنه نهر:",
"options": ["محلي", "إقليمي", "دولي", "ساحلي"],
"answer": "دولي"
},
{
"id": 748,
"type": "true/false",
"prompt": "تقع منابع نهر النيل الدائمة (الاستوائية) في نطاق تضاريس هضبة البحيرات الاستوائية وتتميز بسقوط الأمطار طوال العام.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 749,
"type": "multiple choice",
"prompt": "من الروافد الموسمية الإثيوبية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نحو المصب نهر عطبرة ونهر:",
"options": ["كاجيرا", "بحر الغزال", "النيل الأزرق", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 750,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا كأحد جهود التنمية المائية المستدامة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 751,
"type": "multiple choice",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
"options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
"answer": "أوين"
},
{
"id": 752,
"type": "true/false",
"prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات المائية الضارة المانعة للجريان.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 753,
"type": "multiple choice",
"prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي إنشاء مركز للبحوث المائية في دولة:",
"options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
"answer": "تنزانيا"
},
{
"id": 754,
"type": "true/false",
"prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 755,
        "type": "multiple choice",
        "prompt": "يحد قارة افريقيا من جهة الشرق مسطحان مائيان هما المحيط الهندي و:",
        "options": ["البحر المتوسط", "البحر الأحمر", "المحيط الأطلنطي", "خليج غينيا"],
        "answer": "البحر الأحمر"
    },
    {
        "id": 756,
        "type": "true/false",
        "prompt": "تقترب قارة إفريقيا من قارة آسيا جغرافياً عند ممر مائي استراتيجي هو مضيق جبل طارق.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 757,
        "type": "multiple choice",
        "prompt": "الدولتان العربيتان الإفريقيتان اللتان تقعان بأكملهما في النصف الكروي الغربي وفقاً لخريطة المنهج هما المغرب و:",
        "options": ["الجزائر", "تونس", "موريتانيا", "ليبيا"],
        "answer": "موريتانيا"
    },
    {
        "id": 758,
        "type": "true/false",
        "prompt": "تتقاطع دائرة الاستواء الفلكية مباشرة في وسط القارة مع هضبة الحبشة وجبل كينيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 759,
        "type": "multiple choice",
        "prompt": "أي من الدول العربية الإفريقية التالية يتقاطع فيها مدار السرطان الفلكي مع خط الطول الرئيسي جرينتش؟",
        "options": ["مصر", "ليبيا", "تونس", "الجزائر"],
        "answer": "الجزائر"
    },
    {
        "id": 760,
        "type": "true/false",
        "prompt": "تعد دولة الصومال الدولة العربية الوحيدة في القارة الإفريقية التي تمر بها دائرة الاستواء.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 761,
        "type": "multiple choice",
        "prompt": "نشأت على أرض القارة الإفريقية قديماً حضارة أكسوم، وتقع أراضيها التاريخية حالياً في دولتي:",
        "options": ["مصر والسودان", "تونس والجزائر", "إريتريا وإثيوبيا", "ليبيا وتشاد"],
        "answer": "إريتريا وإثيوبيا"
    },
    {
        "id": 762,
        "type": "true/false",
        "prompt": "تطابقت جبال كينيا وكلمنجارو في وسط القارة من حيث سبب النشأة، حيث تكونتا نتيجة الثورانات البركانية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 763,
        "type": "multiple choice",
        "prompt": "يتشابه سبب النشأة التكوينية الباطنية لجبال أطلس في الشمال الغربي مع جبال الكاب في الجنوب بوصفهما جبالاً:",
        "options": ["انكسارية", "التوائية", "بركانية", "تصدعية"],
        "answer": "التوائية"
    },
    {
        "id": 764,
        "type": "true/false",
        "prompt": "تتميز جبال البحر الأحمر بأنها جبال انكسارية تمتد في مصر والسودان ودولة إريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 765,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلاسل جبال البحر الأحمر الانكسارية وتقع داخل الحدود الجغرافية لمصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 766,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) بينهما هضبة الشطوط بدولة الجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 767,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب عامل:",
        "options": ["الموقع الفلكي القطبي", "شدة الارتفاع وعلو القمة", "القرب من المحيط الهندي", "تأثير الرياح التجارية"],
        "answer": "شدة الارتفاع وعلو القمة"
    },
    {
        "id": 768,
        "type": "true/false",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة بين مصر وليبيا ودولة السودان.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 769,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "الجزائر", "مصر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 770,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بخصوبة تربتها نتيجة لتعرضها القديم للطفوح البركانية الصخرية المنصهرة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 771,
        "type": "multiple choice",
        "prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 772,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 773,
        "type": "multiple choice",
        "prompt": "يعتبر البحر الأحمر وخليج عدن وخليج ........ من الأجزاء الطبيعية التابعة للأخدود الإفريقي العظيم شرق القارة:",
        "options": ["العقبة", "السويس", "غينيا", "العرب"],
        "answer": "العقبة"
    },
    {
        "id": 774,
        "type": "true/false",
        "prompt": "تنحدر تضاريس هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 775,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للبحر المتوسط بضيقها الواضح في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "أطلس", "الكاب", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 776,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير والخلو التام من المرتفعات الجبلية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 777,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة:",
        "options": ["تنزانيا", "كينيا", "مصر", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 778,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها التضاريسي الواضح في دولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 779,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي للقارة مضيق مائي هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 780,
        "type": "true/false",
        "prompt": "تقع جزر القمر في مياه المحيط الهندي وتحديداً في جهة الشمال الغربي من جزيرة مدغشقر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 781,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو حوض:",
        "options": ["نهر النيجر", "النهر الدولي", "نهر النيل", "الدلتا المائية"],
        "answer": "نهر النيل"
    },
    {
        "id": 782,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية حوالي 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 783,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 784,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان وهما من الدول العربية الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 785,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي اقترحته مصر عام 1983م للتشاور والتنسيق ودعم التعاون بين دول حوض النيل يُعرف باسم تجمع:",
        "options": ["الاتحاد الإفريقي", "الأندوجو", "الكوميسا", "سيا المائي"],
        "answer": "الأندوجو"
    },
    {
        "id": 786,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'الإخاء'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 787,
        "type": "multiple choice",
        "prompt": "أشار الجغرافي جمال حمدان إلى ميزة جغرافية لنهر النيل أدت لاستدامته ووصوله لمصر وهي أنه نهر:",
        "options": ["أحادي المنبع", "ثنائي المنبع", "محلي المجرى", "موسمي الفيضان"],
        "answer": "ثنائي المنبع"
    },
    {
        "id": 788,
        "type": "true/false",
        "prompt": "تعد هضبة البحيرات الاستوائية في وسط القارة هي المنبع الدائم لنهر النيل وتتميز بسقوط الأمطار طوال العام.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 789,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة (الإثيوبية) بالنسبة لمياه نهر النيل الجارية شمالاً هي المنبع البارز المسمى بـ المنبع:",
        "options": ["الدائم", "الموسمي", "المؤقت", "الفرعي"],
        "answer": "الموسمي"
    },
    {
        "id": 790,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية (هضبة الحبشة) بسقوط الأمطار الصيفية الغزيرة عليها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 791,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الدائمة إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر ووجود:",
        "options": ["الطفوح البركانية", "الانكسارات الطولية", "المستنقعات", "الإنحدار الشديد نحو الجنوب"],
        "answer": "المستنقعات"
    },
    {
        "id": 792,
        "type": "true/false",
        "prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعتبر من أهم بحيرات المنابع الدائمة الاستوائية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 793,
"type": "multiple choice",
"prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب وهو نهر:",
"options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 794,
"type": "true/false",
"prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بمياه عذبة فيسترد النيل قوته الجارية شمالاً.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 795,
"type": "multiple choice",
"prompt": "من الروافد المائية للمنابع الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
"options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 796,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا كأحد جهود التنمية المائية المستدامة الصديقة للبيئة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 797,
"type": "multiple choice",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
"options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
"answer": "أوين"
},
{
"id": 798,
"type": "true/false",
"prompt": "ساهمت مصر في إنشاء وتأسيس خزان سنار التاريخي على مجرى النيل الأزرق لخدمة دولة السودان.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 799,
"type": "multiple choice",
"prompt": "تحملت مصر تكاليف إنشاء خزان مائي لتوليد الطاقة الكهربائية وتخزين المياه بدولة السودان هو خزان:",
"options": ["سد أوين", "جبل الأولياء", "خزان سنار الجديد", "السد العالي"],
"answer": "جبل الأولياء"
},
{
"id": 800,
"type": "true/false",
"prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات المائية الضارة المانعة للجريان المائي.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 801,
"type": "multiple choice",
"prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي في دول الحوض إنشاء مركز للبحوث المائية في دولة:",
"options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
"answer": "تنزانيا"
},
{
"id": 802,
"type": "true/false",
"prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف والمناسب.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 803,
"type": "multiple choice",
"prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية دولة النيجر ودولة:",
"options": ["الصومال", "المغرب", "تشاد", "مصر"],
"answer": "تشاد"
},
{
"id": 804,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في قارة إفريقيا وتدعيم علاقاتها بشعوبها.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 805,
        "type": "multiple choice",
        "prompt": "يحد افريقيا من جهة الشمال مسطح مائي يفصلها عن أوروبا وهو:",
        "options": ["البحر الأحمر", "البحر المتوسط", "المحيط الأطلنطي", "المحيط الهندي"],
        "answer": "البحر المتوسط"
    },
    {
        "id": 806,
        "type": "true/false",
        "prompt": "تقترب قارة إفريقيا من قارة أوروبا جغرافياً عند ممر مائي استراتيجي هو مضيق باب المندب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 807,
        "type": "multiple choice",
        "prompt": "الدولتان العربيتان الإفريقيتان اللتان تقعان بأكملهما في النصف الكروي الغربي وفقاً لخريطة المنهج هما المغرب و:",
        "options": ["الجزائر", "تونس", "موريتانيا", "ليبيا"],
        "answer": "موريتانيا"
    },
    {
        "id": 809,
        "type": "multiple choice",
        "prompt": "أي من الدول العربية الإفريقية التالية يتقاطع فيها مدار السرطان الفلكي مع خط الطول الرئيسي جرينتش؟",
        "options": ["مصر", "ليبيا", "تونس", "الجزائر"],
        "answer": "الجزائر"
    },
    {
        "id": 810,
        "type": "true/false",
        "prompt": "تعد دولة الصومال الدولة العربية الوحيدة في القارة الإفريقية التي تمر بها دائرة الاستواء في ممرها الشرقي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 811,
        "type": "multiple choice",
        "prompt": "نشأت على أرض القارة الإفريقية قديماً حضارة أكسوم، وتقع أراضيها التاريخية حالياً في دولتي:",
        "options": ["مصر والسودان", "تونس والجزائر", "إريتريا وإثيوبيا", "ليبيا وتشاد"],
        "answer": "إريتريا وإثيوبيا"
    },
    {
        "id": 812,
        "type": "true/false",
        "prompt": "تطابقت جبال كينيا وكلمنجارو في وسط القارة من حيث سبب النشأة، حيث تكونتا نتيجة الحركات الالتوائية الباطنية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 813,
        "type": "multiple choice",
        "prompt": "يتشابه سبب النشأة التكوينية الباطنية لجبال أطلس في الشمال الغربي مع جبال الكاب في الجنوب بوصفهما جبالاً:",
        "options": ["انكسارية", "التوائية", "بركانية", "تصدعية"],
        "answer": "التوائية"
    },
    {
        "id": 814,
        "type": "true/false",
        "prompt": "تتميز جبال البحر الأحمر بأنها جبال انكسارية تمتد على طول ساحل البحر الأحمر في مصر والسودان ودولة إريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 815,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلاسل جبال البحر الأحمر الانكسارية وتقع داخل الحدود الجغرافية لمصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 816,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) بينهما هضبة الشطوط بدولة المغرب.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 817,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب عامل:",
        "options": ["الموقع الفلكي القطبي", "شدة الارتفاع وعلو القمة", "القرب من المحيط الهندي", "تأثير الرياح التجارية"],
        "answer": "شدة الارتفاع وعلو القمة"
    },
    {
        "id": 818,
        "type": "true/false",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة بين مصر وتونس والجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 819,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "الجزائر", "مصر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 820,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بخصوبة تربتها نتيجة لتعرضها القديم للطفوح البركانية الصخرية المنصهرة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 821,
        "type": "multiple choice",
        "prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 822,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 824,
        "type": "true/false",
        "prompt": "تنحدر تضاريس هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 825,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للبحر المتوسط بضيقها الواضح في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "أطلس", "الكاب", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 826,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير والخلو التام من المرتفعات الجبلية والقرب الساحلي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 827,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة:",
        "options": ["تنزانيا", "كينيا", "مصر", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 828,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها التضاريسي الواضح في دولة كينيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 829,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي للقارة مضيق مائي هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 830,
        "type": "true/false",
        "prompt": "تقع جزر القمر في مياه المحيط الهندي وتحديداً في جهة الشمال الشرقي من جزيرة مدغشقر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 831,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو حوض:",
        "options": ["نهر النيجر", "النهر الدولي", "نهر النيل", "الدلتا المائية"],
        "answer": "نهر النيل"
    },
    {
        "id": 832,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية حوالي 50% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 833,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 834,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان وهما من الدول العربية الإفريقية المذكورة بالحوض.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 835,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي اقترحته مصر عام 1983م للتشاور والتنسيق ودعم التعاون بين دول حوض النيل يُعرف باسم تجمع:",
        "options": ["الاتحاد الإفريقي", "الأندوجو", "الكوميسا", "سيا المائي"],
        "answer": "الأندوجو"
    },
    {
        "id": 836,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'التعاون الاقتصادي المشترك'.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 837,
        "type": "multiple choice",
        "prompt": "أشار الجغرافي جمال حمدان إلى ميزة جغرافية لنهر النيل أدت لاستدامته ووصوله لمصر وهي أنه نهر:",
        "options": ["أحادي المنبع", "ثنائي المنبع", "محلي المجرى", "موسمي الفيضان طوال العام"],
        "answer": "ثنائي المنبع"
    },
    {
        "id": 838,
        "type": "true/false",
        "prompt": "تعد هضبة الحبشة في شرق القارة هي المنبع الدائم لنهر النيل وتتميز بسقوط الأمطار طوال العام.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 839,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة (الإثيوبية) بالنسبة لمياه نهر النيل الجارية شمالاً هي المنبع البارز المسمى بـ المنبع:",
        "options": ["الدائم", "الموسمي", "المؤقت", "الفرعي"],
        "answer": "الموسمي"
    },
    {
        "id": 840,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية (هضبة الحبشة) بسقوط الأمطار الشتوية الغزيرة عليها.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 441,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الدائمة إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر ووجود:",
        "options": ["الطفوح البركانية", "الانكسارات الطولية", "المستنقعات", "الإنحدار الشديد نحو الجنوب"],
        "answer": "المستنقعات"
    },
    {
        "id": 842,
        "type": "true/false",
"prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعتبر من أهم بحيرات المنابع الموسمية الإثيوبية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 843,
"type": "multiple choice",
"prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب هو نهر:",
"options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 844,
"type": "true/false",
"prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بمياه عذبة فيسترد النيل قوته الجارية شمالاً نحو المصب.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 845,
"type": "multiple choice",
"prompt": "من الروافد المائية للمنابع الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
"options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 846,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا كأحد جهود التنمية المائية المستدامة الصديقة للبيئة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 847,
"type": "multiple choice",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
"options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
"answer": "أوين"
},
{
"id": 848,
"type": "true/false",
"prompt": "ساهمت مصر في إنشاء وتأسيس خزان جبل الأولياء التاريخي على مجرى النيل الأزرق لخدمة دولة السودان.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 849,
"type": "multiple choice",
"prompt": "تحملت مصر تكاليف إنشاء خزان مائي لتوليد الطاقة الكهربائية وتخزين المياه بدولة السودان هو خزان:",
"options": ["سد أوين", "جبل الأولياء", "خزان سنار", "السد العالي"],
"answer": "جبل الأولياء"
},
{
"id": 850,
"type": "true/false",
"prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وتانا من الحشائش والنباتات المائية الضارة المانعة للجريان المائي.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 851,
"type": "multiple choice",
"prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي في دول الحوض إنشاء مركز للبحوث المائية في دولة:",
"options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
"answer": "تنزانيا"
},
{
"id": 852,
"type": "true/false",
"prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف والمناسب.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 853,
"type": "multiple choice",
"prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية وجاء ذكرها صراحة في تصنيفات المنهج السياسي للدرس دولة النيجر ودولة:",
"options": ["الصومال", "المغرب", "تشاد", "مصر"],
"answer": "تشاد"
},
{
"id": 854,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في قارة إفريقيا وتدعيم علاقاتها بشعوبها الكبرى.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 855,
        "type": "multiple choice",
        "prompt": "المسطح المائي الذي يحد قارة إفريقيا من جهة الغرب ويفصلها عن قارتي أمريكا الشمالية والجنوبية هو المحيط:",
        "options": ["الهندي", "الأطلنطي", "الهادي", "القطبي الجنوبي"],
        "answer": "المحيط الأطلنطي"
    },
    {
        "id": 856,
        "type": "true/false",
        "prompt": "تقترب قارة إفريقيا من قارة أوروبا جغرافياً عند مضيق هرمز المائي.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 857,
        "type": "multiple choice",
        "prompt": "الدولتان العربيتان الإفريقيتان اللتان تقعان بأكملهما في النصف الكروي الغربي هما المغرب و:",
        "options": ["تونس", "الجزائر", "ليبيا", "موريتانيا"],
        "answer": "موريتانيا"
    },
    {
        "id": 858,
        "type": "true/false",
        "prompt": "تتقاطع دائرة الاستواء الفلكية مباشرة في وسط القارة تقريباً مع هضبة شمال إفريقيا وجبل كينيا البركاني.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 859,
        "type": "multiple choice",
        "prompt": "أي من الدول العربية الإفريقية التالية يتقاطع فيها مدار السرطان الفلكي مع خط الطول الرئيسي جرينتش؟",
        "options": ["مصر", "ليبيا", "الجزائر", "تونس"],
        "answer": "الجزائر"
    },
    {
        "id": 860,
        "type": "true/false",
        "prompt": "تعد دولة الصومال الدولة العربية الوحيدة في القارة الإفريقية التي تمر بها دائرة الاستواء في ممرها الشرقي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 861,
        "type": "multiple choice",
        "prompt": "نشأت على أرض القارة الإفريقية قديماً حضارة أكسوم، وتقع أراضيها التاريخية حالياً في دولتي:",
        "options": ["مصر والسودان", "إريتريا وإثيوبيا", "تونس والجزائر", "ليبيا وتشاد"],
        "answer": "إريتريا وإثيوبيا"
    },
    {
        "id": 862,
        "type": "true/false",
        "prompt": "تطابقت جبال كينيا وكلمنجارو في وسط القارة من حيث سبب النشأة، حيث تكونتا نتيجة الحركات الالتوائية الباطنية العنيفة.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 863,
        "type": "multiple choice",
        "prompt": "يتشابه سبب النشأة التكوينية الباطنية لجبال أطلس في الشمال الغربي مع جبال الكاب في الجنوب بوصفهما جبالاً:",
        "options": ["انكسارية", "التوائية", "بركانية", "تصدعية صلبة"],
        "answer": "التوائية"
    },
    {
        "id": 864,
        "type": "true/false",
        "prompt": "تتميز جبال البحر الأحمر بأنها جبال انكسارية تمتد على طول ساحل البحر الأحمر في مصر والسودان ودولة إريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 865,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلاسل جبال البحر الأحمر الانكسارية وتقع داخل الحدود الجغرافية لمصر هي جبل:",
        "options": ["العوينات", "توبقال", "شايب البنات", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 866,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) بينهما هضبة الشطوط بدولة تونس.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 867,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب عامل:",
        "options": ["الموقع الفلكي القطبي", "القرب من المحيط الهندي", "شدة الارتفاع وعلو القمة", "تأثير الرياح التجارية الجافة"],
        "answer": "شدة الارتفاع وعلو القمة"
    },
    {
        "id": 868,
        "type": "true/false",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة بين مصر وتونس والجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 869,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "مصر", "الجزائر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 870,
        "type": "true/false",
        "prompt": "تتميز هضبة الحبشة (الهضبة الإثيوبية) بخصوبة تربتها نتيجة لتعرضها القديم للطفوح البركانية الصخرية المنصهرة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 871,
        "type": "multiple choice",
        "prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
        "options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
        "answer": "الهضبة الجنوبية"
    },
    {
        "id": 872,
        "type": "true/false",
        "prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 873,
        "type": "multiple choice",
        "prompt": "يعتبر البحر الأحمر وخليج عدن وخليج ........ من الأجزاء الطبيعية التابعة للأخدود الإفريقي العظيم شرق القارة:",
        "options": ["العقبة", "عمان", "غينيا", "العرب"],
        "answer": "العقبة"
    },
    {
        "id": 874,
        "type": "true/false",
        "prompt": "تنحدر تضاريس هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 875,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للبحر المتوسط بضيقها الواضح في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "الكاب", "أطلس", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 876,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على البحر الأحمر في مصر والسودان بالاتساع الكبير والخلو التام من أي مرتفعات جبلية قريبة من الساحل.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 877,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة:",
        "options": ["تنزانيا", "مصر", "كينيا", "الصومال"],
        "answer": "كينيا"
    },
    {
        "id": 878,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية المطلة على المحيط الهندي باتساعها التضاريسي الواضح في دولة كينيا مقارنة بدولة تنزانيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 879,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي للقارة مضيق مائي هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 880,
        "type": "true/false",
        "prompt": "تقع جزر القمر في مياه المحيط الهندي وتحديداً في جهة الشمال الشرقي من جزيرة مدغشقر الفلكية.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 881,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو حوض:",
        "options": ["نهر النيجر", "نهر النيل", "النهر الدولي", "الدلتا المائية"],
        "answer": "نهر النيل"
    },
    {
        "id": 882,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية حوالي 70% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 883,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 884,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان وهما من الدول العربية الإفريقية المذكورة بالحوض.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 885,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي اقترحته مصر عام 1983م للتشاور والتنسيق ودعم التعاون بين دول حوض النيل يُعرف باسم تجمع:",
        "options": ["الاتحاد الإفريقي", "الكوميسا", "الأندوجو", "سيا المائي"],
        "answer": "الأندوجو"
    },
    {
        "id": 886,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'التحالف العسكري والسياسي المشترك'.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 887,
        "type": "multiple choice",
        "prompt": "أشار الجغرافي جمال حمدان إلى ميزة جغرافية لنهر النيل أدت لاستدامته ووصوله لمصر وهي أنه نهر:",
        "options": ["أحادي المنبع", "ثنائي المنبع", "محلي المجرى", "موسمي الفيضان طوال العام"],
        "answer": "ثنائي المنبع"
    },
    {
        "id": 888,
        "type": "true/false",
        "prompt": "تعد هضبة الحبشة في شرق القارة هي المنبع الدائم والوحيد لنهر النيل وتتميز بسقوط الأمطار طوال العام.",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 889,
        "type": "multiple choice",
        "prompt": "تعد هضبة الحبشة (الإثيوبية) بالنسبة لمياه نهر النيل الجارية شمالاً هي المنبع البارز المسمى بـ المنبع:",
        "options": ["الدائم", "الموسمي", "المؤقت", "الفرعي"],
        "answer": "الموسمي"
    },
    {
        "id": 890,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية (هضبة الحبشة) بسقوط الأمطار الشتوية الغزيرة عليها  .",
        "options": ["صح", "خطأ"],
        "answer": "خطأ"
    },
    {
        "id": 891,
        "type": "multiple choice",
        "prompt": "يقل وصول مياه المنابع الدائمة إلى مصر بالرغم من تدفقها طوال العام بسبب زيادة البخر ووجود تضاريس تعيق المجرى هي:",
        "options": ["الطفوح البركانية", "الانكسارات الطولية", "المنخفضات الجافة", "المستنقعات"],
        "answer": "المستنقعات"
    },
    {
        "id": 892,
        "type": "true/false",
"prompt": "تعد بحيرة فيكتوريا ثاني أكبر البحيرات الطبيعية العذبة في العالم وتعتبر من أهم بحيرات المنابع الموسمية الإثيوبية.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 893,
"type": "multiple choice",
"prompt": "من أهم مصادر مياه بحيرة فيكتوريا نهر يصب فيها مباشرة من جهة الغرب وهو نهر:",
"options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
"answer": "كاجيرا"
},
{
"id": 894,
"type": "true/false",
"prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بمياه عذبة فيسترد النيل قوته الجارية شمالاً نحو المصب المائي.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 895,
"type": "multiple choice",
"prompt": "من الروافد المائية للمنابع الموسمية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
"options": ["كاجيرا", "بحر الغزال", "النيل الأزرق", "بحر العرب"],
"answer": "النيل الأزرق"
},
{
"id": 896,
"type": "true/false",
"prompt": "قامت مصر بحفر عشرات الآبار لتوفير المياه النقية في دولة كينيا كأحد جهود التنمية المائية المستدامة الصديقة للبيئة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 897,
"type": "multiple choice",
"prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
"options": ["سنار", "جبل الأولياء", "أوين", "العالي"],
"answer": "أوين"
},
{
"id": 898,
"type": "true/false",
"prompt": "ساهمت مصر في إنشاء وتأسيس خزان جبل الأولياء التاريخي على مجرى النيل الأزرق لخدمة دولة السودان الشقيقة.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 899,
"type": "multiple choice",
"prompt": "تحملت مصر تكاليف إنشاء خزان مائي لتوليد الطاقة الكهربائية وتخزين المياه بدولة السودان هو خزان:",
"options": ["سد أوين", "خزان سنار", "جبل الأولياء", "السد العالي"],
"answer": "جبل الأولياء"
},
{
"id": 900,
"type": "true/false",
"prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وتانا من الحشائش والنباتات المائية الضارة المانعة للجريان المائي الحر.",
"options": ["صح", "خطأ"],
"answer": "خطأ"
},
{
"id": 901,
"type": "multiple choice",
"prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي في دول الحوض إنشاء مركز للبحوث المائية في دولة:",
"options": ["كينيا", "السودان", "تنزانيا", "أوغندا"],
"answer": "تنزانيا"
},
{
"id": 902,
"type": "true/false",
"prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف والمناسب.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 903,
"type": "multiple choice",
"prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية دولة النيجر ودولة:",
"options": ["الصومال", "المغرب", "مصر", "مالي"],
"answer": "مالي"
},
{
"id": 904,
"type": "true/false",
"prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في قارة إفريقيا وتدعيم علاقاتها بشعوبها المختلفة.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 905,
        "type": "multiple choice",
        "prompt": "أي من الدول العربية الإفريقية التالية يمر بها مدار السرطان ولا تطل على البحر المتوسط ؟",
        "options": ["مصر", "ليبيا", "الجزائر", "السودان"],
        "answer": "السودان"
    },
    {
        "id": 906,
        "type": "true/false",
        "prompt": "يمر خط جرينتش في النصف الغربي من قارة إفريقيا ويقطع دولة الجزائر ودولة مالي الحبيسة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 907,
        "type": "multiple choice",
        "prompt": "إذا تحركت سفينة من بورسعيد متجهة إلى الصومال، فإنها ستمر بالترتيب عبر البحر الأحمر ثم مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "باب المندب"
    },
    {
        "id": 908,
        "type": "true/false",
        "prompt": "تقع دولة موريتانيا بالكامل في نصف الكرة الأرضية الغربي وتعد دولة ساحلية تطل على المحيط الأطلنطي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 909,
        "type": "multiple choice",
        "prompt": "تتميز هضبة الحبشة بخصوبة تربتها العالية، وتُصنف تضاريسياً بأنها تقع في جهة إفريقيا:",
        "options": ["الشمالية", "الوسطى", "الشرقية", "الجنوبية"],
        "answer": "الشرقية"
    },
    {
        "id": 910,
        "type": "true/false",
        "prompt": "تعد هضبة البحيرات الاستوائية هي المنبع الدائم لنهر النيل وتتميز بسقوط الأمطار طوال العام.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 911,
        "type": "multiple choice",
        "prompt": "النهر الذي يصب في مياه بحيرة فيكتوريا العذبة من جهة الغرب ويعد من أهم مصادرها هو نهر:",
        "options": ["السوباط", "عطبرة", "كاجيرا", "النيل الأزرق"],
        "answer": "كاجيرا"
    },
    {
        "id": 912,
        "type": "true/false",
        "prompt": "يلتقي نهر السوباط بمجرى بحر الجبل ويمده بالمياه العذبة ليسترد النيل قوته الجارية شمالاً.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 913,
        "type": "multiple choice",
        "prompt": "من الروافد المائية للمنابع الموسمية الإثيوبية التي تمد النيل بمياهه وتساعده على الجريان شمالاً نهر عطبرة ونهر:",
        "options": ["كاجيرا", "النيل الأزرق", "بحر الغزال", "بحر العرب"],
        "answer": "النيل الأزرق"
    },
    {
        "id": 914,
        "type": "true/false",
        "prompt": "يرجع السبب الرئيسي وراء وصول كميات قليلة من مياه المنابع الدائمة إلى مصر إلى المستنقعات وزيادة البخر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 915,
        "type": "multiple choice",
        "prompt": "المصطلح الجغرافي الذي يُقصد به (المساحة التي يجري بها نهر النيل وروافده) هو:",
        "options": ["السهل الفيضي للنيل", "المجرى الدولي", "حوض نهر النيل", "الدلتا المائية"],
        "answer": "حوض نهر النيل"
    },
    {
        "id": 916,
        "type": "true/false",
        "prompt": "تشغل مساحة حوض نهر النيل الإجمالية حوالي 10% من المساحة الكلية لقارة إفريقيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 917,
        "type": "multiple choice",
        "prompt": "يُصنف نهر النيل كونه نهراً دولياً بسبب امتداد مجراه وروافده داخل أراضي كم دولة إفريقية؟",
        "options": ["8 دول", "10 دول", "11 دولة", "12 دولة"],
        "answer": "11 دولة"
    },
    {
        "id": 918,
        "type": "true/false",
        "prompt": "تضم قائمة الدول الإحدى عشرة المكونة لحوض نهر النيل دولتي مصر وجمهورية السودان من الدول العربية الإفريقية.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 919,
        "type": "multiple choice",
        "prompt": "تجمع إقليمي اقترحته مصر عام 1983م للتشاور والتنسيق ودعم التعاون بين دول حوض النيل يُعرف باسم تجمع:",
        "options": ["الاتحاد الإفريقي", "الكوميسا", "الأندوجو", "سيا المائي"],
        "answer": "الأندوجو"
    },
    {
        "id": 920,
        "type": "true/false",
        "prompt": "تعني كلمة (الأندوجو) في الأصل اللغوي السواحلي مفهوم 'الإخاء'.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 921,
        "type": "multiple choice",
        "prompt": "أشار الجغرافي جمال حمدان إلى ميزة جغرافية لنهر النيل أدت لاستدامته ووصوله لمصر وهي أنه نهر:",
        "options": ["أحادي المنبع", "ثنائي المنبع", "محلي المجرى", "موسمي الفيضان"],
        "answer": "ثنائي المنبع"
    },
    {
        "id": 922,
        "type": "true/false",
        "prompt": "تتميز منابع نهر النيل الموسمية (هضبة الحبشة) بسقوط الأمطار الغزيرة في فصل الصيف.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 923,
        "type": "multiple choice",
        "prompt": "السد المائي الذي قامت مصر بالمساهمة الكاملة في إنشائه وتشييده في دولة أوغندا لدعم التنمية المستدامة هو سد:",
        "options": ["سنار", "أوين", "جبل الأولياء", "العالي"],
        "answer": "أوين"
    },
    {
        "id": 924,
        "type": "true/false",
        "prompt": "ساهمت مصر في إنشاء وتأسيس خزان سنار التاريخي على مجرى النيل الأزرق لخدمة دولة السودان الشقيقة.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 925,
        "type": "multiple choice",
        "prompt": "تحملت مصر تكاليف إنشاء خزان مائي لتوليد الطاقة الكهربائية وتخزين المياه بدولة السودان هو خزان:",
        "options": ["سد أوين", "جبل الأولياء", "خزان سنار الجديد", "السد العالي"],
        "answer": "جبل الأولياء"
    },
    {
        "id": 926,
        "type": "true/false",
        "prompt": "ساهمت جمهورية مصر العربية في تطهير بحيرتي فيكتوريا وكيوجا من الحشائش والنباتات المائية الضارة المانعة للجريان المائي.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 927,
        "type": "multiple choice",
        "prompt": "من مشروعات مصر المائية المستدامة الموثقة لدعم البحث العلمي المائي في دول الحوض إنشاء مركز للبحوث المائية في دولة:",
        "options": ["كينيا", "تنزانيا", "السودان", "أوغندا"],
        "answer": "تنزانيا"
    },
    {
        "id": 928,
        "type": "true/false",
        "prompt": "نصت اتفاقية المبادئ عام 2015م بين مصر وإثيوبيا والسودان على مبدأ التعاون والتنمية وعدم التسبب في ضرر والاستخدام المنصف.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 929,
        "type": "multiple choice",
        "prompt": "من أمثلة الدول الحبيسة التي لا تطل على مسطحات مائية وجاء ذكرها صراحة في تصنيفات المنهج السياسي للدرس دولة النيجر ودولة:",
        "options": ["الصومال", "المغرب", "تشاد", "مصر"],
        "answer": "تشاد"
    },
    {
        "id": 930,
        "type": "true/false",
        "prompt": "تم انتخاب مصر لرئاسة الاتحاد الإفريقي عام 2019م مما ساهم في تعميق دورها الريادي في قارة إفريقيا وتدعيم علاقاتها بشعوبها.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 331,
        "type": "multiple choice",
        "prompt": "الحضارة الإفريقية القديمة التي نشأت وازدهرت تاريخياً على أرض دولة تونس الحالية هي حضارة:",
        "options": ["كوش", "أكسوم", "قرطاج", "المصرية القديمة"],
        "answer": "قرطاج"
    },
    {
        "id": 932,
        "type": "true/false",
        "prompt": "تتميز جبال البحر الأحمر بأنها جبال انكسارية تمتد على طول ساحل البحر الأحمر في مصر والسودان ودولة إريتريا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 933,
        "type": "multiple choice",
        "prompt": "أعلى قمة جبلية في سلاسل جبال البحر الأحمر الانكسارية وتقع داخل الحدود الجغرافية لمصر هي جبل:",
        "options": ["العوينات", "شايب البنات", "توبقال", "كلمنجارو"],
        "answer": "شايب البنات"
    },
    {
        "id": 934,
        "type": "true/false",
        "prompt": "تحصر سلسلتا جبال أطلس المتوازيتان (أطلس التل وأطلس الصحراء) بينهما هضبة الشطوط بدولة الجزائر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 935,
        "type": "multiple choice",
        "prompt": "يتكون الجليد فوق قمة جبل كلمنجارو بالرغم من وقوعه في المنطقة الاستوائية الحارة بسبب عامل:",
        "options": ["الموقع الفلكي القطبي", "شدة الارتفاع وعلو القمة", "القرب من المحيط الهندي", "تأثير الرياح التجارية"],
        "answer": "شدة الارتفاع وعلو القمة"
    },
    {
        "id": 936,
        "type": "true/false",
        "prompt": "يقع جبل العوينات التضاريسي على الحدود السياسية المشتركة بين مصر وليبيا ودولة السودان.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 937,
        "type": "multiple choice",
        "prompt": "من المنخفضات التضاريسية الشهيرة المنتشرة فوق سطح هضبة شمال إفريقيا منخفض القطارة في دولة:",
        "options": ["ليبيا", "الجزائر", "مصر", "تونس"],
        "answer": "مصر"
    },
    {
        "id": 938,
        "type": "true/false",
        "prompt": "تنحدر تضاريس هضبة شمال إفريقيا تدريجياً نحو الشمال حتى تلتقي بسواحل البحر المتوسط.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 939,
        "type": "multiple choice",
        "prompt": "تتميز السهول الساحلية للبحر المتوسط بضيقها الواضح في بلاد المغرب العربي بسبب اقتراب جبال:",
        "options": ["البحر الأحمر", "أطلس", "Kاب", "دراكنزبرج"],
        "answer": "أطلس"
    },
    {
        "id": 940,
        "type": "true/false",
        "prompt": "تتميز السهول الساحلية للمحيط الهندي بوجود شريط ضيق ينحصر بين الساحل وهضبة البحيرات الاستوائية في دولة كينيا.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 941,
        "type": "multiple choice",
        "prompt": "يفصل جزيرة مدغشقر (أكبر جزر القارة في المحيط الهندي) عن الساحل الشرقي للقارة مضيق مائي هو مضيق:",
        "options": ["جبل طارق", "باب المندب", "موزمبيق", "هرمز"],
        "answer": "موزمبيق"
    },
    {
        "id": 942,
        "type": "true/false",
        "prompt": "تقع جزر القمر في مياه المحيط الهندي وتحديداً في جهة الشمال الغربي من جزيرة مدغشقر.",
        "options": ["صح", "خطأ"],
        "answer": "صح"
    },
    {
        "id": 943,
"type": "multiple choice",
"prompt": "الهضبة الإفريقية التي تنحدر بشدة نحو السواحل الشرقية ويوجد في جزئها الشرقي الأخدود الإفريقي العظيم هي:",
"options": ["هضبة شمال إفريقيا", "هضبة الحبشة", "هضبة البحيرات الاستوائية", "الهضبة الجنوبية"],
"answer": "الهضبة الجنوبية"
},
{
"id": 944,
"type": "true/false",
"prompt": "الأخدود الإفريقي العظيم هو مجموعة انكسارات طولية تمتد شرق قارة إفريقيا وتتجه عموماً من الجنوب إلى الشمال.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 946,
"type": "true/false",
"prompt": "يتشابه سبب النشأة التكوينية الباطنية لجبال أطلس في الشمال الغربي مع جبال الكاب في الجنوب بوصفهما جبالاً التوائية.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 947,
"type": "multiple choice",
"prompt": "من أوائل المصريين القدماء في عصر الأسرتين الخامسة والسادسة الذين قاموا بأربع رحلات نحو الجنوب واكتشفوا أجزاء من إفريقيا:",
"options": ["الملك نخاو الثاني", "الرحالة حرخوف", "محمد علي باشا", "الخديو إسماعيل"],
"answer": "الرحالة حرخوف"
},
{
"id": 948,
"type": "true/false",
"prompt": "أرسل الملك المصري نخاو الثاني بعثة تاريخية من البحارة الفينيقيين للدوران حول إفريقيا استمرت ثلاث سنوات.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 949,
"type": "multiple choice",
"prompt": "في العصر الحديث، أرسل محمد علي باشا رحلات استكشافية عام 1839م انتهت باكتشاف النيل:",
"options": ["الأزرق", "عطبرة", "الأبيض", "الفيضي"],
"answer": "النيل الأبيض"
},
{
"id": 950,
"type": "true/false",
"prompt": "وصل حكم المد والسيطرة الجغرافية المصرية في عهد الخديو إسماعيل حفيد محمد علي إلى جنوب دائرة الاستواء.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 951,
"type": "multiple choice",
"prompt": "الرحالة العربي الذي قام برحلات في شمال وغرب إفريقيا واخترق الصحراء الكبرى حتى وصل لدولة مالي هو:",
"options": ["المسعودي", "ابن بطوطة", "ابن خلدون", "الإدريسي"],
"answer": "ابن بطوطة"
},
{
"id": 952,
"type": "true/false",
"prompt": "بدأ البرتغاليون محاولاتهم لاكتشاف إفريقيا بالدوران حولها في القرن الخامس عشر الميلادي خلال عهد الأمير هنري الملاح.",
"options": ["صح", "خطأ"],
"answer": "صح"
},
{
"id": 953,
"type": "multiple choice",
"prompt": "تضم قارة إفريقيا تصنيفات سياسية وجغرافية متعددة للدول، وتعد دولتا مالي والنيجر من أمثلة الدول:",
"options": ["الساحلية", "الحبيسة", "الجزرية", "العربية بالكامل"],
"answer": "الحبيسة"
},
{
"id": 954,
"type": "true/false",
"prompt": "تتميز جبال كينيا وجبل كلمنجارو في وسط إفريقيا بأنها جبال بركانية تكونت نتيجة الثورانات البركانية والطفوح الصخرية.",
"options": ["صح", "خطأ"],
"answer": "صح"
 }
  ]
}
@app.route('/', methods=['GET', 'POST'])
def index():
    if "phone" not in session:
        return redirect(url_for('login'))
        
    level = request.form.get('level', 'متوسط')
    num_questions = int(request.form.get('num_questions', 5))
    action = request.form.get('action', 'select')
   
    pool = QUESTIONS_DB.get(level, QUESTIONS_DB.get("متوسط", []))
   
    if request.method == 'GET' or action == 'select':
        return render_template_string(MAIN_TEMPLATE, level=level, num_questions=num_questions)
       
    elif action == 'generate':
        selected_questions = random.sample(pool, min(num_questions, len(pool))) if pool else []
        session['questions'] = selected_questions
        session['level'] = level
        session['current_index'] = 0
        session['user_answers'] = {}
        return redirect(url_for('quiz_step'))

@app.route('/quiz', methods=['GET', 'POST'])
def quiz_step():
    questions = session.get('questions', [])
    current_index = session.get('current_index', 0)
    level = session.get('level', 'متوسط')
   
    if not questions:
        return redirect(url_for('index'))
       
    if request.method == 'POST':
        ans = request.form.get('current_answer')
        
        user_answers = session.get('user_answers', {})
        user_answers[str(current_index)] = {
            "prompt": questions[current_index]['prompt'],
            "user_ans": ans if ans else "لم تتم الإجابة",
            "correct_ans": questions[current_index]['answer'],
            "is_correct": (ans == questions[current_index]['answer'])
        }
        session['user_answers'] = user_answers
       
        current_index += 1
        session['current_index'] = current_index
       
    if current_index >= len(questions):
        return redirect(url_for('results'))
       
    current_question = questions[current_index]
   
    return render_template_string(
        QUIZ_TEMPLATE,
        level=level,
        question=current_question,
        current_num=current_index + 1,
        total_questions=len(questions),
        num_questions=len(questions)
    )

@app.route('/results')
def results():
    user_answers = session.get('user_answers', {})
    level = session.get('level', 'متوسط')
   
    score = 0
    total = len(user_answers)
    results_list = []
   
    for idx, data in sorted(user_answers.items(), key=lambda x: int(x[0])):
        if data['is_correct']:
            score += 1
        results_list.append({
            "id": int(idx) + 1,
            "prompt": data['prompt'],
            "user_ans": data['user_ans'],
            "correct_ans": data['correct_ans'],
            "is_correct": data['is_correct']
        })
       
    return render_template_string(
        RESULT_TEMPLATE,
        level=level,
        score=score,
        total=total,
        results=results_list
    )

MAIN_TEMPLATE = """
<!DOCTYPE html>
<html lang="ar" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>منصة سر التفوق - تصميم الامتحان</title>
    <style>
        body { font-family: 'Tahoma', sans-serif; background-color: #114b3e; color: #333; margin: 0; padding: 20px; direction: rtl; text-align: right; }
        .main-card { max-width: 600px; margin: auto; background: white; padding: 25px; border-radius: 20px; box-shadow: 0 10px 25px rgba(0,0,0,0.2); }
        .header-badge { text-align: center; color: #d4a373; font-size: 14px; font-weight: bold; margin-bottom: 5px; }
        h2 { text-align: center; color: #114b3e; margin-top: 0; font-size: 26px; }
        .subtitle { text-align: center; color: #666; font-size: 14px; margin-bottom: 25px; }
        .section-title { font-weight: bold; color: #222; font-size: 15px; margin-bottom: 10px; }
        .levels-container { display: flex; gap: 10px; margin-bottom: 20px; }
        .level-btn { flex: 1; padding: 12px; border: 2px solid #e0e0e0; border-radius: 12px; background: #fff; cursor: pointer; text-align: center; font-weight: bold; font-size: 14px; transition: 0.3s; }
        .level-btn input { display: none; }
        .level-btn.active, .level-btn:hover { border-color: #114b3e; background: #e8f5e9; color: #114b3e; }
        .slider-container { margin-bottom: 25px; background: #f9f9f9; padding: 15px; border-radius: 12px; border: 1px solid #eee; }
        .slider-header { display: flex; justify-content: space-between; align-items: center; margin-bottom: 10px; font-weight: bold; color: #114b3e; }
        input[type=range] { width: 100%; accent-color: #114b3e; cursor: pointer; }
        .start-btn { display: block; width: 100%; background: #114b3e; color: white; padding: 14px; text-align: center; border-radius: 12px; font-weight: bold; font-size: 16px; border: none; cursor: pointer; box-shadow: 0 4px 10px rgba(17,75,62,0.3); transition: 0.3s; text-decoration: none; box-sizing: border-box; }
        .start-btn:hover { background: #0d382f; }
        .whatsapp-link-btn { display: block; width: 100%; background: #25d366; color: white; padding: 13px; text-align: center; border-radius: 12px; font-weight: bold; font-size: 15px; text-decoration: none; box-shadow: 0 4px 10px rgba(37,211,102,0.3); transition: 0.3s; margin-top: 15px; box-sizing: border-box; }
        .whatsapp-link-btn:hover { background: #1ebe57; }
    </style>
</head>
<body>
    <div class="main-card">
        <div class="header-badge">منصة سر التفوق التعليمية ✨</div>
        <h2>صمّم امتحانك</h2>
        <div class="subtitle">اختبر معلوماتك الآن بكل سهولة ⏱️</div>
       
        <form method="POST">
            <input type="hidden" name="action" value="generate">
            <div class="section-title">اختبار الوحدة الاولى دراسات اجتماعية 1 اعدادي الترم الاول     </div>
            <div class="levels-container">
                <label class="level-btn {% if level == 'مبتدئ' %}active{% endif %}">
                    <input type="radio" name="level" value="مبتدئ" {% if level == 'مبتدئ' %}checked{% endif %} onchange="updateActive(this)"> مبتدئ
                </label>
                <label class="level-btn {% if level == 'متوسط' %}active{% endif %}">
                    <input type="radio" name="level" value="متوسط" {% if level == 'متوسط' %}checked{% endif %} onchange="updateActive(this)"> متوسط
                </label>
                <label class="level-btn {% if level == 'محترف' %}active{% endif %}">
                    <input type="radio" name="level" value="محترف" {% if level == 'محترف' %}checked{% endif %} onchange="updateActive(this)"> محترف ⏱️
                </label>
            </div>
           
            <div class="slider-container">
                <div class="slider-header">
                    <span>عدد الأسئلة بالاختبار</span>
                    <span id="range-val" style="background: #114b3e; color: white; padding: 2px 10px; border-radius: 20px; font-size: 13px;">{{ num_questions }} أسئلة</span>
                </div>
                <input type="range" name="num_questions" min="5" max="15" value="{{ num_questions }}" oninput="document.getElementById('range-val').innerText = this.value + ' أسئلة'">
            </div>
           
            <button type="submit" class="start-btn">ابدأ مع سر التفوق 🚀</button>
        </form>
       
        <a href="https://wa.me/201221581154?s=t" class="whatsapp-link-btn" target="_blank">💬 للاشتراك اضغط هنا</a>
    </div>
    <script>
        function updateActive(radio) {
            document.querySelectorAll('.level-btn').forEach(b => b.classList.remove('active'));
            radio.closest('.level-btn').classList.add('active');
        }
    </script>
</body>
</html>
"""

QUIZ_TEMPLATE = """
<!DOCTYPE html>
<html lang="ar" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>منصة سر التفوق - حل الاختبار</title>
    <style>
        body { font-family: 'Tahoma', sans-serif; background-color: #114b3e; color: #333; margin: 0; padding: 20px; direction: rtl; text-align: right; }
        .main-card { max-width: 600px; margin: auto; background: white; padding: 25px; border-radius: 20px; box-shadow: 0 10px 25px rgba(0,0,0,0.2); }
        h2 { text-align: center; color: #114b3e; margin-top: 0; font-size: 26px; }
        .question-box { background: #fdfdfd; border: 1px solid #ddd; padding: 15px; margin-bottom: 20px; border-radius: 10px; border-right: 5px solid #114b3e; }
        .options-list { margin-top: 10px; display: flex; flex-direction: column; gap: 8px; }
        .option-item { background: #f9f9f9; border: 1px solid #e0e0e0; padding: 10px 12px; border-radius: 8px; cursor: pointer; font-size: 14px; }
        .option-item:hover { background: #e8f5e9; border-color: #114b3e; }
        .option-item input { margin-left: 10px; }
        .badge-type { display: inline-block; background: #e8f5e9; color: #114b3e; padding: 2px 8px; border-radius: 6px; font-size: 12px; font-weight: bold; margin-bottom: 8px; }
        .hint { color: #555; font-size: 13px; margin-top: 10px; background: #f1f8f6; padding: 8px; border-radius: 6px; }
        .start-btn { display: block; width: 100%; background: #114b3e; color: white; padding: 14px; text-align: center; border-radius: 12px; font-weight: bold; font-size: 16px; border: none; cursor: pointer; box-shadow: 0 4px 10px rgba(17,75,62,0.3); transition: 0.3s; text-decoration: none; box-sizing: border-box; }
        .start-btn:hover { background: #0d382f; }
        #timer-box { background: #ffebee; color: #c62828; border: 1px solid #ef9a9a; padding: 10px; border-radius: 10px; text-align: center; font-weight: bold; margin-bottom: 15px; font-size: 16px; display: none; }
        @media print {
            body { display: none !important; }
        }
    </style>
</head>
<body>
    <div class="main-card">
        <div style="display: flex; justify-content: space-between; align-items: center; margin-bottom: 10px; border-bottom: 2px solid #eee; padding-bottom: 10px;">
            <span style="font-size: 14px; color: #555;">المستوى: <strong style="color: #114b3e;">{{ level }}</strong></span>
            <span style="font-size: 14px; color: #555;">السؤال: <strong style="color: #114b3e;">{{ current_num }} من {{ total_questions }}</strong></span>
        </div>

        <h2>اختبار الدرس الأول الشامل</h2>
       
        <form method="POST" action="{{ url_for('quiz_step') }}" id="quiz-form">
            <div class="question-box">
                <span class="badge-type">اختيار من متعدد</span>
                <p><strong>سؤال {{ current_num }}:</strong> {{ question.prompt }}</p>
               
                <div class="options-list">
                    {% for opt in question.options %}
                        <label class="option-item">
                            <input type="radio" name="current_answer" value="{{ opt }}" required> {{ opt }}
                        </label>
                    {% endfor %}
                </div>
                <div class="hint">💡 <em>{{ question.hint }}</em></div>
            </div>
           
            <button type="submit" class="start-btn">السؤال التالي ←</button>
        </form>
    </div>
</body>
</html>
"""

RESULT_TEMPLATE = """
<!DOCTYPE html>
<html lang="ar" dir="rtl">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>نتيجة الامتحان - سر التفوق</title>
    <style>
        body { font-family: 'Tahoma', sans-serif; background-color: #114b3e; color: #333; margin: 0; padding: 20px; direction: rtl; text-align: right; }
        .main-card { max-width: 600px; margin: auto; background: white; padding: 25px; border-radius: 20px; box-shadow: 0 10px 25px rgba(0,0,0,0.2); }
        h2 { text-align: center; color: #114b3e; margin-top: 0; font-size: 26px; }
        .score-box { background: #e8f5e9; border: 2px solid #2e7d32; padding: 20px; border-radius: 15px; text-align: center; margin-bottom: 25px; }
        .score-num { font-size: 32px; font-weight: bold; color: #1b5e20; }
        .res-item { background: #f9f9f9; border: 1px solid #ddd; padding: 15px; margin-bottom: 15px; border-radius: 10px; }
        .correct { border-right: 5px solid #2e7d32; }
        .wrong { border-right: 5px solid #c62828; }
        .start-btn { display: block; width: 100%; background: #114b3e; color: white; padding: 14px; text-align: center; border-radius: 12px; font-weight: bold; font-size: 16px; border: none; cursor: pointer; box-shadow: 0 4px 10px rgba(17,75,62,0.3); transition: 0.3s; text-decoration: none; box-sizing: border-box; }
        .start-btn:hover { background: #0d382f; }
        .wa-btn { background: #25d366; margin-top: 10px; display: block; text-align: center; }
        .wa-btn:hover { background: #1ebe57; }
    </style>
</head>
<body>
    <div class="main-card">
        <h2>نتيجة اختبارك</h2>
       
        <div class="score-box">
            <p style="margin: 0 0 5px 0; font-size: 16px; color: #333;">لقد أتممت الاختبار بنجاح!</p>
            <div class="score-num">{{ score }} / {{ total }}</div>
            <p style="margin: 5px 0 0 0; font-size: 14px; color: #555;">المستوى: {{ level }}</p>
        </div>

        <h3>تفاصيل الإجابات:</h3>
        <div style="margin-top: 15px;">
            {% for r in results %}
                <div class="res-item {% if r.is_correct %}correct{% else %}wrong{% endif %}">
                    <p><strong>سؤال {{ r.id }}:</strong> {{ r.prompt }}</p>
                    <p style="margin: 5px 0; font-size: 14px;">إجابتك: <span style="font-weight: bold; color: {% if r.is_correct %}#2e7d32{% else %}#c62828{% endif %};">{{ r.user_ans }} {% if r.is_correct %}✅{% else %}❌{% endif %}</span></p>
                    {% if not r.is_correct %}
                        <p style="margin: 5px 0; font-size: 14px; color: #2e7d32;">الإجابة الصحيحة هي: <strong>{{ r.correct_ans }}</strong></p>
                    {% endif %}
                </div>
            {% endfor %}
        </div>

        <button type="button" class="start-btn print-btn" onclick="window.print()" style="background: #455a64; margin-top: 15px;">🖨️ طباعة النتيجة</button>
        <a href="/" class="start-btn" style="text-align: center; margin-top: 10px;">🔄 تصميم امتحان جديد</a>
        <a href="https://wa.me/201221581154?s=t" class="start-btn wa-btn" target="_blank">تواصل عبر الواتساب للاشتراك 💬</a>
    </div>
</body>
</html>
"""

if __name__ == "__main__":
    add_approved_student("0545494472")
    add_approved_student("0510870096")
    add_approved_student("01122775099")
    add_approved_student("01221581154")
    
    app.run(host='0.0.0.0', port=5000)
    
